{
  "version": "2026.2.26",
  "date": "2026-02-27",
  "parsedAt": "2026-02-27T03:10:27.451Z",
  "translationStatus": "pending",
  "entries": [
    {
      "category": "other",
      "scope": null,
      "original": "Highlight: External Secrets Management introduces a full `openclaw secrets` workflow (`audit`, `configure`, `apply`, `reload`) with runtime snapshot activation, strict `secrets apply` target-path validation, safer migration scrubbing, ref-only auth-profile support, and dedicated docs. (#26155) Thanks @joshavant.",
      "translated": "외부 비밀 관리: 런타임 스냅샷 활성화, 엄격한 `secrets apply` 대상 경로 검증, 더 안전한 마이그레이션 스크러빙, 참조 전용 인증 프로필 지원 및 전용 문서를 포함한 전체 `openclaw secrets` 워크플로(`audit`, `configure`, `apply`, `reload`)를 도입했습니다. (#26155) @joshavant님께 감사드립니다."
    },
    {
      "category": "other",
      "scope": null,
      "original": "ACP/Thread-bound agents: make ACP agents first-class runtimes for thread sessions with `acp` spawn/send dispatch integration, acpx backend bridging, lifecycle controls, startup reconciliation, runtime cleanup, and coalesced thread replies. (#23580) thanks @osolmaz.",
      "translated": "ACP/스레드 바인딩 에이전트: `acp` spawn/send 디스패치 통합, acpx 백엔드 브리징, 수명 주기 제어, 시작 조정, 런타임 정리 및 통합된 스레드 회신을 통해 ACP 에이전트를 스레드 세션의 퍼스트 클래스 런타임으로 개선했습니다. (#23580) @osolmaz님께 감사드립니다."
    },
    {
      "category": "other",
      "scope": null,
      "original": "Agents/Routing CLI: add `openclaw agents bindings`, `openclaw agents bind`, and `openclaw agents unbind` for account-scoped route management, including channel-only to account-scoped binding upgrades, role-aware binding identity handling, plugin-resolved binding account IDs, and optional account-binding prompts in `openclaw channels add`. (#27195) thanks @gumadeiras.",
      "translated": "에이전트/라우팅 CLI: 계정 범위 라우팅 관리를 위해 `openclaw agents bindings`, `openclaw agents bind`, `openclaw agents unbind`를 추가했습니다. 여기에는 채널 전용에서 계정 범위 바인딩으로의 업그레이드, 역할 인식 바인딩 ID 처리, 플러그인 해결 바인딩 계정 ID, `openclaw channels add` 시 선택적인 계정 바인딩 프롬프트가 포함됩니다. (#27195) @gumadeiras님께 감사드립니다."
    },
    {
      "category": "other",
      "scope": null,
      "original": "Codex/WebSocket transport: make `openai-codex` WebSocket-first by default (`transport: \"auto\"` with SSE fallback), keep explicit per-model/runtime transport overrides, and add regression coverage + docs for transport selection.",
      "translated": "Codex/WebSocket 전송: `openai-codex`를 기본적으로 WebSocket 우선으로 설정하고(`transport: \"auto\"` 및 SSE 폴백), 모델/런타임별 명시적 전송 재정의를 유지하며, 전송 선택에 대한 회귀 테스트 및 문서를 추가했습니다."
    },
    {
      "category": "other",
      "scope": null,
      "original": "Onboarding/Plugins: let channel plugins own interactive onboarding flows with optional `configureInteractive` and `configureWhenConfigured` hooks while preserving the generic fallback path. (#27191) thanks @gumadeiras.",
      "translated": "온보딩/플러그인: 일반적인 폴백 경로를 유지하면서 채널 플러그인이 선택적 `configureInteractive` 및 `configureWhenConfigured` 후크를 통해 대화형 온보딩 흐름을 직접 제어할 수 있도록 했습니다. (#27191) @gumadeiras님께 감사드립니다."
    },
    {
      "category": "other",
      "scope": null,
      "original": "Auth/Onboarding: add an explicit account-risk warning and confirmation gate before starting Gemini CLI OAuth, and document the caution in provider docs and the Gemini CLI auth plugin README. (#16683) Thanks @vincentkoc.",
      "translated": "인증/온보딩: Gemini CLI OAuth를 시작하기 전에 명시적인 계정 위험 경고 및 확인 단계를 추가하고, 제공자 문서와 Gemini CLI 인증 플러그인 README에 주의 사항을 기록했습니다. (#16683) @vincentkoc님께 감사드립니다."
    },
    {
      "category": "other",
      "scope": null,
      "original": "Android/Nodes: add Android `device` capability plus `device.status` and `device.info` node commands, including runtime handler wiring and protocol/registry coverage for device status/info payloads. (#27664) Thanks @obviyus.",
      "translated": "Android/노드: Android `device` 기능과 `device.status`, `device.info` 노드 명령을 추가했습니다. 여기에는 런타임 핸들러 연결과 장치 상태/정보 페이로드에 대한 프로토콜/레지스트리 지원이 포함됩니다. (#27664) @obviyus님께 감사드립니다."
    },
    {
      "category": "other",
      "scope": null,
      "original": "Android/Nodes: add `notifications.list` support on Android nodes and expose `nodes notifications_list` in agent tooling for listing active device notifications. (#27344) thanks @obviyus.",
      "translated": "Android/노드: Android 노드에서 `notifications.list` 지원을 추가하고, 활성 장치 알림 목록을 확인하기 위해 에이전트 도구에 `nodes notifications_list`를 노출했습니다. (#27344) @obviyus님께 감사드립니다."
    },
    {
      "category": "other",
      "scope": null,
      "original": "Docs/Contributing: add Nimrod Gutman to the maintainer roster in `CONTRIBUTING.md`. (#27840) Thanks @ngutman.",
      "translated": "문서/기여: `CONTRIBUTING.md`의 유지 관리자 명단에 Nimrod Gutman을 추가했습니다. (#27840) @ngutman님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Telegram/DM allowlist runtime inheritance: enforce `dmPolicy: \"allowlist\"` `allowFrom` requirements using effective account-plus-parent config across account-capable channels (Telegram, Discord, Slack, Signal, iMessage, IRC, BlueBubbles, WhatsApp), and align `openclaw doctor` checks to the same inheritance logic so DM traffic is not silently dropped after upgrades. (#27936) Thanks @widingmarcus-cyber.",
      "translated": "Telegram/DM 허용 목록 런타임 상속: 계정 지원 채널(Telegram, Discord, Slack, Signal, iMessage, IRC, BlueBubbles, WhatsApp)에서 유효한 계정 및 상위 구성을 사용하여 `dmPolicy: \"allowlist\"`의 `allowFrom` 요구 사항을 강제 적용했습니다. 또한 업그레이드 후 DM 트래픽이 자동으로 누락되지 않도록 `openclaw doctor` 검사를 동일한 상속 로직에 맞췄습니다. (#27936) @widingmarcus-cyber님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Delivery queue/recovery backoff: prevent retry starvation by persisting `lastAttemptAt` on failed sends and deferring recovery retries until each entry's `lastAttemptAt + backoff` window is eligible, while continuing to recover ready entries behind deferred ones. Landed from contributor PR #27710 by @Jimmy-xuzimo. Thanks @Jimmy-xuzimo.",
      "translated": "전송 대기열/복구 백오프: 전송 실패 시 `lastAttemptAt`을 유지하고 각 항목의 `lastAttemptAt + backoff` 기간이 충족될 때까지 복구 재시도를 연기하여 재시도 고갈을 방지했습니다. 연기된 항목 뒤에 있는 준비된 항목들은 계속 복구됩니다. 기여자 @Jimmy-xuzimo의 PR #27710에서 반영되었습니다. @Jimmy-xuzimo님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Gemini OAuth/Auth flow: align OAuth project discovery metadata and endpoint fallback handling for Gemini CLI auth, including fallback coverage for environment-provided project IDs. (#16684) Thanks @vincentkoc.",
      "translated": "Gemini OAuth/인증 흐름: Gemini CLI 인증을 위해 OAuth 프로젝트 검색 메타데이터 및 엔드포인트 폴백 처리를 조정했습니다. 여기에는 환경 변수로 제공된 프로젝트 ID에 대한 폴백 지원이 포함됩니다. (#16684) @vincentkoc님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Google Chat/Lifecycle: keep Google Chat `startAccount` pending until abort in webhook mode so startup is no longer interpreted as immediate exit, preventing auto-restart loops and webhook-target churn. (#27384) thanks @junsuwhy.",
      "translated": "Google Chat/수명 주기: 웹훅 모드에서 Google Chat `startAccount`를 중단될 때까지 보류 상태로 유지하여 시작이 즉시 종료로 해석되지 않도록 했습니다. 이를 통해 자동 재시작 루프와 웹훅 대상 변동을 방지했습니다. (#27384) @junsuwhy님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Temp dirs/Linux umask: force `0700` permissions after temp-dir creation and self-heal existing writable temp dirs before trust checks so `umask 0002` installs no longer crash-loop on startup. Landed from contributor PR #27860 by @stakeswky. (#27853) Thanks @stakeswky.",
      "translated": "임시 디렉터리/Linux umask: 임시 디렉터리 생성 후 `0700` 권한을 강제 적용하고, 신뢰 검사 전에 기존의 쓰기 가능한 임시 디렉터리를 자동 복구하여 `umask 0002` 설정에서 시작 시 크래시 루프가 발생하지 않도록 했습니다. 기여자 @stakeswky의 PR #27860에서 반영되었습니다. (#27853) @stakeswky님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Nextcloud Talk/Lifecycle: keep `startAccount` pending until abort and stop the webhook monitor on shutdown, preventing `EADDRINUSE` restart loops when the gateway manages account lifecycle. (#27897)",
      "translated": "Nextcloud Talk/수명 주기: `startAccount`를 중단될 때까지 보류 상태로 유지하고 종료 시 웹훅 모니터를 중지하여, 게이트웨이가 계정 수명 주기를 관리할 때 발생하는 `EADDRINUSE` 재시작 루프를 방지했습니다. (#27897)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Microsoft Teams/File uploads: acknowledge `fileConsent/invoke` immediately (`invokeResponse` before upload + file card send) so Teams no longer shows false \"Something went wrong\" timeout banners while upload completion continues asynchronously; includes updated async regression coverage. Landed from contributor PR #27641 by @scz2011.",
      "translated": "Microsoft Teams/파일 업로드: `fileConsent/invoke`를 즉시 승인(업로드 및 파일 카드 전송 전 `invokeResponse` 처리)하여, 업로드가 비동기적으로 진행되는 동안 Teams에서 \"문제가 발생했습니다\"라는 잘못된 타임아웃 배너가 표시되지 않도록 했습니다. 업데이트된 비동기 회귀 테스트가 포함되었습니다. 기여자 @scz2011의 PR #27641에서 반영되었습니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Queue/Drain/Cron reliability: harden lane draining with guaranteed `draining` flag reset on synchronous pump failures, reject new queue enqueues during gateway restart drain windows (instead of silently killing accepted tasks), add `/stop` queued-backlog cutoff metadata with stale-message skipping (while avoiding cross-session native-stop cutoff bleed), and raise isolated cron `agentTurn` outer safety timeout to avoid false 10-minute timeout races against longer agent session timeouts. (#27407, #27332, #27427)",
      "translated": "대기열/드레인/Cron 안정성: 동기식 펌프 실패 시 `draining` 플래그 재설정을 보장하여 레인 드레인을 강화하고, 게이트웨이 재시작 드레인 기간 동안 새로운 대기열 등록을 거부(수락된 작업을 자동으로 종료하는 대신)하도록 했습니다. 또한 오래된 메시지 건너뛰기를 포함한 `/stop` 대기열 백로그 컷오프 메타데이터를 추가하고(세션 간 네이티브 중지 컷오프 간섭 방지), 격리된 cron `agentTurn` 외부 안전 타임아웃을 상향하여 더 긴 에이전트 세션 타임아웃과의 10분 타임아웃 경쟁 문제를 방지했습니다. (#27407, #27332, #27427)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Typing/Main reply pipeline: always mark dispatch idle in `agent-runner` finalization so typing cleanup runs even when dispatcher `onIdle` does not fire, preventing stuck typing indicators after run completion. (#27250) Thanks @Sid-Qin.",
      "translated": "입력 중/기본 회신 파이프라인: `agent-runner` 종료 시 항상 디스패치를 유휴 상태로 표시하여, 디스패처 `onIdle`이 실행되지 않더라도 입력 중 상태 정리가 수행되도록 했습니다. 이를 통해 실행 완료 후 입력 중 표시가 멈춰 있는 현상을 방지했습니다. (#27250) @Sid-Qin님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Typing/TTL safety net: add max-duration guardrails to shared typing callbacks so stuck lifecycle edges auto-stop typing indicators even when explicit idle/cleanup signals are missed. (#27428) Thanks @Crpdim.",
      "translated": "입력 중/TTL 안전장치: 공유 입력 중 콜백에 최대 지속 시간 가드레일을 추가하여, 명시적인 유휴/정리 신호를 놓치더라도 수명 주기가 멈춘 경우 입력 중 표시가 자동으로 중지되도록 했습니다. (#27428) @Crpdim님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Typing/Cross-channel leakage: unify run-scoped typing suppression for cross-channel/internal-webchat routes, preserve current inbound origin as embedded run message channel context, harden shared typing keepalive with consecutive-failure circuit breaker edge-case handling, and enforce dispatcher completion/idle waits in extension dispatcher callsites (Feishu, Matrix, Mattermost, MSTeams) so typing indicators always clean up on success/error paths. Related: #27647, #27493, #27598. Supersedes/replaces draft PRs: #27640, #27593, #27540.",
      "translated": "입력 중/채널 간 누출: 채널 간/내부 웹챗 라우트에 대해 실행 범위의 입력 중 억제를 통합하고, 현재 인바운드 오리진을 임베디드 실행 메시지 채널 컨텍스트로 유지했습니다. 또한 연속 실패 서킷 브레이커 예외 처리를 통해 공유 입력 중 유지(keepalive)를 강화하고, 확장 디스패처 호출 지점(Feishu, Matrix, Mattermost, MSTeams)에서 디스패처 완료/유휴 대기를 강제하여 성공 또는 오류 경로에서 입력 중 표시가 항상 정리되도록 했습니다. 관련 항목: #27647, #27493, #27598. 초안 PR #27640, #27593, #27540을 대체합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Telegram/sendChatAction 401 handling: add bounded exponential backoff + temporary local typing suppression after repeated unauthorized failures to stop unbounded `sendChatAction` retry loops that can trigger Telegram abuse enforcement and bot deletion. (#27415) Thanks @widingmarcus-cyber.",
      "translated": "Telegram/sendChatAction 401 처리: 반복적인 인증 실패 후 무제한 `sendChatAction` 재시도 루프로 인해 Telegram 어뷰징 제재 및 봇 삭제가 발생하는 것을 방지하기 위해, 제한된 지수 백오프(bounded exponential backoff)와 일시적인 로컬 타이핑 억제 기능을 추가했습니다. (#27415)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Telegram/Webhook startup: clarify webhook config guidance, allow `channels.telegram.webhookPort: 0` for ephemeral listener binding, and log both the local listener URL and Telegram-advertised webhook URL with the bound port. (#25732) thanks @huntharo.",
      "translated": "Telegram/Webhook 시작: 웹훅 설정 가이드를 명확히 하고, 임시 리스너 바인딩을 위해 `channels.telegram.webhookPort: 0` 설정을 허용하며, 로컬 리스너 URL과 바인딩된 포트가 포함된 Telegram 광고 웹훅 URL을 모두 로그에 기록합니다. (#25732)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Config/Doctor allowlist safety: reject `dmPolicy: \"allowlist\"` configs with empty `allowFrom`, add Telegram account-level inheritance-aware validation, and teach `openclaw doctor --fix` to restore missing `allowFrom` entries from pairing-store files when present, preventing silent DM drops after upgrades. (#27936) Thanks @widingmarcus-cyber.",
      "translated": "Config/Doctor 화이트리스트 안전성: `allowFrom`이 비어 있는 `dmPolicy: \"allowlist\"` 설정을 거부하고, Telegram 계정 수준의 상속 인식 유효성 검사를 추가했습니다. 또한 `openclaw doctor --fix` 명령어가 페어링 저장소 파일에 있는 누락된 `allowFrom` 항목을 복구하도록 하여 업그레이드 후 DM이 소리 없이 누락되는 현상을 방지합니다. (#27936)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Browser/Chrome extension handshake: bind relay WS message handling before `onopen` and add non-blocking `connect.challenge` response handling for gateway-style handshake frames, avoiding stuck `…` badge states when challenge frames arrive immediately on connect. Landed from contributor PR #22571 by @pandego. (#22553)",
      "translated": "Browser/Chrome 확장 프로그램 핸드셰이크: `onopen` 이전에 릴레이 WS 메시지 처리를 바인딩하고 게이트웨이 방식의 핸드셰이크 프레임에 대한 비차단형 `connect.challenge` 응답 처리를 추가하여, 연결 즉시 챌린지 프레임이 도착할 때 배지 상태가 `…`로 멈추는 현상을 해결했습니다. (#22553)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Browser/Extension relay init: dedupe concurrent same-port relay startup with shared in-flight initialization promises so callers await one startup lifecycle and receive consistent success/failure results. Landed from contributor PR #21277 by @HOYALIM. (Related #20688)",
      "translated": "Browser/Extension 릴레이 초기화: 동일한 포트에서 동시에 실행되는 릴레이 시작 작업을 공유 초기화 프로미스(promise)를 통해 중복 제거하여, 호출자가 하나의 시작 주기를 기다리고 일관된 성공/실패 결과를 받도록 개선했습니다. (#21277)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Browser/Fill relay + CLI parity: accept `act.fill` fields without explicit `type` by defaulting missing/empty `type` to `text` in both browser relay route parsing and `openclaw browser fill` CLI field parsing, so relay calls no longer fail when the model omits field type metadata. Landed from contributor PR #27662 by @Uface11. (#27296) Thanks @Uface11.",
      "translated": "Browser/Fill 릴레이 및 CLI 일관성: 브라우저 릴레이 경로 파싱과 `openclaw browser fill` CLI 필드 파싱 모두에서 누락되거나 비어 있는 `type`의 기본값을 `text`로 설정하여, 명시적인 `type`이 없는 `act.fill` 필드를 허용합니다. 이를 통해 모델이 필드 유형 메타데이터를 생략해도 릴레이 호출이 실패하지 않습니다. (#27296)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Feishu/Permission error dispatch: merge sender-name permission notices into the main inbound dispatch so one user message produces one agent turn/reply (instead of a duplicate permission-notice turn), with regression coverage. (#27381) thanks @byungsker.",
      "translated": "Feishu/권한 오류 디스패치: 발신자 이름 권한 알림을 메인 인바운드 디스패치에 통합하여, 하나의 사용자 메시지가 중복된 권한 알림 턴 대신 하나의 에이전트 턴/응답을 생성하도록 수정하고 회귀 테스트를 추가했습니다. (#27381)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Agents/Canvas default node resolution: when multiple connected canvas-capable nodes exist and no single `mac-*` candidate is selected, default to the first connected candidate instead of failing with `node required` for implicit-node canvas tool calls. Landed from contributor PR #27444 by @carbaj03. Thanks @carbaj03.",
      "translated": "Agents/Canvas 기본 노드 확인: 연결된 캔버스 지원 노드가 여러 개 있고 특정 `mac-*` 후보가 선택되지 않은 경우, 암시적 노드 캔버스 도구 호출 시 `node required` 오류로 실패하는 대신 첫 번째로 연결된 후보를 기본값으로 사용합니다. (#27444)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "TUI/stream assembly: preserve streamed text across real tool-boundary drops without keeping stale streamed text when non-text blocks appear only in the final payload. Landed from contributor PR #27711 by @scz2011. (#27674)",
      "translated": "TUI/스트림 어셈블리: 최종 페이로드에만 텍스트가 아닌 블록이 나타날 때 오래된 스트리밍 텍스트를 유지하지 않으면서, 실제 도구 경계 드롭 발생 시 스트리밍된 텍스트를 보존합니다. (#27674)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Hooks/Internal `message:sent`: forward `sessionKey` on outbound sends from agent delivery, cron isolated delivery, gateway receipt acks, heartbeat sends, session-maintenance warnings, and restart-sentinel recovery so internal `message:sent` hooks consistently dispatch with session context, including `openclaw agent --deliver` runs resumed via `--session-id` (without explicit `--session-key`). Landed from contributor PR #27584 by @qualiobra. Thanks @qualiobra.",
      "translated": "Hooks/내부 `message:sent`: 에이전트 전달, cron 격리 전달, 게이트웨이 수신 확인(ack), 하트비트 전송, 세션 유지 관리 경고 및 재시작 센티널 복구 시 아웃바운드 전송에 `sessionKey`를 전달합니다. 이를 통해 명시적인 `--session-key` 없이 `--session-id`를 통해 재개된 `openclaw agent --deliver` 실행을 포함하여 내부 `message:sent` 훅이 세션 컨텍스트와 함께 일관되게 디스패치되도록 합니다. (#27584)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Pi image-token usage: stop re-injecting history image blocks each turn, process image references from the current prompt only, and prune already-answered user-image blocks in stored history to prevent runaway token growth. (#27602)",
      "translated": "Pi 이미지 토큰 사용: 매 턴마다 히스토리 이미지 블록을 다시 삽입하는 것을 중단하고, 현재 프롬프트의 이미지 참조만 처리하며, 저장된 히스토리에서 이미 답변된 사용자 이미지 블록을 제거하여 토큰이 급격히 증가하는 것을 방지합니다. (#27602)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "BlueBubbles/SSRF: auto-allowlist the configured `serverUrl` hostname for attachment fetches so localhost/private-IP BlueBubbles setups are no longer false-blocked by default SSRF checks. Landed from contributor PR #27648 by @lailoo. (#27599) Thanks @taylorhou for reporting.",
      "translated": "BlueBubbles/SSRF: 첨부 파일 가져오기를 위해 설정된 `serverUrl` 호스트 이름을 자동으로 화이트리스트에 추가하여, localhost 또는 사설 IP를 사용하는 BlueBubbles 설정이 기본 SSRF 검사에 의해 잘못 차단되지 않도록 했습니다. (#27599)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Agents/Compaction + onboarding safety: prevent destructive double-compaction by stripping stale assistant usage around compaction boundaries, skipping post-compaction custom metadata writes in the same attempt, and cancelling safeguard compaction when there are no real conversation messages to summarize; harden workspace/bootstrap detection for memory-backed workspaces; and change `openclaw onboard --reset` default scope to `config+creds+sessions` (workspace deletion now requires `--reset-scope full`). (#26458, #27314) Thanks @jaden-clovervnd, @Sid-Qin, and @widingmarcus-cyber for fix direction in #26502, #26529, and #27492.",
      "translated": "Agents/압축 및 온보딩 안전성: 압축 경계 주변의 오래된 어시스턴트 사용 기록을 제거하고, 동일한 시도 내에서 압축 후 커스텀 메타데이터 쓰기를 건너뛰며, 요약할 실제 대화 메시지가 없는 경우 보호용 압축을 취소하여 파괴적인 이중 압축을 방지합니다. 또한 메모리 기반 워크스페이스에 대한 워크스페이스/부트스트랩 감지를 강화하고, `openclaw onboard --reset`의 기본 범위를 `config+creds+sessions`로 변경했습니다(워크스페이스 삭제에는 이제 `--reset-scope full`이 필요합니다). (#26458, #27314)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "NO_REPLY suppression: suppress `NO_REPLY` before Slack API send and in sub-agent announce completion flow so sentinel text no longer leaks into user channels. Landed from contributor PRs #27529 (by @Sid-Qin) and #27535 (rewritten minimal landing by maintainers). (#27387, #27531)",
      "translated": "NO_REPLY 억제: Slack API 전송 전 및 서브 에이전트 공지 완료 흐름에서 `NO_REPLY`를 억제하여 센티널 텍스트가 사용자 채널로 유출되지 않도록 했습니다. (#27387, #27531)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Matrix/Group sender identity: preserve sender labels in Matrix group inbound prompt text (`BodyForAgent`) for both channel and threaded messages, and align group envelopes with shared inbound sender-prefix formatting so first-person requests resolve against the current sender. (#27401) thanks @koushikxd.",
      "translated": "Matrix/그룹 발신자 식별: 채널 및 스레드 메시지 모두에 대해 Matrix 그룹 인바운드 프롬프트 텍스트(`BodyForAgent`)의 발신자 라벨을 보존하고, 그룹 엔벨로프를 공유 인바운드 발신자 접두사 형식과 일치시켜 1인칭 요청이 현재 발신자를 기준으로 확인되도록 했습니다. (#27401)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Auto-reply/Streaming: suppress only exact `NO_REPLY` final replies while still filtering streaming partial sentinel fragments (`NO_`, `NO_RE`, `HEARTBEAT_...`) so substantive replies ending with `NO_REPLY` are delivered and partial silent tokens do not leak during streaming. (#19576) Thanks @aldoeliacim.",
      "translated": "자동 응답/스트리밍: 스트리밍 중인 부분적인 센티널 파편(`NO_`, `NO_RE`, `HEARTBEAT_...`)은 계속 필터링하면서 정확히 `NO_REPLY`인 최종 응답만 억제합니다. 이를 통해 `NO_REPLY`로 끝나는 실질적인 응답은 전달되도록 하고 스트리밍 중에 부분적인 무음 토큰이 유출되지 않도록 합니다. (#19576)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Auto-reply/Inbound metadata: add a readable `timestamp` field to conversation info and ignore invalid/out-of-range timestamp values so prompt assembly never crashes on malformed timestamp inputs. (#17017) thanks @liuy.",
      "translated": "자동 응답/인바운드 메타데이터: 대화 정보에 읽기 가능한 `timestamp` 필드를 추가하고 유효하지 않거나 범위를 벗어난 타임스탬프 값을 무시하여, 잘못된 형식의 타임스탬프 입력으로 인해 프롬프트 어셈블리가 중단되지 않도록 했습니다. (#17017)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Typing/Run completion race: prevent post-run keepalive ticks from re-triggering typing callbacks by guarding `triggerTyping()` with `runComplete`, with regression coverage for no-restart behavior during run-complete/dispatch-idle boundaries. (#27413) Thanks @widingmarcus-cyber.",
      "translated": "타이핑/실행 완료 레이스 컨디션: `triggerTyping()`을 `runComplete`로 보호하여 실행 후 키어라이브 틱이 타이핑 콜백을 다시 트리거하지 않도록 방지하고, 실행 완료/디스패치 유휴 경계에서의 재시작 방지 동작에 대한 회귀 테스트를 추가했습니다. (#27413)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Typing/Dispatch idle: force typing cleanup when `markDispatchIdle` never arrives after run completion, avoiding leaked typing keepalive loops in cron/announce edges. Landed from contributor PR #27541 by @Sid-Qin. (#27493)",
      "translated": "타이핑/디스패치 유휴 상태: 실행 완료 후 `markDispatchIdle`이 도착하지 않을 경우 타이핑 정리를 강제하여 cron/공지 에지에서 타이핑 키어라이브 루프가 누수되는 현상을 방지합니다. (#27493)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Telegram/Inline buttons: allow callback-query button handling in groups (including `/models` follow-up buttons) when group policy authorizes the sender, by removing the redundant callback allowlist gate that blocked open-policy groups. (#27343) Thanks @GodsBoy.",
      "translated": "Telegram/인라인 버튼: 그룹 정책이 발신자를 승인하는 경우 그룹 내 콜백 쿼리 버튼 처리( `/models` 후속 버튼 포함)를 허용합니다. 이를 위해 개방형 정책 그룹을 차단하던 불필요한 콜백 화이트리스트 게이트를 제거했습니다. (#27343)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Telegram/Streaming preview: when finalizing without an existing preview message, prime pending preview text with final answer before stop-flush so users do not briefly see stale 1-2 word fragments (for example `no` before `no problem`). (#27449) Thanks @emanuelst for the original fix direction in #19673.",
      "translated": "Telegram/스트리밍 미리보기: 기존 미리보기 메시지 없이 종료할 때, stop-flush 전에 대기 중인 미리보기 텍스트를 최종 답변으로 채워 사용자가 1~2단어의 불완전한 파편(예: `no problem` 전의 `no`)을 잠시 보게 되는 현상을 방지합니다. (#27449) #19673에서 수정 방향을 제시해 준 @emanuelst에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Browser/Extension relay CORS: handle `/json*` `OPTIONS` preflight before auth checks, allow Chrome extension origins, and return extension-origin CORS headers on relay HTTP responses so extension token validation no longer fails cross-origin. Landed from contributor PR #23962 by @miloudbelarebia. (#23842)",
      "translated": "브라우저/확장 프로그램 릴레이 CORS: 인증 확인 전에 `/json*` `OPTIONS` 프리플라이트를 처리하고, Chrome 확장 프로그램 오리진을 허용하며, 릴레이 HTTP 응답에 확장 프로그램 오리진 CORS 헤더를 반환하여 확장 프로그램 토큰 검증이 교차 오리진에서 실패하지 않도록 합니다. 기여자 @miloudbelarebia의 PR #23962를 통해 반영되었습니다. (#23842)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Browser/Extension relay auth: allow `?token=` query-param auth on relay `/json*` endpoints (consistent with relay WebSocket auth) so curl/devtools-style `/json/version` and `/json/list` probes work without requiring custom headers. Landed from contributor PR #26015 by @Sid-Qin. (#25928)",
      "translated": "브라우저/확장 프로그램 릴레이 인증: 릴레이 `/json*` 엔드포인트에서 `?token=` 쿼리 파라미터 인증을 허용하여(릴레이 WebSocket 인증과 일치), curl이나 개발자 도구 방식의 `/json/version` 및 `/json/list` 조사가 커스텀 헤더 없이도 작동하도록 합니다. 기여자 @Sid-Qin의 PR #26015를 통해 반영되었습니다. (#25928)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Browser/Extension relay shutdown: flush pending extension-request timers/rejections during relay `stop()` before socket/server teardown so in-flight extension waits do not survive shutdown windows. Landed from contributor PR #24142 by @kevinWangSheng.",
      "translated": "브라우저/확장 프로그램 릴레이 종료: 소켓/서버 해제 전 릴레이 `stop()` 중에 대기 중인 확장 프로그램 요청 타이머/거부를 플러시하여, 진행 중인 확장 프로그램 대기 상태가 종료 시점 이후까지 남지 않도록 합니다. 기여자 @kevinWangSheng의 PR #24142를 통해 반영되었습니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Browser/Extension relay reconnect resilience: keep CDP clients alive across brief MV3 extension disconnect windows, wait briefly for extension reconnect before failing in-flight CDP commands, and only tear down relay target/client state after reconnect grace expires. Landed from contributor PR #27617 by @davidemanuelDEV.",
      "translated": "브라우저/확장 프로그램 릴레이 재연결 복원력: 짧은 MV3 확장 프로그램 연결 끊김 동안 CDP 클라이언트를 유지하고, 진행 중인 CDP 명령을 실패 처리하기 전에 확장 프로그램 재연결을 잠시 기다리며, 재연결 유예 기간이 만료된 후에만 릴레이 대상/클라이언트 상태를 해제합니다. 기여자 @davidemanuelDEV의 PR #27617을 통해 반영되었습니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Browser/Route decode hardening: guard malformed percent-encoding in relay target action routes and browser route-param decoding so crafted `%` paths return `400` instead of crashing/unhandled URI decode failures. Landed from contributor PR #11880 by @Yida-Dev.",
      "translated": "브라우저/경로 디코딩 강화: 릴레이 대상 액션 경로 및 브라우저 경로 파라미터 디코딩 시 잘못된 퍼센트 인코딩을 방지하여, 조작된 `%` 경로가 충돌이나 처리되지 않은 URI 디코딩 오류 대신 `400`을 반환하도록 합니다. 기여자 @Yida-Dev의 PR #11880을 통해 반영되었습니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Feishu/Inbound message metadata: include inbound `message_id` in `BodyForAgent` on a dedicated metadata line so agents can reliably correlate and act on media/message operations that require message IDs, with regression coverage. (#27253) thanks @xss925175263.",
      "translated": "Feishu/수신 메시지 메타데이터: `BodyForAgent` 내 전용 메타데이터 줄에 수신 `message_id`를 포함하여, 에이전트가 메시지 ID가 필요한 미디어/메시지 작업을 안정적으로 연관 짓고 수행할 수 있도록 하며 회귀 테스트를 추가했습니다. (#27253) @xss925175263에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Feishu/Doc tools: route `feishu_doc` and `feishu_app_scopes` through the active agent account context (with explicit `accountId` override support) so multi-account agents no longer default to the first configured app, with regression coverage for context routing and explicit override behavior. (#27338) thanks @AaronL725.",
      "translated": "Feishu/문서 도구: `feishu_doc` 및 `feishu_app_scopes`를 활성 에이전트 계정 컨텍스트를 통해 라우팅하여(명시적 `accountId` 재정의 지원 포함), 다중 계정 에이전트가 더 이상 첫 번째로 설정된 앱을 기본값으로 사용하지 않도록 하며 컨텍스트 라우팅 및 명시적 재정의 동작에 대한 회귀 테스트를 추가했습니다. (#27338) @AaronL725에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "LINE/Inline directives auth: gate directive parsing (`/model`, `/think`, `/verbose`, `/reasoning`, `/queue`) on resolved authorization (`command.isAuthorizedSender`) so `commands.allowFrom`-authorized LINE senders are not silently stripped when raw `CommandAuthorized` is unset. Landed from contributor PR #27248 by @kevinWangSheng. (#27240)",
      "translated": "LINE/인라인 지시어 인증: 지시어 파싱(`/model`, `/think`, `/verbose`, `/reasoning`, `/queue`)을 확인된 권한(`command.isAuthorizedSender`)에 따라 제어하여, 원본 `CommandAuthorized`가 설정되지 않았을 때 `commands.allowFrom`으로 승인된 LINE 발신자가 무시되지 않도록 합니다. 기여자 @kevinWangSheng의 PR #27248을 통해 반영되었습니다. (#27240)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Onboarding/Gateway: seed default Control UI `allowedOrigins` for non-loopback binds during onboarding (`localhost`/`127.0.0.1` plus custom bind host) so fresh non-loopback setups do not fail startup due to missing origin policy. (#26157) thanks @stakeswky.",
      "translated": "온보딩/게이트웨이: 온보딩 중 루프백이 아닌 바인딩(`localhost`/`127.0.0.1` 및 커스텀 바인드 호스트)에 대해 기본 Control UI `allowedOrigins`를 초기값으로 설정하여, 새로운 비루프백 설정이 오리진 정책 누락으로 인해 시작에 실패하지 않도록 합니다. (#26157) @stakeswky에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Docker/GCP onboarding: reduce first-build OOM risk by capping Node heap during `pnpm install`, reuse existing gateway token during `docker-setup.sh` reruns so `.env` stays aligned with config, auto-bootstrap Control UI allowed origins for non-loopback Docker binds, and add GCP docs guidance for tokenized dashboard links + pairing recovery commands. (#26253) Thanks @pandego.",
      "translated": "Docker/GCP 온보딩: `pnpm install` 중 Node 힙 크기를 제한하여 첫 빌드 시 OOM 위험을 줄이고, `docker-setup.sh` 재실행 시 기존 게이트웨이 토큰을 재사용하여 `.env`가 설정과 일치하도록 유지하며, 비루프백 Docker 바인딩에 대한 Control UI 허용 오리진을 자동 부트스트랩하고, 토큰화된 대시보드 링크 및 페어링 복구 명령에 대한 GCP 문서 가이드를 추가했습니다. (#26253) @pandego에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "CLI/Gateway `--force` in non-root Docker: recover from `lsof` permission failures (`EACCES`/`EPERM`) by falling back to `fuser` kill + probe-based port checks, so `openclaw gateway --force` works for default container `node` user flows. (#27941)",
      "translated": "CLI/게이트웨이 비루트 Docker에서의 `--force`: `lsof` 권한 오류(`EACCES`/`EPERM`) 발생 시 `fuser` 종료 및 조사 기반 포트 확인으로 대체하여, 기본 컨테이너 `node` 사용자 흐름에서 `openclaw gateway --force`가 작동하도록 합니다. (#27941)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Gateway/Bind visibility: emit a startup warning when binding to non-loopback addresses so operators get explicit exposure guidance in runtime logs. (#25397) thanks @let5sne.",
      "translated": "게이트웨이/바인드 가시성: 루프백이 아닌 주소에 바인딩할 때 시작 경고를 발생시켜 운영자가 런타임 로그에서 명시적인 노출 가이드를 확인할 수 있도록 합니다. (#25397) @let5sne에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Sessions cleanup/Doctor: add `openclaw sessions cleanup --fix-missing` to prune store entries whose transcript files are missing, including doctor guidance and CLI coverage. Landed from contributor PR #27508 by @Sid-Qin. (#27422)",
      "translated": "세션 정리/Doctor: 트랜스크립트 파일이 누락된 저장소 항목을 제거하는 `openclaw sessions cleanup --fix-missing` 명령을 추가하고, doctor 가이드 및 CLI 테스트 범위를 포함했습니다. 기여자 @Sid-Qin의 PR #27508을 통해 반영되었습니다. (#27422)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Doctor/State integrity: ignore metadata-only slash routing sessions when checking recent missing transcripts so `openclaw doctor` no longer reports false-positive transcript-missing warnings for `*:slash:*` keys. (#27375) thanks @gumadeiras.",
      "translated": "Doctor/상태 무결성: 최근 누락된 트랜스크립트를 확인할 때 메타데이터 전용 슬래시 라우팅 세션을 무시하여, `openclaw doctor`가 `*:slash:*` 키에 대해 더 이상 트랜스크립트 누락 오탐 경고를 보고하지 않도록 합니다. (#27375) @gumadeiras에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "CLI/Gateway status: force local `gateway status` probe host to `127.0.0.1` for `bind=lan` so co-located probes do not trip non-loopback plaintext WebSocket checks. (#26997) thanks @chikko80.",
      "translated": "CLI/게이트웨이 상태: `bind=lan` 설정 시 로컬 `gateway status` 조사 호스트를 `127.0.0.1`로 강제하여, 동일 위치의 조사가 비루프백 일반 텍스트 WebSocket 확인에 걸리지 않도록 합니다. (#26997) @chikko80에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "CLI/Gateway auth: align `gateway run --auth` parsing/help text with supported gateway auth modes by accepting `none` and `trusted-proxy` (in addition to `token`/`password`) for CLI overrides. (#27469) thanks @s1korrrr.",
      "translated": "CLI/게이트웨이 인증: CLI 재정의 시 `token`/`password` 외에 `none` 및 `trusted-proxy`를 허용하여, `gateway run --auth` 파싱 및 도움말 텍스트를 지원되는 게이트웨이 인증 모드와 일치시킵니다. (#27469) @s1korrrr에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "CLI/Daemon status TLS probe: use `wss://` and forward local TLS certificate fingerprint for TLS-enabled gateway daemon probes so `openclaw daemon status` works with `gateway.bind=lan` + `gateway.tls.enabled=true`. (#24234) thanks @liuy.",
      "translated": "CLI/데몬 상태 TLS 조사: TLS가 활성화된 게이트웨이 데몬 조사 시 `wss://`를 사용하고 로컬 TLS 인증서 지문을 전달하여, `gateway.bind=lan` 및 `gateway.tls.enabled=true` 설정에서 `openclaw daemon status`가 작동하도록 합니다. (#24234) @liuy에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Podman/Default bind: change `run-openclaw-podman.sh` default gateway bind from `lan` to `loopback` and document explicit LAN opt-in with Control UI origin configuration. (#27491) thanks @robbyczgw-cla.",
      "translated": "Podman/기본 바인드: `run-openclaw-podman.sh`의 기본 게이트웨이 바인딩을 `lan`에서 `loopback`으로 변경하고, Control UI 오리진 설정과 함께 명시적인 LAN 사용 선택(opt-in) 방법을 문서화했습니다. (#27491) @robbyczgw-cla에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Daemon/macOS launchd: forward proxy env vars into supervised service environments, keep LaunchAgent `KeepAlive=true` semantics, and harden restart sequencing to `print -> bootout -> wait old pid exit -> bootstrap -> kickstart`. (#27276) thanks @frankekn.",
      "translated": "데몬/macOS launchd: 프록시 환경 변수를 관리 서비스 환경으로 전달하고, LaunchAgent의 `KeepAlive=true` 의미론을 유지하며, 재시작 순서를 `print -> bootout -> 이전 PID 종료 대기 -> bootstrap -> kickstart`로 강화했습니다. (#27276) @frankekn에게 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Gateway/macOS restart-loop hardening: detect OpenClaw-managed supervisor markers during SIGUSR1 restart handoff, clean stale gateway PIDs before `/restart` launchctl/systemctl triggers, and set LaunchAgent `ThrottleInterval=60` to bound launchd retry storms during lock-release races. Landed from contributor PRs #27655 (@taw0002), #27448 (@Sid-Qin), and #27650 (@kevinWangSheng). (#27605, #27590, #26904, #26736)",
      "translated": "Gateway/macOS 재시작 루프 강화: SIGUSR1 재시작 핸드오프 중 OpenClaw가 관리하는 supervisor 마커를 감지하고, `/restart` launchctl/systemctl 트리거 전 오래된 gateway PID를 정리하며, 잠금 해제 경합(lock-release races) 중 launchd 재시도 폭주를 제한하기 위해 LaunchAgent `ThrottleInterval=60`을 설정했습니다. 기여자 PR #27655(@taw0002), #27448(@Sid-Qin), #27650(@kevinWangSheng)에서 반영되었습니다. (#27605, #27590, #26904, #26736)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Models/MiniMax auth header defaults: set `authHeader: true` for both onboarding-generated MiniMax API providers and implicit built-in MiniMax (`minimax`, `minimax-portal`) provider templates so first requests no longer fail with MiniMax `401 authentication_error` due to missing `Authorization` header. Landed from contributor PRs #27622 by @riccoyuanft and #27631 by @kevinWangSheng. (#27600, #15303)",
      "translated": "Models/MiniMax 인증 헤더 기본값: 온보딩으로 생성된 MiniMax API 제공자와 암시적 내장 MiniMax(`minimax`, `minimax-portal`) 제공자 템플릿 모두에 `authHeader: true`를 설정하여, `Authorization` 헤더 누락으로 인한 MiniMax `401 authentication_error` 첫 요청 실패 문제를 해결했습니다. 기여자 PR #27622(@riccoyuanft) 및 #27631(@kevinWangSheng)에서 반영되었습니다. (#27600, #15303)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Models/Google Antigravity IDs: normalize bare `gemini-3-pro`, `gemini-3.1-pro`, and `gemini-3-1-pro` model IDs to the default `-low` thinking tier so provider requests no longer fail with 404 when the tier suffix is omitted. (#24145) Thanks @byungsker.",
      "translated": "Models/Google Antigravity ID: `gemini-3-pro`, `gemini-3.1-pro`, `gemini-3-1-pro` 모델 ID를 기본 `-low` 사고 티어로 정규화하여, 티어 접미사가 생략되었을 때 제공자 요청이 404 오류로 실패하지 않도록 수정했습니다. (#24145) @byungsker님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Auth/Auth profiles: normalize `auth-profiles.json` alias fields (`mode -> type`, `apiKey -> key`) before credential validation so entries copied from `openclaw.json` auth examples are no longer silently dropped. (#26950) thanks @byungsker.",
      "translated": "Auth/인증 프로필: 자격 증명 검증 전에 `auth-profiles.json` 별칭 필드(`mode -> type`, `apiKey -> key`)를 정규화하여, `openclaw.json` 인증 예시에서 복사한 항목이 무시되는 문제를 해결했습니다. (#26950) @byungsker님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Models/Google Gemini: treat `google` (Gemini API key auth profile) as a reasoning-tag provider to prevent `<think>` leakage, and add forward-compat model fallback for `google-gemini-cli` `gemini-3.1-pro*` / `gemini-3.1-flash*` IDs to avoid false unknown-model errors. (#26551, #26524) Thanks @byungsker.",
      "translated": "Models/Google Gemini: `google`(Gemini API 키 인증 프로필)을 추론 태그 제공자로 처리하여 `<think>` 누출을 방지하고, `google-gemini-cli`의 `gemini-3.1-pro*` / `gemini-3.1-flash*` ID에 대한 하위 호환 모델 폴백을 추가하여 잘못된 모델 오류를 방지했습니다. (#26551, #26524) @byungsker님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Models/Profile suffix parsing: centralize trailing `@profile` parsing and only treat `@` as a profile separator when it appears after the final `/`, preserving model IDs like `openai/@cf/...` and `openrouter/@preset/...` across `/model` directive parsing and allowlist model resolution, with regression coverage.",
      "translated": "Models/프로필 접미사 파싱: 후행 `@profile` 파싱을 중앙 집중화하고, 마지막 `/` 다음에 오는 `@`만 프로필 구분자로 처리하도록 수정했습니다. 이를 통해 `/model` 지시어 파싱 및 허용 목록 모델 확인 시 `openai/@cf/...` 및 `openrouter/@preset/...`와 같은 모델 ID를 보존하며, 회귀 테스트를 포함했습니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Models/OpenAI Codex config schema parity: accept `openai-codex-responses` in the config model API schema and TypeScript `ModelApi` union, with regression coverage for config validation. Landed from contributor PR #27501 by @AytuncYildizli. Thanks @AytuncYildizli.",
      "translated": "Models/OpenAI Codex 설정 스키마 일치: 설정 모델 API 스키마 및 TypeScript `ModelApi` 유니온에서 `openai-codex-responses`를 허용하고, 설정 검증에 대한 회귀 테스트를 추가했습니다. 기여자 PR #27501(@AytuncYildizli)에서 반영되었습니다. @AytuncYildizli님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Agents/Models config: preserve agent-level provider `apiKey` and `baseUrl` during merge-mode `models.json` updates when agent values are present. (#27293) thanks @Sid-Qin.",
      "translated": "Agents/모델 설정: 병합 모드 `models.json` 업데이트 시 에이전트 값이 존재하는 경우 에이전트 수준의 제공자 `apiKey` 및 `baseUrl`을 유지합니다. (#27293) @Sid-Qin님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Azure OpenAI Responses: force `store=true` for `azure-openai-responses` direct responses API calls to avoid multi-turn 400 failures. Landed from contributor PR #27499 by @polarbear-Yang. (#27497)",
      "translated": "Azure OpenAI 응답: 멀티턴 400 오류를 방지하기 위해 `azure-openai-responses` 직접 응답 API 호출 시 `store=true`를 강제 적용했습니다. 기여자 PR #27499(@polarbear-Yang)에서 반영되었습니다. (#27497)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Node exec approvals: require structured `commandArgv` approvals for `host=node`, enforce versioned `systemRunBindingV1` matching for argv/cwd/session/agent/env context with fail-closed behavior on missing/mismatched bindings, and add `GIT_EXTERNAL_DIFF` to blocked host env keys. This ships in the next npm release (`2026.2.26`). Thanks @tdjackey for reporting.",
      "translated": "Security/Node 실행 승인: `host=node`에 대해 구조화된 `commandArgv` 승인을 요구하고, argv/cwd/세션/에이전트/환경 컨텍스트에 대해 버전이 지정된 `systemRunBindingV1` 일치를 강제하며, 바인딩이 누락되거나 일치하지 않을 경우 실행을 차단(fail-closed)합니다. 또한 차단된 호스트 환경 키에 `GIT_EXTERNAL_DIFF`를 추가했습니다. 이 변경 사항은 다음 npm 릴리스(`2026.2.26`)에 포함됩니다. 제보해주신 @tdjackey님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Plugin channel HTTP auth: normalize protected `/api/channels` path checks against canonicalized request paths (case + percent-decoding + slash normalization), resolve encoded dot-segment traversal variants, and fail closed on malformed `%`-encoded channel prefixes so alternate-path variants cannot bypass gateway auth. This ships in the next npm release (`2026.2.26`). Thanks @zpbrent for reporting.",
      "translated": "Security/플러그인 채널 HTTP 인증: 보호된 `/api/channels` 경로 확인을 정규화된 요청 경로(대소문자 + 퍼센트 디코딩 + 슬래시 정규화)와 대조하고, 인코딩된 dot-segment 순회 변종을 해결하며, 잘못된 형식의 `%` 인코딩 채널 접두사에 대해 실행을 차단하여 대체 경로 변종이 게이트웨이 인증을 우회할 수 없도록 했습니다. 이 변경 사항은 다음 npm 릴리스(`2026.2.26`)에 포함됩니다. 제보해주신 @zpbrent님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Gateway node pairing: pin paired-device `platform`/`deviceFamily` metadata across reconnects and bind those fields into device-auth signatures, so reconnect metadata spoofing cannot expand node command allowlists without explicit repair pairing. This ships in the next npm release (`2026.2.26`). Thanks @76embiid21 for reporting.",
      "translated": "Security/게이트웨이 노드 페어링: 재연결 시 페어링된 장치의 `platform`/`deviceFamily` 메타데이터를 고정하고 해당 필드를 장치 인증 서명에 바인딩하여, 메타데이터 스푸핑을 통한 노드 명령 허용 목록 확장을 방지했습니다(명시적인 수리 페어링 필요). 이 변경 사항은 다음 npm 릴리스(`2026.2.26`)에 포함됩니다. 제보해주신 @76embiid21님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Sandbox path alias guard: reject broken symlink targets by resolving through existing ancestors and failing closed on out-of-root targets, preventing workspace-only `apply_patch` writes from escaping sandbox/workspace boundaries via dangling symlinks. This ships in the next npm release (`2026.2.26`). Thanks @tdjackey for reporting.",
      "translated": "Security/샌드박스 경로 별칭 가드: 기존 상위 경로를 통해 확인하여 손상된 심볼릭 링크 대상을 거부하고 루트 외부 대상에 대해 실행을 차단함으로써, 워크스페이스 전용 `apply_patch` 쓰기가 매달린(dangling) 심볼릭 링크를 통해 샌드박스/워크스페이스 경계를 벗어나는 것을 방지했습니다. 이 변경 사항은 다음 npm 릴리스(`2026.2.26`)에 포함됩니다. 제보해주신 @tdjackey님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Workspace FS boundary aliases: harden canonical boundary resolution for non-existent-leaf symlink aliases while preserving valid in-root aliases, preventing first-write workspace escapes via out-of-root symlink targets. This ships in the next npm release (`2026.2.26`). Thanks @tdjackey for reporting.",
      "translated": "Security/워크스페이스 FS 경계 별칭: 유효한 루트 내 별칭은 유지하면서 존재하지 않는 리프 심볼릭 링크 별칭에 대한 정규 경계 확인을 강화하여, 루트 외부 심볼릭 링크 대상을 통한 첫 쓰기 시 워크스페이스 이탈을 방지했습니다. 이 변경 사항은 다음 npm 릴리스(`2026.2.26`)에 포함됩니다. 제보해주신 @tdjackey님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Config includes: harden `$include` file loading with verified-open reads, reject hardlinked include aliases, and enforce include file-size guardrails so config include resolution remains bounded to trusted in-root files. This ships in the next npm release (`2026.2.26`). Thanks @zpbrent for reporting.",
      "translated": "Security/설정 포함($include): 검증된 읽기를 통해 `$include` 파일 로딩을 강화하고, 하드 링크된 포함 별칭을 거부하며, 파일 크기 제한을 적용하여 설정 포함 확인이 신뢰할 수 있는 루트 내 파일로 제한되도록 했습니다. 이 변경 사항은 다음 npm 릴리스(`2026.2.26`)에 포함됩니다. 제보해주신 @zpbrent님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Node exec approvals hardening: freeze immutable approval-time execution plans (`argv`/`cwd`/`agentId`/`sessionKey`) via `system.run.prepare`, enforce those canonical plan values during approval forwarding/execution, and reject mutable parent-symlink cwd paths during approval-plan building to prevent approval bypass via symlink rebind. This ships in the next npm release (`2026.2.26`). Thanks @tdjackey for reporting.",
      "translated": "Security/Node 실행 승인 강화: `system.run.prepare`를 통해 불변의 승인 시점 실행 계획(`argv`/`cwd`/`agentId`/`sessionKey`)을 고정하고, 승인 전달 및 실행 중에 해당 정규 계획 값을 강제하며, 심볼릭 링크 재바인딩을 통한 승인 우회를 방지하기 위해 실행 계획 생성 중 가변적인 상위 심볼릭 링크 cwd 경로를 거부합니다. 이 변경 사항은 다음 npm 릴리스(`2026.2.26`)에 포함됩니다. 제보해주신 @tdjackey님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Microsoft Teams media fetch: route Graph message/hosted-content/attachment fetches and auth-scope fallback attachment downloads through shared SSRF-guarded fetch paths, and centralize hostname-suffix allowlist policy helpers in the plugin SDK to remove channel/plugin drift. This ships in the next npm release (`2026.2.26`). Thanks @tdjackey for reporting.",
      "translated": "Security/Microsoft Teams 미디어 가져오기: Graph 메시지/호스팅된 콘텐츠/첨부 파일 가져오기 및 인증 범위 폴백 첨부 파일 다운로드를 공유된 SSRF 보호 fetch 경로를 통해 라우팅하고, 채널/플러그인 간의 차이를 제거하기 위해 플러그인 SDK에서 호스트 이름 접미사 허용 목록 정책 헬퍼를 중앙 집중화했습니다. 이 변경 사항은 다음 npm 릴리스(`2026.2.26`)에 포함됩니다. 제보해주신 @tdjackey님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Voice Call (Twilio): bind webhook replay + manager dedupe identity to authenticated request material, remove unsigned `i-twilio-idempotency-token` trust from replay/dedupe keys, and thread verified request identity through provider parse flow to harden cross-provider event dedupe. This ships in the next npm release (`2026.2.26`). Thanks @tdjackey for reporting.",
      "translated": "Security/음성 통화(Twilio): 웹훅 재전송 및 관리자 중복 제거 식별자를 인증된 요청 자료에 바인딩하고, 재전송/중복 제거 키에서 서명되지 않은 `i-twilio-idempotency-token`에 대한 신뢰를 제거하며, 교차 제공자 이벤트 중복 제거를 강화하기 위해 검증된 요청 식별자를 제공자 파싱 흐름에 전달합니다. 이 변경 사항은 다음 npm 릴리스(`2026.2.26`)에 포함됩니다. 제보해주신 @tdjackey님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Exec approvals forwarding: prefer turn-source channel/account/thread metadata when resolving approval delivery targets so stale session routes do not misroute approval prompts.",
      "translated": "Security/실행 승인 전달: 오래된 세션 경로로 인해 승인 프롬프트가 잘못 전달되지 않도록, 승인 전달 대상을 결정할 때 턴 소스(turn-source) 채널/계정/스레드 메타데이터를 우선적으로 사용합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Security/Pairing multi-account isolation: enforce account-scoped pairing allowlists and pending-request storage across core + extension message channels while preserving channel-scoped defaults for the default account. This ships in the next npm release (`2026.2.26`). Thanks @tdjackey for reporting and @gumadeiras for implementation.",
      "translated": "Security/페어링 다중 계정 격리: 기본 계정에 대한 채널 범위 기본값은 유지하면서, 코어 및 확장 메시지 채널 전반에 걸쳐 계정 범위의 페어링 허용 목록 및 대기 중인 요청 저장소를 강제 적용합니다. 이 변경 사항은 다음 npm 릴리스(`2026.2.26`)에 포함됩니다. 제보해주신 @tdjackey님과 구현해주신 @gumadeiras님 감사합니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Config/Plugins entries: treat unknown `plugins.entries.*` ids as startup warnings (ignored stale keys) instead of hard validation failures that can crash-loop gateway boot. Landed from contributor PR #27506 by @Sid-Qin. (#27455)",
      "translated": "Config/Plugins 항목: 알 수 없는 `plugins.entries.*` ID를 게이트웨이 부팅 시 크래시 루프를 유발할 수 있는 엄격한 유효성 검사 실패 대신 시작 경고(무시된 오래된 키)로 처리합니다. 기여자 @Sid-Qin의 PR #27506 반영. (#27455)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Telegram native commands: degrade command registration on `BOT_COMMANDS_TOO_MUCH` by retrying with fewer commands instead of crash-looping startup sync. Landed from contributor PR #27512 by @Sid-Qin. (#27456)",
      "translated": "Telegram 네이티브 명령어: 시작 동기화 시 크래시 루프가 발생하는 대신, `BOT_COMMANDS_TOO_MUCH` 발생 시 더 적은 수의 명령어로 재시도하여 명령어 등록 수준을 낮추어 처리합니다. 기여자 @Sid-Qin의 PR #27512 반영. (#27456)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Web tools/Proxy: route `web_search` provider HTTP calls (Brave, Perplexity, xAI, Gemini, Kimi), redirect resolution, and `web_fetch` through a shared proxy-aware SSRF guard path so gateway installs behind `HTTP_PROXY`/`HTTPS_PROXY`/`ALL_PROXY` no longer fail with transport `fetch failed` errors. (#27430) thanks @kevinWangSheng.",
      "translated": "Web tools/Proxy: `web_search` 제공자 HTTP 호출(Brave, Perplexity, xAI, Gemini, Kimi), 리다이렉트 확인 및 `web_fetch`를 프록시를 인식하는 공용 SSRF 가드 경로를 통해 라우팅하여, `HTTP_PROXY`/`HTTPS_PROXY`/`ALL_PROXY` 환경의 게이트웨이 설치 시 전송 `fetch failed` 오류가 발생하지 않도록 수정했습니다. (#27430) @kevinWangSheng님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Android/Node invoke: remove native gateway WebSocket `Origin` header to avoid false origin rejections, unify invoke command registry/policy/error parsing paths, and keep command availability checks centralized to reduce dispatcher/advertisement drift. (#27257) Thanks @obviyus.",
      "translated": "Android/Node invoke: 잘못된 오리진 거부를 방지하기 위해 네이티브 게이트웨이 WebSocket `Origin` 헤더를 제거하고, invoke 명령어 레지스트리/정책/오류 파싱 경로를 통합하며, 디스패처/광고 드리프트를 줄이기 위해 명령어 가용성 확인을 중앙 집중화했습니다. (#27257) @obviyus님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Gateway shared-auth scopes: preserve requested operator scopes for shared-token clients when device identity is unavailable, instead of clearing scopes during auth handling. Landed from contributor PR #27498 by @kevinWangSheng. (#27494)",
      "translated": "게이트웨이 공유 인증 스코프: 기기 식별 정보를 사용할 수 없을 때 인증 처리 중 스코프를 삭제하는 대신, 공유 토큰 클라이언트에 대해 요청된 오퍼레이터 스코프를 유지합니다. 기여자 @kevinWangSheng의 PR #27498 반영. (#27494)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Cron/Hooks isolated routing: preserve canonical `agent:*` session keys in isolated runs so already-qualified keys are not double-prefixed (for example `agent:main:main` no longer becomes `agent:main:agent:main:main`). Landed from contributor PR #27333 by @MaheshBhushan. (#27289, #27282)",
      "translated": "Cron/Hooks 격리 라우팅: 격리된 실행에서 정식 `agent:*` 세션 키를 유지하여 이미 정규화된 키에 접두사가 중복으로 붙지 않도록 수정했습니다(예: `agent:main:main`이 더 이상 `agent:main:agent:main:main`으로 변하지 않음). 기여자 @MaheshBhushan의 PR #27333 반영. (#27289, #27282)"
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Channels/Multi-account config: when adding a non-default channel account to a single-account top-level channel setup, move existing account-scoped top-level single-account values into `channels.<channel>.accounts.default` before writing the new account so the original account keeps working without duplicated account values at channel root; `openclaw doctor --fix` now repairs previously mixed channel account shapes the same way. (#27334) thanks @gumadeiras.",
      "translated": "Channels/Multi-account 설정: 단일 계정 최상위 채널 설정에 기본값이 아닌 채널 계정을 추가할 때, 기존 계정 범위의 최상위 단일 계정 값을 `channels.<channel>.accounts.default`로 이동시킨 후 새 계정을 작성하여 기존 계정이 채널 루트의 중복 값 없이 계속 작동하도록 합니다. `openclaw doctor --fix` 명령어도 이제 동일한 방식으로 이전에 혼합된 채널 계정 형태를 복구합니다. (#27334) @gumadeiras님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "iOS/Talk mode: stop injecting the voice directive hint into iOS Talk prompts and remove the Voice Directive Hint setting, reducing model bias toward tool-style TTS directives and keeping relay responses text-first by default. (#27543) thanks @ngutman.",
      "translated": "iOS/Talk 모드: iOS Talk 프롬프트에 음성 지시어 힌트 삽입을 중단하고 `Voice Directive Hint` 설정을 제거하여, 도구 스타일의 TTS 지시어에 대한 모델 편향을 줄이고 릴레이 응답이 기본적으로 텍스트 우선으로 유지되도록 했습니다. (#27543) @ngutman님께 감사드립니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "CI/Windows: shard the Windows `checks-windows` test lane into two matrix jobs and honor explicit shard index overrides in `scripts/test-parallel.mjs` to reduce CI critical-path wall time. (#27234) Thanks @joshavant.",
      "translated": "CI/Windows: CI 임계 경로 소요 시간을 줄이기 위해 Windows `checks-windows` 테스트 레인을 두 개의 매트릭스 작업으로 분할하고 `scripts/test-parallel.mjs`에서 명시적인 샤드 인덱스 재정의를 준수하도록 했습니다. (#27234) @joshavant님께 감사드립니다."
    }
  ],
  "translatedAt": "2026-02-27T03:34:24.598Z",
  "translationEngine": "gemini",
  "translationProvider": "gemini",
  "translationModel": "gemini-3-flash-preview",
  "translationEndpointType": "native",
  "translationCharCount": 25764
}
