{
  "version": "2.1.3",
  "parsedAt": "2026-02-05T05:07:04.100Z",
  "translationStatus": "pending",
  "entries": [
    {
      "category": "other",
      "scope": null,
      "original": "Merged slash commands and skills, simplifying the mental model with no change in behavior",
      "translation": "슬래시 명령과 스킬을 통합하여 행동 변화 없이 정신 모델을 단순화했습니다."
    },
    {
      "category": "added",
      "scope": null,
      "original": "Added release channel (`stable` or `latest`) toggle to `/config`",
      "translation": "`/config`에 릴리스 채널(`stable` 또는 `latest`) 전환 기능을 추가했습니다."
    },
    {
      "category": "added",
      "scope": null,
      "original": "Added detection and warnings for unreachable permission rules, with warnings in `/doctor` and after saving rules that include the source of each rule and actionable fix guidance",
      "translation": "도달할 수 없는 권한 규칙에 대한 감지 및 경고를 추가했으며, `/doctor`에서 경고를 제공하고 각 규칙의 출처와 실행 가능한 수정 안내를 포함하여 규칙을 저장한 후에도 경고가 표시됩니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Fixed plan files persisting across `/clear` commands, now ensuring a fresh plan file is used after clearing a conversation",
      "translation": "`/clear` 명령어 후에도 계획 파일이 남아 있는 문제를 수정하여 대화를 지운 후 새 계획 파일이 사용되도록 했습니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Fixed false skill duplicate detection on filesystems with large inodes (e.g., ExFAT) by using 64-bit precision for inode values",
      "translation": "64비트 정밀도를 사용하여 대용량 inode가 있는 파일 시스템(예: ExFAT)에서 잘못된 스킬 중복 감지를 수정했습니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Fixed mismatch between background task count in status bar and items shown in tasks dialog",
      "translation": "상태 표시줄의 백그라운드 작업 수와 작업 대화 상자에 표시된 항목 간의 불일치를 수정했습니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Fixed sub-agents using the wrong model during conversation compaction",
      "translation": "대화 압축 중에 잘못된 모델을 사용하는 하위 에이전트를 수정했습니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Fixed web search in sub-agents using incorrect model",
      "translation": "하위 에이전트에서 잘못된 모델을 사용하는 웹 검색을 수정했습니다."
    },
    {
      "category": "fixed",
      "scope": null,
      "original": "Fixed trust dialog acceptance when running from the home directory not enabling trust-requiring features like hooks during the session",
      "translation": "홈 디렉토리에서 실행할 때 신뢰 대화 상자 수락이 세션 중 후크와 같은 신뢰 요구 기능을 활성화하지 않도록 수정했습니다."
    },
    {
      "category": "improved",
      "scope": null,
      "original": "Improved terminal rendering stability by preventing uncontrolled writes from corrupting cursor state",
      "translation": "제어되지 않은 쓰기로 인해 커서 상태가 손상되는 것을 방지하여 터미널 렌더링 안정성을 개선했습니다."
    },
    {
      "category": "improved",
      "scope": null,
      "original": "Improved slash command suggestion readability by truncating long descriptions to 2 lines",
      "translation": "긴 설명을 2줄로 잘라 슬래시 명령 제안 가독성을 개선했습니다."
    },
    {
      "category": "changed",
      "scope": null,
      "original": "Changed tool hook execution timeout from 60 seconds to 10 minutes",
      "translation": "도구 후크 실행 타임아웃을 60초에서 10분으로 변경했습니다."
    },
    {
      "category": "added",
      "scope": "VSCode",
      "original": "Added clickable destination selector for permission requests, allowing you to choose where settings are saved (this project, all projects, shared with team, or session only)",
      "translation": "권한 요청을 위한 클릭 가능한 목적지 선택기를 추가하여 설정이 저장될 위치(이 프로젝트, 모든 프로젝트, 팀과 공유, 또는 세션 전용)를 선택할 수 있도록 했습니다."
    }
  ],
  "translatedAt": "2026-02-05T05:15:52.437Z",
  "translationEngine": "openai",
  "translationCharCount": 1350
}
