{"generatedAt":"2026-02-08T09:23:48.270Z","versionCount":210,"versions":[{"version":"2.1.37","date":"2026-02-07","entries":[{"category":"fixed","scope":null,"original":"Fixed an issue where /fast was not immediately available after enabling /extra-usage","translated":"/extra-usage를 활성화한 후 /fast가 즉시 사용 가능하지 않은 문제를 수정했습니다."}]},{"version":"2.1.36","date":"2026-02-07","entries":[{"category":"other","scope":null,"original":"Fast mode is now available for Opus 4.6. Learn more at https://code.claude.com/docs/en/fast-mode","translated":"이제 Opus 4.6에서 빠른 모드를 사용할 수 있습니다. 자세한 내용은 https://code.claude.com/docs/en/fast-mode에서 확인하세요."}]},{"version":"2.1.34","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed a crash when agent teams setting changed between renders","translated":"에이전트 팀 설정이 렌더링 사이에 변경될 때 발생하던 충돌 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed a bug where commands excluded from sandboxing (via `sandbox.excludedCommands` or `dangerouslyDisableSandbox`) could bypass the Bash ask permission rule when `autoAllowBashIfSandboxed` was enabled","translated":"`sandbox.excludedCommands` 또는 `dangerouslyDisableSandbox`를 통해 샌드박싱에서 제외된 명령어가 `autoAllowBashIfSandboxed`가 활성화된 경우 Bash 권한 요청 규칙을 우회할 수 있던 버그를 수정했습니다."}]},{"version":"2.1.33","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed agent teammate sessions in tmux to send and receive messages","translated":"`tmux`에서 에이전트 팀원 세션이 메시지를 보내고 받을 수 있도록 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed warnings about agent teams not being available on your current plan","translated":"현재 플랜에서 에이전트 팀이 사용 불가능하다는 경고를 수정했습니다."},{"category":"added","scope":null,"original":"Added `TeammateIdle` and `TaskCompleted` hook events for multi-agent workflows","translated":"다중 에이전트 워크플로우를 위한 `TeammateIdle` 및 `TaskCompleted` 후크 이벤트를 추가했습니다."},{"category":"added","scope":null,"original":"Added support for restricting which sub-agents can be spawned via `Task(agent_type)` syntax in agent \"tools\" frontmatter","translated":"에이전트 \"tools\" 프론트매터에서 `Task(agent_type)` 구문을 통해 생성할 수 있는 하위 에이전트를 제한하는 기능을 추가했습니다."},{"category":"added","scope":null,"original":"Added `memory` frontmatter field support for agents, enabling persistent memory with `user`, `project`, or `local` scope","translated":"에이전트에 대한 `memory` 프론트매터 필드 지원을 추가하여 `user`, `project`, `local` 범위로 지속적인 메모리를 사용할 수 있게 했습니다."},{"category":"added","scope":null,"original":"Added plugin name to skill descriptions and `/skills` menu for better discoverability","translated":"더 나은 검색성을 위해 플러그인 이름을 스킬 설명과 `/skills` 메뉴에 추가했습니다."},{"category":"fixed","scope":null,"original":"Fixed an issue where submitting a new message while the model was in extended thinking would interrupt the thinking phase","translated":"모델이 확장된 사고 상태일 때 새 메시지를 제출하면 사고 단계가 중단되는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed an API error that could occur when aborting mid-stream, where whitespace text combined with a thinking block would bypass normalization and produce an invalid request","translated":"중간 스트림 중단 시 공백 텍스트가 사고 블록과 결합되어 정규화 과정을 우회하고 잘못된 요청을 생성할 수 있는 API 오류를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed API proxy compatibility issue where 404 errors on streaming endpoints no longer triggered non-streaming fallback","translated":"스트리밍 엔드포인트에서 404 오류가 더 이상 비스트리밍 대체를 트리거하지 않는 API 프록시 호환성 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed an issue where proxy settings configured via `settings.json` environment variables were not applied to WebFetch and other HTTP requests on the Node.js build","translated":"`settings.json` 환경 변수를 통해 구성된 프록시 설정이 Node.js 빌드에서 WebFetch 및 기타 HTTP 요청에 적용되지 않는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed `/resume` session picker showing raw XML markup instead of clean titles for sessions started with slash commands","translated":"`/resume` 세션 선택기에서 슬래시 명령으로 시작된 세션에 대해 깨끗한 제목 대신 원시 XML 마크업이 표시되는 문제를 수정했습니다."},{"category":"improved","scope":null,"original":"Improved error messages for API connection failures — now shows specific cause (e.g., ECONNREFUSED, SSL errors) instead of generic \"Connection error\"","translated":"API 연결 실패에 대한 오류 메시지를 개선하여 이제 일반적인 \"연결 오류\" 대신 특정 원인(예: ECONNREFUSED, SSL 오류)을 표시합니다."},{"category":"other","scope":null,"original":"Errors from invalid managed settings are now surfaced","translated":"잘못된 관리 설정으로 인한 오류가 이제 표시됩니다."},{"category":"other","scope":null,"original":"VSCode: Added support for remote sessions, allowing OAuth users to browse and resume sessions from claude.ai","translated":"VSCode: 원격 세션을 지원하여 OAuth 사용자가 claude.ai에서 세션을 탐색하고 다시 시작할 수 있도록 했습니다."},{"category":"other","scope":null,"original":"VSCode: Added git branch and message count to the session picker, with support for searching by branch name","translated":"VSCode: 세션 선택기에 git 브랜치 및 메시지 수를 추가하고 브랜치 이름으로 검색할 수 있도록 지원했습니다."},{"category":"other","scope":null,"original":"VSCode: Fixed scroll-to-bottom under-scrolling on initial session load and session switch","translated":"VSCode: 초기 세션 로드 및 세션 전환 시 아래로 스크롤이 부족한 문제를 수정했습니다."}]},{"version":"2.1.32","date":null,"entries":[{"category":"other","scope":null,"original":"Claude Opus 4.6 is now available!","translated":"Claude Opus 4.6이 이제 사용 가능합니다!"},{"category":"added","scope":null,"original":"Added research preview agent teams feature for multi-agent collaboration (token-intensive feature, requires setting CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1)","translated":"다중 에이전트 협업을 위한 연구 미리보기 에이전트 팀 기능 추가 (토큰 집중 기능, `CLAUDE_CODE_EXPERIMENTAL_AGENT_TEAMS=1` 설정 필요)"},{"category":"other","scope":null,"original":"Claude now automatically records and recalls memories as it works","translated":"Claude가 작업하면서 자동으로 기억을 기록하고 회상합니다."},{"category":"added","scope":null,"original":"Added \"Summarize from here\" to the message selector, allowing partial conversation summarization.","translated":"메시지 선택기에 \"여기서부터 요약\" 기능 추가, 부분 대화 요약 가능."},{"category":"other","scope":null,"original":"Skills defined in `.claude/skills/` within additional directories (`--add-dir`) are now loaded automatically.","translated":"추가 디렉토리(`--add-dir`) 내 `.claude/skills/`에 정의된 스킬이 자동으로 로드됩니다."},{"category":"fixed","scope":null,"original":"Fixed `@` file completion showing incorrect relative paths when running from a subdirectory","translated":"하위 디렉토리에서 실행할 때 `@` 파일 완성 시 잘못된 상대 경로가 표시되는 문제 수정"},{"category":"changed","scope":null,"original":"Updated --resume to re-use --agent value specified in previous conversation by default.","translated":"기본적으로 이전 대화에서 지정된 --agent 값을 재사용하도록 --resume 업데이트."},{"category":"fixed","scope":null,"original":"Fixed: Bash tool no longer throws \"Bad substitution\" errors when heredocs contain JavaScript template literals like `${index + 1}`, which previously interrupted tool execution","translated":"Bash 도구가 이제 heredocs에 JavaScript 템플릿 리터럴 `${index + 1}`이 포함될 때 \"잘못된 치환\" 오류를 발생시키지 않으며, 이는 이전에 도구 실행을 중단시켰습니다."},{"category":"other","scope":null,"original":"Skill character budget now scales with context window (2% of context), so users with larger context windows can see more skill descriptions without truncation","translated":"스킬 문자 예산이 컨텍스트 창과 함께 확장되어 (컨텍스트의 2%), 더 큰 컨텍스트 창을 가진 사용자는 스킬 설명을 더 많이 볼 수 있습니다."},{"category":"fixed","scope":null,"original":"Fixed Thai/Lao spacing vowels (สระ า, ำ) not rendering correctly in the input field","translated":"입력 필드에서 태국어/라오어 모음 (สระ า, ำ)이 올바르게 렌더링되지 않는 문제 수정"},{"category":"other","scope":null,"original":"VSCode: Fixed slash commands incorrectly being executed when pressing Enter with preceding text in the input field","translated":"VSCode: 입력 필드에 텍스트가 있는 상태에서 Enter를 누를 때 슬래시 명령이 잘못 실행되는 문제 수정"},{"category":"other","scope":null,"original":"VSCode: Added spinner when loading past conversations list","translated":"VSCode: 과거 대화 목록을 로드할 때 스피너 추가"}]},{"version":"2.1.31","date":null,"entries":[{"category":"added","scope":null,"original":"Added session resume hint on exit, showing how to continue your conversation later","translated":"나중에 대화를 계속할 수 있도록 종료 시 세션 재개 힌트를 추가했습니다."},{"category":"added","scope":null,"original":"Added support for full-width (zenkaku) space input from Japanese IME in checkbox selection","translated":"체크박스 선택 시 일본어 IME에서 전각 공백 입력을 지원하도록 추가했습니다."},{"category":"fixed","scope":null,"original":"Fixed PDF too large errors permanently locking up sessions, requiring users to start a new conversation","translated":"PDF가 너무 커서 발생하는 오류로 인해 세션이 영구적으로 잠기는 문제를 수정하여 사용자가 새 대화를 시작해야 하는 문제를 해결했습니다."},{"category":"fixed","scope":null,"original":"Fixed bash commands incorrectly reporting failure with \"Read-only file system\" errors when sandbox mode was enabled","translated":"샌드박스 모드가 활성화된 상태에서 \"Read-only file system\" 오류로 인해 bash 명령어가 실패로 잘못 보고되는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed a crash that made sessions unusable after entering plan mode when project config in `~/.claude.json` was missing default fields","translated":"`~/.claude.json`에 프로젝트 구성의 기본 필드가 없을 때 계획 모드로 진입하면 세션이 사용할 수 없게 되는 충돌 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed `temperatureOverride` being silently ignored in the streaming API path, causing all streaming requests to use the default temperature (1) regardless of the configured override","translated":"스트리밍 API 경로에서 `temperatureOverride`가 조용히 무시되어 모든 스트리밍 요청이 구성된 오버라이드와 상관없이 기본 온도(1)를 사용하는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed LSP shutdown/exit compatibility with strict language servers that reject null params","translated":"null 매개변수를 거부하는 엄격한 언어 서버와의 LSP 종료/종료 호환성을 수정했습니다."},{"category":"improved","scope":null,"original":"Improved system prompts to more clearly guide the model toward using dedicated tools (Read, Edit, Glob, Grep) instead of bash equivalents (`cat`, `sed`, `grep`, `find`), reducing unnecessary bash command usage","translated":"시스템 프롬프트를 개선하여 모델이 bash 명령어(`cat`, `sed`, `grep`, `find`) 대신 전용 도구(Read, Edit, Glob, Grep)를 사용하도록 더 명확하게 안내하여 불필요한 bash 명령어 사용을 줄였습니다."},{"category":"improved","scope":null,"original":"Improved PDF and request size error messages to show actual limits (100 pages, 20MB)","translated":"PDF 및 요청 크기 오류 메시지를 실제 제한(100페이지, 20MB)으로 표시하도록 개선했습니다."},{"category":"other","scope":null,"original":"Reduced layout jitter in the terminal when the spinner appears and disappears during streaming","translated":"스트리밍 중 스피너가 나타났다 사라질 때 터미널의 레이아웃 떨림을 줄였습니다."},{"category":"removed","scope":null,"original":"Removed misleading Anthropic API pricing from model selector for third-party provider (Bedrock, Vertex, Foundry) users","translated":"타사 제공자(Bedrock, Vertex, Foundry) 사용자를 위해 모델 선택기에서 오해의 소지가 있는 Anthropic API 가격 정보를 제거했습니다."}]},{"version":"2.1.30","date":null,"entries":[{"category":"added","scope":null,"original":"Added `pages` parameter to the Read tool for PDFs, allowing specific page ranges to be read (e.g., `pages: \"1-5\"`). Large PDFs (>10 pages) now return a lightweight reference when `@` mentioned instead of being inlined into context.","translated":"PDF를 읽기 위한 Read 도구에 `pages` 매개변수를 추가하여 특정 페이지 범위를 읽을 수 있도록 했습니다(예: `pages: \"1-5\"`). 이제 10페이지 이상의 대형 PDF는 `@`가 언급될 때 인라인으로 삽입되는 대신 경량 참조를 반환합니다."},{"category":"added","scope":null,"original":"Added pre-configured OAuth client credentials for MCP servers that don't support Dynamic Client Registration (e.g., Slack). Use `--client-id` and `--client-secret` with `claude mcp add`.","translated":"동적 클라이언트 등록을 지원하지 않는 MCP 서버(예: Slack)를 위한 사전 구성된 OAuth 클라이언트 자격 증명을 추가했습니다. `claude mcp add`와 함께 `--client-id` 및 `--client-secret`을 사용하세요."},{"category":"added","scope":null,"original":"Added `/debug` for Claude to help troubleshoot the current session","translated":"현재 세션 문제 해결을 돕기 위해 Claude에 `/debug`를 추가했습니다."},{"category":"added","scope":null,"original":"Added support for additional `git log` and `git show` flags in read-only mode (e.g., `--topo-order`, `--cherry-pick`, `--format`, `--raw`)","translated":"읽기 전용 모드에서 추가적인 `git log` 및 `git show` 플래그 지원을 추가했습니다(예: `--topo-order`, `--cherry-pick`, `--format`, `--raw`)."},{"category":"added","scope":null,"original":"Added token count, tool uses, and duration metrics to Task tool results","translated":"Task 도구 결과에 토큰 수, 도구 사용 횟수 및 지속 시간 메트릭을 추가했습니다."},{"category":"added","scope":null,"original":"Added reduced motion mode to the config","translated":"설정에 모션 감소 모드를 추가했습니다."},{"category":"fixed","scope":null,"original":"Fixed phantom \"(no content)\" text blocks appearing in API conversation history, reducing token waste and potential model confusion","translated":"API 대화 기록에서 나타나는 유령 \"(내용 없음)\" 텍스트 블록을 수정하여 토큰 낭비와 모델 혼란을 줄였습니다."},{"category":"fixed","scope":null,"original":"Fixed prompt cache not correctly invalidating when tool descriptions or input schemas changed, only when tool names changed","translated":"도구 설명이나 입력 스키마가 변경될 때가 아닌 도구 이름이 변경될 때만 프롬프트 캐시가 올바르게 무효화되지 않는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed 400 errors that could occur after running `/login` when the conversation contained thinking blocks","translated":"대화에 생각 블록이 포함된 경우 `/login` 실행 후 발생할 수 있는 400 오류를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed a hang when resuming sessions with corrupted transcript files containing `parentUuid` cycles","translated":"`parentUuid` 사이클을 포함하는 손상된 전사 파일로 세션을 재개할 때 발생하는 멈춤 현상을 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed rate limit message showing incorrect \"/upgrade\" suggestion for Max 20x users when extra-usage is unavailable","translated":"추가 사용이 불가능할 때 Max 20x 사용자에게 잘못된 \"/upgrade\" 제안을 표시하는 속도 제한 메시지를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed permission dialogs stealing focus while actively typing","translated":"사용자가 적극적으로 입력하는 동안 권한 대화 상자가 포커스를 빼앗는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed subagents not being able to access SDK-provided MCP tools because they were not synced to the shared application state","translated":"하위 에이전트가 공유 애플리케이션 상태에 동기화되지 않아 SDK에서 제공하는 MCP 도구에 액세스할 수 없는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed a regression where Windows users with a `.bashrc` file could not run bash commands","translated":"`.bashrc` 파일이 있는 Windows 사용자가 bash 명령을 실행할 수 없는 회귀 문제를 수정했습니다."},{"category":"improved","scope":null,"original":"Improved memory usage for `--resume` (68% reduction for users with many sessions) by replacing the session index with lightweight stat-based loading and progressive enrichment","translated":"세션 인덱스를 경량 통계 기반 로딩 및 점진적 강화로 대체하여 `--resume`의 메모리 사용량을 개선했습니다(세션이 많은 사용자에게 68% 감소)."},{"category":"improved","scope":null,"original":"Improved `TaskStop` tool to display the stopped command/task description in the result line instead of a generic \"Task stopped\" message","translated":"`TaskStop` 도구를 개선하여 결과 줄에 일반적인 \"Task stopped\" 메시지 대신 중지된 명령/작업 설명을 표시하도록 했습니다."},{"category":"changed","scope":null,"original":"Changed `/model` to execute immediately instead of being queued","translated":"`/model`이 대기열에 들어가는 대신 즉시 실행되도록 변경했습니다."},{"category":"added","scope":"VSCode","original":"Added multiline input support to the \"Other\" text input in question dialogs (use Shift+Enter for new lines)","translated":"질문 대화 상자의 \"기타\" 텍스트 입력에 다중 줄 입력 지원을 추가했습니다(새 줄을 위해 Shift+Enter 사용)."},{"category":"fixed","scope":"VSCode","original":"Fixed duplicate sessions appearing in the session list when starting a new conversation","translated":"새로운 대화를 시작할 때 세션 목록에 중복 세션이 나타나는 문제를 수정했습니다."}]},{"version":"2.1.29","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed startup performance issues when resuming sessions that have `saved_hook_context`","translated":"`saved_hook_context`가 있는 세션을 재개할 때 발생하던 시작 성능 문제를 수정했습니다."}]},{"version":"2.1.27","date":null,"entries":[{"category":"added","scope":null,"original":"Added tool call failures and denials to debug logs","translated":"디버그 로그에 도구 호출 실패 및 거부 추가"},{"category":"fixed","scope":null,"original":"Fixed context management validation error for gateway users, ensuring `CLAUDE_CODE_DISABLE_EXPERIMENTAL_BETAS=1` avoids the error","translated":"게이트웨이 사용자에 대한 컨텍스트 관리 검증 오류 수정, `CLAUDE_CODE_DISABLE_EXPERIMENTAL_BETAS=1`로 오류 방지"},{"category":"added","scope":null,"original":"Added `--from-pr` flag to resume sessions linked to a specific GitHub PR number or URL","translated":"특정 GitHub PR 번호 또는 URL에 연결된 세션을 재개하기 위한 `--from-pr` 플래그 추가"},{"category":"other","scope":null,"original":"Sessions are now automatically linked to PRs when created via `gh pr create`","translated":"`gh pr create`를 통해 생성될 때 세션이 PR에 자동으로 연결됨"},{"category":"fixed","scope":null,"original":"Fixed /context command not displaying colored output","translated":"/context 명령어가 색상 출력되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed status bar duplicating background task indicator when PR status was shown","translated":"PR 상태가 표시될 때 상태 표시줄이 백그라운드 작업 표시기를 중복 표시하는 문제 수정"},{"category":"other","scope":null,"original":"Windows: Fixed bash command execution failing for users with `.bashrc` files","translated":"Windows: `.bashrc` 파일이 있는 사용자에 대한 bash 명령 실행 실패 문제 수정"},{"category":"other","scope":null,"original":"Windows: Fixed console windows flashing when spawning child processes","translated":"Windows: 자식 프로세스 생성 시 콘솔 창이 깜박이는 문제 수정"},{"category":"other","scope":null,"original":"VSCode: Fixed OAuth token expiration causing 401 errors after extended sessions","translated":"VSCode: 장기 세션 후 OAuth 토큰 만료로 인한 401 오류 문제 수정"}]},{"version":"2.1.25","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed beta header validation error for gateway users on Bedrock and Vertex, ensuring `CLAUDE_CODE_DISABLE_EXPERIMENTAL_BETAS=1` avoids the error","translated":"Bedrock 및 Vertex의 게이트웨이 사용자에 대한 베타 헤더 검증 오류를 수정하여 `CLAUDE_CODE_DISABLE_EXPERIMENTAL_BETAS=1` 설정 시 오류가 발생하지 않도록 했습니다."}]},{"version":"2.1.23","date":null,"entries":[{"category":"added","scope":null,"original":"Added customizable spinner verbs setting (`spinnerVerbs`)","translated":"사용자 정의 가능한 스피너 동사 설정 추가 (`spinnerVerbs`)"},{"category":"fixed","scope":null,"original":"Fixed mTLS and proxy connectivity for users behind corporate proxies or using client certificates","translated":"기업 프록시 뒤에 있거나 클라이언트 인증서를 사용하는 사용자를 위한 mTLS 및 프록시 연결 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed per-user temp directory isolation to prevent permission conflicts on shared systems","translated":"공유 시스템에서 권한 충돌을 방지하기 위한 사용자별 임시 디렉토리 격리 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed a race condition that could cause 400 errors when prompt caching scope was enabled","translated":"프롬프트 캐싱 범위가 활성화된 경우 400 오류를 발생시킬 수 있는 경쟁 조건 수정"},{"category":"fixed","scope":null,"original":"Fixed pending async hooks not being cancelled when headless streaming sessions ended","translated":"비동기 후크가 헤드리스 스트리밍 세션 종료 시 취소되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed tab completion not updating the input field when accepting a suggestion","translated":"제안 수락 시 입력 필드가 업데이트되지 않는 탭 완성 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed ripgrep search timeouts silently returning empty results instead of reporting errors","translated":"ripgrep 검색 시간 초과 시 오류를 보고하지 않고 빈 결과를 반환하는 문제 수정"},{"category":"improved","scope":null,"original":"Improved terminal rendering performance with optimized screen data layout","translated":"최적화된 화면 데이터 레이아웃으로 터미널 렌더링 성능 개선"},{"category":"changed","scope":null,"original":"Changed Bash commands to show timeout duration alongside elapsed time","translated":"경과 시간과 함께 시간 초과 지속 시간을 표시하도록 Bash 명령 변경"},{"category":"changed","scope":null,"original":"Changed merged pull requests to show a purple status indicator in the prompt footer","translated":"병합된 풀 리퀘스트가 프롬프트 하단에 보라색 상태 표시기를 표시하도록 변경"},{"category":"fixed","scope":"IDE","original":"Fixed model options displaying incorrect region strings for Bedrock users in headless mode","translated":"헤드리스 모드에서 Bedrock 사용자를 위한 모델 옵션이 잘못된 지역 문자열을 표시하는 문제 수정"}]},{"version":"2.1.22","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed structured outputs for non-interactive (-p) mode","translated":"비대화형 (-p) 모드에서 구조화된 출력 수정"}]},{"version":"2.1.21","date":null,"entries":[{"category":"added","scope":null,"original":"Added support for full-width (zenkaku) number input from Japanese IME in option selection prompts","translated":"일본어 IME에서 전각 숫자 입력을 옵션 선택 프롬프트에서 지원 추가"},{"category":"fixed","scope":null,"original":"Fixed shell completion cache files being truncated on exit","translated":"종료 시 셸 완성 캐시 파일이 잘리는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed API errors when resuming sessions that were interrupted during tool execution","translated":"도구 실행 중 중단된 세션을 재개할 때 발생하는 API 오류 수정"},{"category":"fixed","scope":null,"original":"Fixed auto-compact triggering too early on models with large output token limits","translated":"출력 토큰 제한이 큰 모델에서 자동 압축이 너무 일찍 실행되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed task IDs potentially being reused after deletion","translated":"삭제 후 작업 ID가 재사용될 가능성 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed file search not working in VS Code extension on Windows","translated":"Windows에서 VS Code 확장 기능의 파일 검색이 작동하지 않는 문제 수정"},{"category":"improved","scope":null,"original":"Improved read/search progress indicators to show \"Reading…\" while in progress and \"Read\" when complete","translated":"읽기/검색 진행 상태 표시기를 개선하여 진행 중에는 \"읽는 중…\"을, 완료 시에는 \"읽음\"을 표시"},{"category":"improved","scope":null,"original":"Improved Claude to prefer file operation tools (Read, Edit, Write) over bash equivalents (cat, sed, awk)","translated":"Claude가 bash 명령어(cat, sed, awk)보다 파일 작업 도구(Read, Edit, Write)를 선호하도록 개선"},{"category":"added","scope":"VSCode","original":"Added automatic Python virtual environment activation, ensuring `python` and `pip` commands use the correct interpreter (configurable via `claudeCode.usePythonEnvironment` setting)","translated":"자동 Python 가상 환경 활성화 추가, `python` 및 `pip` 명령이 올바른 인터프리터를 사용하도록 보장 (`claudeCode.usePythonEnvironment` 설정을 통해 구성 가능)"},{"category":"fixed","scope":"VSCode","original":"Fixed message action buttons having incorrect background colors","translated":"메시지 작업 버튼의 배경색이 잘못된 문제 수정"}]},{"version":"2.1.20","date":null,"entries":[{"category":"added","scope":null,"original":"Added arrow key history navigation in vim normal mode when cursor cannot move further","translated":"커서가 더 이상 이동할 수 없을 때 vim 일반 모드에서 화살표 키로 히스토리 탐색 기능 추가"},{"category":"added","scope":null,"original":"Added external editor shortcut (Ctrl+G) to the help menu for better discoverability","translated":"외부 편집기 단축키(Ctrl+G)를 도움말 메뉴에 추가하여 발견 가능성 향상"},{"category":"added","scope":null,"original":"Added PR review status indicator to the prompt footer, showing the current branch's PR state (approved, changes requested, pending, or draft) as a colored dot with a clickable link","translated":"PR 검토 상태 표시기를 프롬프트 하단에 추가하여 현재 브랜치의 PR 상태(승인됨, 변경 요청됨, 대기 중, 초안)를 색상 점과 클릭 가능한 링크로 표시"},{"category":"added","scope":null,"original":"Added support for loading `CLAUDE.md` files from additional directories specified via `--add-dir` flag (requires setting `CLAUDE_CODE_ADDITIONAL_DIRECTORIES_CLAUDE_MD=1`)","translated":"추가 디렉토리에서 `CLAUDE.md` 파일을 로드하는 기능 추가 (`--add-dir` 플래그 사용 필요, `CLAUDE_CODE_ADDITIONAL_DIRECTORIES_CLAUDE_MD=1` 설정 필요)"},{"category":"added","scope":null,"original":"Added ability to delete tasks via the `TaskUpdate` tool","translated":"`TaskUpdate` 도구를 통해 작업 삭제 기능 추가"},{"category":"fixed","scope":null,"original":"Fixed session compaction issues that could cause resume to load full history instead of the compact summary","translated":"세션 압축 문제 해결로 인해 전체 기록 대신 압축 요약을 로드할 수 있는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed agents sometimes ignoring user messages sent while actively working on a task","translated":"작업 중일 때 사용자가 보낸 메시지를 에이전트가 무시하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed wide character (emoji, CJK) rendering artifacts where trailing columns were not cleared when replaced by narrower characters","translated":"넓은 문자(이모지, CJK) 렌더링 아티팩트 수정으로 좁은 문자로 대체될 때 후행 열이 지워지지 않는 문제 해결"},{"category":"fixed","scope":null,"original":"Fixed JSON parsing errors when MCP tool responses contain special Unicode characters","translated":"MCP 도구 응답에 특수 유니코드 문자가 포함될 때 JSON 파싱 오류 수정"},{"category":"fixed","scope":null,"original":"Fixed up/down arrow keys in multi-line and wrapped text input to prioritize cursor movement over history navigation","translated":"여러 줄 및 줄 바꿈된 텍스트 입력에서 위/아래 화살표 키가 히스토리 탐색보다 커서 이동을 우선시하도록 수정"},{"category":"fixed","scope":null,"original":"Fixed draft prompt being lost when pressing UP arrow to navigate command history","translated":"명령 히스토리를 탐색하기 위해 위쪽 화살표를 누를 때 초안 프롬프트가 사라지는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed ghost text flickering when typing slash commands mid-input","translated":"입력 중 슬래시 명령어를 입력할 때 유령 텍스트 깜박임 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed marketplace source removal not properly deleting settings","translated":"마켓플레이스 소스 제거 시 설정이 제대로 삭제되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed duplicate output in some commands like `/context`","translated":"`/context`와 같은 일부 명령에서 중복 출력 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed task list sometimes showing outside the main conversation view","translated":"작업 목록이 메인 대화 보기 외부에 표시되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed syntax highlighting for diffs occurring within multiline constructs like Python docstrings","translated":"Python docstring과 같은 다중 라인 구조 내에서 발생하는 차이점에 대한 구문 강조 표시 수정"},{"category":"fixed","scope":null,"original":"Fixed crashes when cancelling tool use","translated":"도구 사용 취소 시 충돌 문제 수정"},{"category":"improved","scope":null,"original":"Improved `/sandbox` command UI to show dependency status with installation instructions when dependencies are missing","translated":"`/sandbox` 명령 UI 개선으로 종속성이 누락된 경우 설치 지침과 함께 종속성 상태 표시"},{"category":"improved","scope":null,"original":"Improved thinking status text with a subtle shimmer animation","translated":"미묘한 반짝임 애니메이션으로 생각 상태 텍스트 개선"},{"category":"improved","scope":null,"original":"Improved task list to dynamically adjust visible items based on terminal height","translated":"터미널 높이에 따라 가시 항목을 동적으로 조정하도록 작업 목록 개선"},{"category":"improved","scope":null,"original":"Improved fork conversation hint to show how to resume the original session","translated":"포크 대화 힌트를 개선하여 원래 세션을 재개하는 방법을 보여줌"},{"category":"changed","scope":null,"original":"Changed collapsed read/search groups to show present tense (\"Reading\", \"Searching for\") while in progress, and past tense (\"Read\", \"Searched for\") when complete","translated":"축소된 읽기/검색 그룹이 진행 중일 때 현재 시제(\"읽는 중\", \"검색 중\")로, 완료되었을 때 과거 시제(\"읽음\", \"검색 완료\")로 표시되도록 변경"},{"category":"changed","scope":null,"original":"Changed `ToolSearch` results to appear as a brief notification instead of inline in the conversation","translated":"`ToolSearch` 결과가 대화 내에 인라인으로 나타나는 대신 간단한 알림으로 표시되도록 변경"},{"category":"changed","scope":null,"original":"Changed the `/commit-push-pr` skill to automatically post PR URLs to Slack channels when configured via MCP tools","translated":"`/commit-push-pr` 스킬이 MCP 도구를 통해 구성될 때 자동으로 PR URL을 Slack 채널에 게시하도록 변경"},{"category":"changed","scope":null,"original":"Changed the `/copy` command to be available to all users","translated":"`/copy` 명령어가 모든 사용자에게 사용 가능하도록 변경"},{"category":"changed","scope":null,"original":"Changed background agents to prompt for tool permissions before launching","translated":"백그라운드 에이전트가 실행되기 전에 도구 권한을 요청하도록 변경"},{"category":"changed","scope":null,"original":"Changed permission rules like `Bash(*)` to be accepted and treated as equivalent to `Bash`","translated":"`Bash(*)`와 같은 권한 규칙이 `Bash`와 동등하게 수락되고 처리되도록 변경"},{"category":"changed","scope":null,"original":"Changed config backups to be timestamped and rotated (keeping 5 most recent) to prevent data loss","translated":"구성 백업이 타임스탬프가 찍히고 회전(최신 5개 유지)되어 데이터 손실을 방지하도록 변경"}]},{"version":"2.1.19","date":null,"entries":[{"category":"added","scope":null,"original":"Added env var `CLAUDE_CODE_ENABLE_TASKS`, set to `false` to keep the old system temporarily","translated":"환경 변수 `CLAUDE_CODE_ENABLE_TASKS` 추가, 기존 시스템을 임시로 유지하려면 `false`로 설정"},{"category":"added","scope":null,"original":"Added shorthand `$0`, `$1`, etc. for accessing individual arguments in custom commands","translated":"사용자 정의 명령어에서 개별 인수에 접근하기 위한 약어 `$0`, `$1` 등 추가"},{"category":"fixed","scope":null,"original":"Fixed crashes on processors without AVX instruction support","translated":"AVX 명령어 지원이 없는 프로세서에서의 크래시 수정"},{"category":"fixed","scope":null,"original":"Fixed dangling Claude Code processes when terminal is closed by catching EIO errors from `process.exit()` and using SIGKILL as fallback","translated":"터미널이 닫힐 때 `process.exit()`에서 EIO 오류를 포착하고 SIGKILL을 대체로 사용하여 남아있는 Claude Code 프로세스 수정"},{"category":"fixed","scope":null,"original":"Fixed `/rename` and `/tag` not updating the correct session when resuming from a different directory (e.g., git worktrees)","translated":"다른 디렉토리(예: git worktrees)에서 재개할 때 올바른 세션을 업데이트하지 않는 `/rename` 및 `/tag` 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed resuming sessions by custom title not working when run from a different directory","translated":"다른 디렉토리에서 실행할 때 사용자 정의 제목으로 세션을 재개할 수 없는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed pasted text content being lost when using prompt stash (Ctrl+S) and restore","translated":"프롬프트 저장(Ctrl+S) 및 복원 시 붙여넣은 텍스트 내용이 손실되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed agent list displaying \"Sonnet (default)\" instead of \"Inherit (default)\" for agents without an explicit model setting","translated":"명시적인 모델 설정이 없는 에이전트에 대해 \"Sonnet (default)\" 대신 \"Inherit (default)\"로 표시되는 에이전트 목록 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed backgrounded hook commands not returning early, potentially causing the session to wait on a process that was intentionally backgrounded","translated":"백그라운드 훅 명령어가 조기에 반환되지 않아 의도적으로 백그라운드 처리된 프로세스를 세션이 대기할 수 있는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed file write preview omitting empty lines","translated":"파일 쓰기 미리보기에서 빈 줄이 생략되는 문제 수정"},{"category":"changed","scope":null,"original":"Changed skills without additional permissions or hooks to be allowed without requiring approval","translated":"추가 권한이나 훅이 없는 스킬은 승인 없이 허용되도록 변경"},{"category":"changed","scope":null,"original":"Changed indexed argument syntax from `$ARGUMENTS.0` to `$ARGUMENTS[0]` (bracket syntax)","translated":"인덱스된 인수 구문을 `$ARGUMENTS.0`에서 `$ARGUMENTS[0]`(대괄호 구문)으로 변경"},{"category":"added","scope":"SDK","original":"Added replay of `queued_command` attachment messages as `SDKUserMessageReplay` events when `replayUserMessages` is enabled","translated":"`replayUserMessages`가 활성화된 경우 `queued_command` 첨부 메시지를 `SDKUserMessageReplay` 이벤트로 재생 추가"},{"category":"other","scope":"VSCode","original":"Enabled session forking and rewind functionality for all users","translated":"모든 사용자에게 세션 포크 및 되감기 기능 활성화"}]},{"version":"2.1.18","date":null,"entries":[{"category":"added","scope":null,"original":"Added customizable keyboard shortcuts. Configure keybindings per context, create chord sequences, and personalize your workflow. Run `/keybindings` to get started. Learn more at https://code.claude.com/docs/en/keybindings","translated":"사용자 정의 가능한 키보드 단축키가 추가되었습니다. 컨텍스트별 키 바인딩을 구성하고, 코드 시퀀스를 생성하며, 워크플로를 개인화하세요. 시작하려면 `/keybindings`를 실행하세요. 자세한 내용은 https://code.claude.com/docs/en/keybindings에서 확인하세요."}]},{"version":"2.1.17","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed crashes on processors without AVX instruction support","translated":"AVX 명령어를 지원하지 않는 프로세서에서 발생하는 충돌 문제를 수정했습니다."}]},{"version":"2.1.16","date":null,"entries":[{"category":"added","scope":null,"original":"Added new task management system, including new capabilities like dependency tracking","translated":"종속성 추적과 같은 새로운 기능을 포함한 새로운 작업 관리 시스템 추가"},{"category":"added","scope":"VSCode","original":"Added native plugin management support","translated":"네이티브 플러그인 관리 지원 추가"},{"category":"added","scope":"VSCode","original":"Added ability for OAuth users to browse and resume remote Claude sessions from the Sessions dialog","translated":"OAuth 사용자가 세션 대화 상자에서 원격 Claude 세션을 탐색하고 재개할 수 있는 기능 추가"},{"category":"fixed","scope":null,"original":"Fixed out-of-memory crashes when resuming sessions with heavy subagent usage","translated":"서브에이전트를 많이 사용하는 세션을 재개할 때 발생하는 메모리 부족 충돌 수정"},{"category":"fixed","scope":null,"original":"Fixed an issue where the \"context remaining\" warning was not hidden after running `/compact`","translated":"`/compact` 실행 후 \"남은 컨텍스트\" 경고가 숨겨지지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed session titles on the resume screen not respecting the user's language setting","translated":"재개 화면에서 세션 제목이 사용자의 언어 설정을 따르지 않는 문제 수정"},{"category":"fixed","scope":"IDE","original":"Fixed a race condition on Windows where the Claude Code sidebar view container would not appear on start","translated":"Windows에서 시작 시 Claude Code 사이드바 뷰 컨테이너가 나타나지 않는 경쟁 조건 수정"}]},{"version":"2.1.15","date":null,"entries":[{"category":"added","scope":null,"original":"Added deprecation notification for npm installations - run `claude install` or see https://docs.anthropic.com/en/docs/claude-code/getting-started for more options","translated":"npm 설치에 대한 사용 중단 알림 추가 - `claude install`을 실행하거나 https://docs.anthropic.com/en/docs/claude-code/getting-started에서 더 많은 옵션을 확인하세요"},{"category":"improved","scope":null,"original":"Improved UI rendering performance with React Compiler","translated":"React Compiler로 UI 렌더링 성능 개선"},{"category":"fixed","scope":null,"original":"Fixed the \"Context left until auto-compact\" warning not disappearing after running `/compact`","translated":"`/compact` 실행 후에도 사라지지 않던 \"자동 압축까지 남은 컨텍스트\" 경고 수정"},{"category":"fixed","scope":null,"original":"Fixed MCP stdio server timeout not killing child process, which could cause UI freezes","translated":"MCP stdio 서버 타임아웃이 자식 프로세스를 종료하지 않아 UI가 멈출 수 있는 문제 수정"}]},{"version":"2.1.14","date":null,"entries":[{"category":"added","scope":null,"original":"Added history-based autocomplete in bash mode (`!`) - type a partial command and press Tab to complete from your bash command history","translated":"bash 모드에서 역사 기반 자동 완성 기능 추가 (`!`) - 부분 명령어를 입력하고 Tab 키를 눌러 bash 명령어 기록에서 완성"},{"category":"added","scope":null,"original":"Added search to installed plugins list - type to filter by name or description","translated":"설치된 플러그인 목록에 검색 기능 추가 - 이름이나 설명으로 필터링하려면 입력"},{"category":"added","scope":null,"original":"Added support for pinning plugins to specific git commit SHAs, allowing marketplace entries to install exact versions","translated":"특정 git 커밋 SHA에 플러그인을 고정하는 기능 추가, 정확한 버전을 설치할 수 있도록 마켓플레이스 항목 지원"},{"category":"fixed","scope":null,"original":"Fixed a regression where the context window blocking limit was calculated too aggressively, blocking users at ~65% context usage instead of the intended ~98%","translated":"컨텍스트 창 차단 한도가 너무 공격적으로 계산되어, 의도한 ~98% 대신 ~65% 컨텍스트 사용 시 사용자가 차단되는 회귀 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed memory issues that could cause crashes when running parallel subagents","translated":"병렬 하위 에이전트 실행 시 충돌을 일으킬 수 있는 메모리 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed memory leak in long-running sessions where stream resources were not cleaned up after shell commands completed","translated":"셸 명령어 완료 후 스트림 리소스가 정리되지 않아 장기 실행 세션에서 발생하는 메모리 누수 수정"},{"category":"fixed","scope":null,"original":"Fixed `@` symbol incorrectly triggering file autocomplete suggestions in bash mode","translated":"bash 모드에서 `@` 기호가 파일 자동 완성 제안을 잘못 트리거하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed `@`-mention menu folder click behavior to navigate into directories instead of selecting them","translated":"`@`-멘션 메뉴 폴더 클릭 시 디렉토리로 이동하는 대신 선택하는 동작 수정"},{"category":"fixed","scope":null,"original":"Fixed `/feedback` command generating invalid GitHub issue URLs when description is very long","translated":"설명이 매우 길 때 `/feedback` 명령어가 잘못된 GitHub 이슈 URL을 생성하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed `/context` command to show the same token count and percentage as the status line in verbose mode","translated":"`/context` 명령어가 자세한 모드에서 상태 라인과 동일한 토큰 수와 백분율을 표시하도록 수정"},{"category":"fixed","scope":null,"original":"Fixed an issue where `/config`, `/context`, `/model`, and `/todos` command overlays could close unexpectedly","translated":"`/config`, `/context`, `/model`, `/todos` 명령어 오버레이가 예기치 않게 닫힐 수 있는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed slash command autocomplete selecting wrong command when typing similar commands (e.g., `/context` vs `/compact`)","translated":"슬래시 명령어 자동 완성 시 비슷한 명령어 입력 시 잘못된 명령어를 선택하는 문제 수정 (예: `/context` vs `/compact`)"},{"category":"fixed","scope":null,"original":"Fixed inconsistent back navigation in plugin marketplace when only one marketplace is configured","translated":"하나의 마켓플레이스만 구성된 경우 플러그인 마켓플레이스에서 일관되지 않은 뒤로 탐색 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed iTerm2 progress bar not clearing properly on exit, preventing lingering indicators and bell sounds","translated":"iTerm2 진행 표시줄이 종료 시 제대로 지워지지 않아 남아 있는 표시기와 벨 소리가 발생하는 문제 수정"},{"category":"improved","scope":null,"original":"Improved backspace to delete pasted text as a single token instead of one character at a time","translated":"백스페이스로 붙여넣은 텍스트를 한 문자씩이 아닌 하나의 토큰으로 삭제하도록 개선"},{"category":"added","scope":"VSCode","original":"Added `/usage` command to display current plan usage","translated":"현재 플랜 사용량을 표시하는 `/usage` 명령어 추가"}]},{"version":"2.1.12","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed message rendering bug","translated":"메시지 렌더링 버그 수정"}]},{"version":"2.1.11","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed excessive MCP connection requests for HTTP/SSE transports","translated":"HTTP/SSE 전송에서 과도한 MCP 연결 요청 수정"}]},{"version":"2.1.10","date":null,"entries":[{"category":"added","scope":null,"original":"Added new `Setup` hook event that can be triggered via `--init`, `--init-only`, or `--maintenance` CLI flags for repository setup and maintenance operations","translated":"저장소 설정 및 유지보수 작업을 위해 `--init`, `--init-only`, `--maintenance` CLI 플래그를 통해 트리거할 수 있는 새로운 `Setup` 훅 이벤트 추가"},{"category":"added","scope":null,"original":"Added keyboard shortcut 'c' to copy OAuth URL when browser doesn't open automatically during login","translated":"로그인 중 브라우저가 자동으로 열리지 않을 때 OAuth URL을 복사할 수 있는 키보드 단축키 'c' 추가"},{"category":"fixed","scope":null,"original":"Fixed a crash when running bash commands containing heredocs with JavaScript template literals like `${index + 1}`","translated":"`${index + 1}`과 같은 JavaScript 템플릿 리터럴을 포함한 heredocs로 bash 명령을 실행할 때 발생하는 충돌 수정"},{"category":"improved","scope":null,"original":"Improved startup to capture keystrokes typed before the REPL is fully ready","translated":"REPL이 완전히 준비되기 전에 입력된 키 입력을 캡처하도록 시작 개선"},{"category":"improved","scope":null,"original":"Improved file suggestions to show as removable attachments instead of inserting text when accepted","translated":"파일 제안이 수락될 때 텍스트를 삽입하는 대신 제거 가능한 첨부 파일로 표시되도록 개선"},{"category":"added","scope":"VSCode","original":"Added install count display to plugin listings","translated":"플러그인 목록에 설치 횟수 표시 추가"},{"category":"added","scope":"VSCode","original":"Added trust warning when installing plugins","translated":"플러그인 설치 시 신뢰 경고 추가"}]},{"version":"2.1.9","date":null,"entries":[{"category":"added","scope":null,"original":"Added `auto:N` syntax for configuring the MCP tool search auto-enable threshold, where N is the context window percentage (0-100)","translated":"MCP 도구 검색 자동 활성화 임계값을 구성하기 위한 `auto:N` 구문 추가, 여기서 N은 컨텍스트 창 비율(0-100)입니다."},{"category":"added","scope":null,"original":"Added `plansDirectory` setting to customize where plan files are stored","translated":"계획 파일이 저장되는 위치를 사용자 정의할 수 있는 `plansDirectory` 설정 추가"},{"category":"added","scope":null,"original":"Added external editor support (Ctrl+G) in AskUserQuestion \"Other\" input field","translated":"AskUserQuestion \"기타\" 입력 필드에 외부 편집기 지원(Ctrl+G) 추가"},{"category":"added","scope":null,"original":"Added session URL attribution to commits and PRs created from web sessions","translated":"웹 세션에서 생성된 커밋 및 PR에 세션 URL 속성 추가"},{"category":"added","scope":null,"original":"Added support for `PreToolUse` hooks to return `additionalContext` to the model","translated":"모델에 `additionalContext`를 반환할 수 있는 `PreToolUse` 후크 지원 추가"},{"category":"added","scope":null,"original":"Added `${CLAUDE_SESSION_ID}` string substitution for skills to access the current session ID","translated":"현재 세션 ID에 접근할 수 있도록 스킬에 `${CLAUDE_SESSION_ID}` 문자열 치환 추가"},{"category":"fixed","scope":null,"original":"Fixed long sessions with parallel tool calls failing with an API error about orphan tool_result blocks","translated":"병렬 도구 호출이 있는 긴 세션에서 고아 도구 결과 블록에 대한 API 오류로 실패하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed MCP server reconnection hanging when cached connection promise never resolves","translated":"캐시된 연결 약속이 해결되지 않을 때 MCP 서버 재연결이 멈추는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Ctrl+Z suspend not working in terminals using Kitty keyboard protocol (Ghostty, iTerm2, kitty, WezTerm)","translated":"Kitty 키보드 프로토콜(Ghostty, iTerm2, kitty, WezTerm)을 사용하는 터미널에서 Ctrl+Z 일시 중지가 작동하지 않는 문제 수정"}]},{"version":"2.1.7","date":null,"entries":[{"category":"added","scope":null,"original":"Added `showTurnDuration` setting to hide turn duration messages (e.g., \"Cooked for 1m 6s\")","translated":"턴 지속 시간 메시지(예: \"1분 6초 동안 조리됨\")를 숨길 수 있는 `showTurnDuration` 설정 추가"},{"category":"added","scope":null,"original":"Added ability to provide feedback when accepting permission prompts","translated":"권한 요청 수락 시 피드백 제공 기능 추가"},{"category":"added","scope":null,"original":"Added inline display of agent's final response in task notifications, making it easier to see results without reading the full transcript file","translated":"작업 알림에서 에이전트의 최종 응답을 인라인으로 표시하여 전체 대화 기록 파일을 읽지 않고도 결과를 쉽게 확인할 수 있도록 개선"},{"category":"fixed","scope":null,"original":"Fixed security vulnerability where wildcard permission rules could match compound commands containing shell operators","translated":"와일드카드 권한 규칙이 쉘 연산자를 포함하는 복합 명령어와 일치할 수 있는 보안 취약점 수정"},{"category":"fixed","scope":null,"original":"Fixed false \"file modified\" errors on Windows when cloud sync tools, antivirus scanners, or Git touch file timestamps without changing content","translated":"클라우드 동기화 도구, 안티바이러스 스캐너 또는 Git이 파일 내용을 변경하지 않고 타임스탬프만 수정할 때 Windows에서 발생하는 잘못된 \"파일 수정됨\" 오류 수정"},{"category":"fixed","scope":null,"original":"Fixed orphaned tool_result errors when sibling tools fail during streaming execution","translated":"스트리밍 실행 중 형제 도구가 실패할 때 발생하는 고아 상태의 tool_result 오류 수정"},{"category":"fixed","scope":null,"original":"Fixed context window blocking limit being calculated using the full context window instead of the effective context window (which reserves space for max output tokens)","translated":"최대 출력 토큰을 위한 공간을 예약하는 효과적인 컨텍스트 창 대신 전체 컨텍스트 창을 사용하여 계산되는 컨텍스트 창 차단 한계 수정"},{"category":"fixed","scope":null,"original":"Fixed spinner briefly flashing when running local slash commands like `/model` or `/theme`","translated":"`/model` 또는 `/theme`와 같은 로컬 슬래시 명령어 실행 시 스피너가 잠깐 깜박이는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed terminal title animation jitter by using fixed-width braille characters","translated":"고정 폭의 점자 문자를 사용하여 터미널 제목 애니메이션 떨림 현상 수정"},{"category":"fixed","scope":null,"original":"Fixed plugins with git submodules not being fully initialized when installed","translated":"git 서브모듈이 있는 플러그인이 설치될 때 완전히 초기화되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed bash commands failing on Windows when temp directory paths contained characters like `t` or `n` that were misinterpreted as escape sequences","translated":"임시 디렉토리 경로에 `t` 또는 `n`과 같은 문자가 포함되어 있어 이스케이프 시퀀스로 잘못 해석되는 경우 Windows에서 bash 명령어가 실패하는 문제 수정"},{"category":"improved","scope":null,"original":"Improved typing responsiveness by reducing memory allocation overhead in terminal rendering","translated":"터미널 렌더링에서 메모리 할당 오버헤드를 줄여 타이핑 반응성 개선"},{"category":"other","scope":null,"original":"Enabled MCP tool search auto mode by default for all users. When MCP tool descriptions exceed 10% of the context window, they are automatically deferred and discovered via the MCPSearch tool instead of being loaded upfront. This reduces context usage for users with many MCP tools configured. Users can disable this by adding `MCPSearch` to `disallowedTools` in their settings.","translated":"모든 사용자에 대해 기본적으로 MCP 도구 검색 자동 모드 활성화. MCP 도구 설명이 컨텍스트 창의 10%를 초과할 경우, 이를 자동으로 연기하고 MCPSearch 도구를 통해 발견되도록 하여 즉시 로드되지 않도록 함. 이는 많은 MCP 도구를 구성한 사용자의 컨텍스트 사용량을 줄여줌. 사용자는 설정에서 `disallowedTools`에 `MCPSearch`를 추가하여 이를 비활성화할 수 있음."},{"category":"changed","scope":null,"original":"Changed OAuth and API Console URLs from console.anthropic.com to platform.claude.com","translated":"OAuth 및 API 콘솔 URL을 console.anthropic.com에서 platform.claude.com으로 변경"},{"category":"fixed","scope":"VSCode","original":"Fixed `claudeProcessWrapper` setting passing the wrapper path instead of the Claude binary path","translated":"`claudeProcessWrapper` 설정이 Claude 바이너리 경로 대신 래퍼 경로를 전달하는 문제 수정"}]},{"version":"2.1.6","date":null,"entries":[{"category":"added","scope":null,"original":"Added search functionality to `/config` command for quickly filtering settings","translated":"설정을 빠르게 필터링할 수 있도록 `/config` 명령어에 검색 기능 추가"},{"category":"added","scope":null,"original":"Added Updates section to `/doctor` showing auto-update channel and available npm versions (stable/latest)","translated":"`/doctor`에 업데이트 섹션 추가 - 자동 업데이트 채널과 사용 가능한 npm 버전(안정/최신) 표시"},{"category":"added","scope":null,"original":"Added date range filtering to `/stats` command - press `r` to cycle between Last 7 days, Last 30 days, and All time","translated":"`/stats` 명령어에 날짜 범위 필터링 추가 - `r` 키를 눌러 최근 7일, 최근 30일, 전체 기간 간 전환"},{"category":"added","scope":null,"original":"Added automatic discovery of skills from nested `.claude/skills` directories when working with files in subdirectories","translated":"하위 디렉토리에서 파일 작업 시 중첩된 `.claude/skills` 디렉토리에서 스킬 자동 검색 기능 추가"},{"category":"added","scope":null,"original":"Added `context_window.used_percentage` and `context_window.remaining_percentage` fields to status line input for easier context window display","translated":"상태 라인 입력에 `context_window.used_percentage` 및 `context_window.remaining_percentage` 필드 추가로 컨텍스트 윈도우 표시 개선"},{"category":"added","scope":null,"original":"Added an error display when the editor fails during Ctrl+G","translated":"Ctrl+G 중 편집기 오류 발생 시 오류 표시 추가"},{"category":"fixed","scope":null,"original":"Fixed permission bypass via shell line continuation that could allow blocked commands to execute","translated":"차단된 명령어가 실행될 수 있는 셸 라인 연속을 통한 권한 우회 수정"},{"category":"fixed","scope":null,"original":"Fixed false \"File has been unexpectedly modified\" errors when file watchers touch files without changing content","translated":"파일 감시자가 내용을 변경하지 않고 파일을 터치할 때 발생하는 \"파일이 예상치 않게 수정되었습니다\" 오류 수정"},{"category":"fixed","scope":null,"original":"Fixed text styling (bold, colors) getting progressively misaligned in multi-line responses","translated":"여러 줄 응답에서 텍스트 스타일(굵게, 색상)이 점차적으로 잘못 정렬되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed the feedback panel closing unexpectedly when typing 'n' in the description field","translated":"설명 필드에서 'n'을 입력할 때 피드백 패널이 예기치 않게 닫히는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed rate limit warning appearing at low usage after weekly reset (now requires 70% usage)","translated":"주간 초기화 후 낮은 사용량에서 비율 제한 경고가 나타나는 문제 수정 (이제 70% 사용 필요)"},{"category":"fixed","scope":null,"original":"Fixed rate limit options menu incorrectly auto-opening when resuming a previous session","translated":"이전 세션을 재개할 때 비율 제한 옵션 메뉴가 잘못 자동 열리는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed numpad keys outputting escape sequences instead of characters in Kitty keyboard protocol terminals","translated":"Kitty 키보드 프로토콜 터미널에서 숫자 패드 키가 문자 대신 이스케이프 시퀀스를 출력하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Option+Return not inserting newlines in Kitty keyboard protocol terminals","translated":"Kitty 키보드 프로토콜 터미널에서 Option+Return이 줄 바꿈을 삽입하지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed corrupted config backup files accumulating in the home directory (now only one backup is created per config file)","translated":"홈 디렉토리에 손상된 구성 백업 파일이 누적되는 문제 수정 (이제 구성 파일당 하나의 백업만 생성)"},{"category":"fixed","scope":null,"original":"Fixed `mcp list` and `mcp get` commands leaving orphaned MCP server processes","translated":"`mcp list` 및 `mcp get` 명령어가 고아 MCP 서버 프로세스를 남기는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed visual artifacts in ink2 mode when nodes become hidden via `display:none`","translated":"`display:none`으로 노드가 숨겨질 때 ink2 모드에서 시각적 아티팩트 문제 수정"},{"category":"improved","scope":null,"original":"Improved the external CLAUDE.md imports approval dialog to show which files are being imported and from where","translated":"외부 CLAUDE.md 가져오기 승인 대화 상자를 개선하여 어떤 파일이 어디서 가져오는지 표시"},{"category":"improved","scope":null,"original":"Improved the `/tasks` dialog to go directly to task details when there's only one background task running","translated":"`/tasks` 대화 상자를 개선하여 백그라운드 작업이 하나만 실행 중일 때 바로 작업 세부 정보로 이동"},{"category":"improved","scope":null,"original":"Improved @ autocomplete with icons for different suggestion types and single-line formatting","translated":"@ 자동 완성에 다양한 제안 유형의 아이콘과 단일 라인 형식 추가로 개선"},{"category":"changed","scope":null,"original":"Updated \"Help improve Claude\" setting fetch to refresh OAuth and retry when it fails due to a stale OAuth token","translated":"\"Claude 개선에 도움 주기\" 설정 가져오기를 업데이트하여 OAuth 토큰이 오래되어 실패할 경우 OAuth를 새로고침하고 재시도하도록 수정했습니다."},{"category":"changed","scope":null,"original":"Changed task notification display to cap at 3 lines with overflow summary when multiple background tasks complete simultaneously","translated":"여러 백그라운드 작업이 동시에 완료될 때 작업 알림 표시를 3줄로 제한하고 넘치는 부분은 요약으로 표시하도록 변경했습니다."},{"category":"changed","scope":null,"original":"Changed terminal title to \"Claude Code\" on startup for better window identification","translated":"창 식별을 더 쉽게 하기 위해 시작 시 터미널 제목을 \"Claude Code\"로 변경했습니다."},{"category":"removed","scope":null,"original":"Removed ability to @-mention MCP servers to enable/disable - use `/mcp enable <name>` instead","translated":"MCP 서버를 @-멘션하여 활성화/비활성화하는 기능을 제거하고 대신 `/mcp enable <name>` 명령어를 사용하도록 했습니다."},{"category":"fixed","scope":"VSCode","original":"Fixed usage indicator not updating after manual compact","translated":"수동 압축 후 사용량 표시기가 업데이트되지 않는 문제를 수정했습니다."}]},{"version":"2.1.5","date":null,"entries":[{"category":"added","scope":null,"original":"Added `CLAUDE_CODE_TMPDIR` environment variable to override the temp directory used for internal temp files, useful for environments with custom temp directory requirements","translated":"내부 임시 파일에 사용되는 임시 디렉토리를 재정의하기 위해 `CLAUDE_CODE_TMPDIR` 환경 변수를 추가했습니다. 이는 사용자 정의 임시 디렉토리 요구 사항이 있는 환경에 유용합니다."}]},{"version":"2.1.4","date":null,"entries":[{"category":"added","scope":null,"original":"Added `CLAUDE_CODE_DISABLE_BACKGROUND_TASKS` environment variable to disable all background task functionality including auto-backgrounding and the Ctrl+B shortcut","translated":"모든 백그라운드 작업 기능을 비활성화하는 `CLAUDE_CODE_DISABLE_BACKGROUND_TASKS` 환경 변수를 추가했습니다. 여기에는 자동 백그라운드 및 Ctrl+B 단축키가 포함됩니다."},{"category":"fixed","scope":null,"original":"Fixed \"Help improve Claude\" setting fetch to refresh OAuth and retry when it fails due to a stale OAuth token","translated":"\"Claude 개선에 도움\" 설정을 가져올 때 오래된 OAuth 토큰으로 인해 실패할 경우 OAuth를 새로고침하고 재시도하도록 수정했습니다."}]},{"version":"2.1.3","date":null,"entries":[{"category":"other","scope":null,"original":"Merged slash commands and skills, simplifying the mental model with no change in behavior","translated":"슬래시 명령어와 스킬을 통합하여 행동 변화 없이 정신 모델을 단순화"},{"category":"added","scope":null,"original":"Added release channel (`stable` or `latest`) toggle to `/config`","translated":"`/config`에 릴리스 채널 (`stable` 또는 `latest`) 토글 추가"},{"category":"added","scope":null,"original":"Added detection and warnings for unreachable permission rules, with warnings in `/doctor` and after saving rules that include the source of each rule and actionable fix guidance","translated":"도달할 수 없는 권한 규칙에 대한 감지 및 경고 추가, 각 규칙의 출처와 실행 가능한 수정 지침을 포함한 경고를 `/doctor` 및 규칙 저장 후에 표시"},{"category":"fixed","scope":null,"original":"Fixed plan files persisting across `/clear` commands, now ensuring a fresh plan file is used after clearing a conversation","translated":"`/clear` 명령어 이후에도 계획 파일이 지속되던 문제 수정, 이제 대화 삭제 후 새 계획 파일을 사용하도록 보장"},{"category":"fixed","scope":null,"original":"Fixed false skill duplicate detection on filesystems with large inodes (e.g., ExFAT) by using 64-bit precision for inode values","translated":"큰 inode를 가진 파일 시스템(예: ExFAT)에서 잘못된 스킬 중복 감지를 64비트 정밀도의 inode 값 사용으로 수정"},{"category":"fixed","scope":null,"original":"Fixed mismatch between background task count in status bar and items shown in tasks dialog","translated":"상태 표시줄의 백그라운드 작업 수와 작업 대화 상자에 표시되는 항목 간 불일치 수정"},{"category":"fixed","scope":null,"original":"Fixed sub-agents using the wrong model during conversation compaction","translated":"하위 에이전트가 대화 압축 중 잘못된 모델을 사용하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed web search in sub-agents using incorrect model","translated":"하위 에이전트에서 웹 검색 시 잘못된 모델을 사용하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed trust dialog acceptance when running from the home directory not enabling trust-requiring features like hooks during the session","translated":"홈 디렉토리에서 실행할 때 신뢰 대화 상자 수락이 세션 중 후크와 같은 신뢰가 필요한 기능을 활성화하지 않는 문제 수정"},{"category":"improved","scope":null,"original":"Improved terminal rendering stability by preventing uncontrolled writes from corrupting cursor state","translated":"제어되지 않은 쓰기가 커서 상태를 손상시키는 것을 방지하여 터미널 렌더링 안정성 개선"},{"category":"improved","scope":null,"original":"Improved slash command suggestion readability by truncating long descriptions to 2 lines","translated":"긴 설명을 2줄로 줄여 슬래시 명령어 제안 가독성 개선"},{"category":"changed","scope":null,"original":"Changed tool hook execution timeout from 60 seconds to 10 minutes","translated":"도구 후크 실행 제한 시간을 60초에서 10분으로 변경"},{"category":"added","scope":"VSCode","original":"Added clickable destination selector for permission requests, allowing you to choose where settings are saved (this project, all projects, shared with team, or session only)","translated":"권한 요청을 위한 클릭 가능한 대상 선택기 추가, 설정을 저장할 위치를 선택할 수 있음 (이 프로젝트, 모든 프로젝트, 팀과 공유, 세션 전용)"}]},{"version":"2.1.2","date":null,"entries":[{"category":"added","scope":null,"original":"Added source path metadata to images dragged onto the terminal, helping Claude understand where images originated","translated":"터미널에 드래그한 이미지에 소스 경로 메타데이터를 추가하여 Claude가 이미지의 출처를 이해할 수 있도록 개선"},{"category":"added","scope":null,"original":"Added clickable hyperlinks for file paths in tool output in terminals that support OSC 8 (like iTerm)","translated":"OSC 8을 지원하는 터미널(예: iTerm)에서 도구 출력의 파일 경로에 클릭 가능한 하이퍼링크 추가"},{"category":"added","scope":null,"original":"Added support for Windows Package Manager (winget) installations with automatic detection and update instructions","translated":"Windows 패키지 관리자(winget) 설치 지원 추가, 자동 감지 및 업데이트 지침 포함"},{"category":"added","scope":null,"original":"Added Shift+Tab keyboard shortcut in plan mode to quickly select \"auto-accept edits\" option","translated":"계획 모드에서 \"자동 수락 편집\" 옵션을 빠르게 선택할 수 있는 Shift+Tab 키보드 단축키 추가"},{"category":"added","scope":null,"original":"Added `FORCE_AUTOUPDATE_PLUGINS` environment variable to allow plugin autoupdate even when the main auto-updater is disabled","translated":"메인 자동 업데이트가 비활성화된 경우에도 플러그인 자동 업데이트를 허용하는 `FORCE_AUTOUPDATE_PLUGINS` 환경 변수 추가"},{"category":"added","scope":null,"original":"Added `agent_type` to SessionStart hook input, populated if `--agent` is specified","translated":"`--agent`가 지정된 경우, `agent_type`을 SessionStart 훅 입력에 추가"},{"category":"fixed","scope":null,"original":"Fixed a command injection vulnerability in bash command processing where malformed input could execute arbitrary commands","translated":"잘못된 입력이 임의의 명령을 실행할 수 있는 bash 명령 처리의 명령 주입 취약점 수정"},{"category":"fixed","scope":null,"original":"Fixed a memory leak where tree-sitter parse trees were not being freed, causing WASM memory to grow unbounded over long sessions","translated":"tree-sitter 구문 트리가 해제되지 않아 긴 세션 동안 WASM 메모리가 무한히 증가하는 메모리 누수 수정"},{"category":"fixed","scope":null,"original":"Fixed binary files (images, PDFs, etc.) being accidentally included in memory when using `@include` directives in CLAUDE.md files","translated":"CLAUDE.md 파일에서 `@include` 지시문을 사용할 때 바이너리 파일(이미지, PDF 등)이 메모리에 실수로 포함되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed updates incorrectly claiming another installation is in progress","translated":"업데이트가 잘못된 설치가 진행 중이라고 주장하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed crash when socket files exist in watched directories (defense-in-depth for EOPNOTSUPP errors)","translated":"감시 디렉토리에 소켓 파일이 존재할 때 발생하는 충돌 수정 (EOPNOTSUPP 오류에 대한 방어)"},{"category":"fixed","scope":null,"original":"Fixed remote session URL and teleport being broken when using `/tasks` command","translated":"`/tasks` 명령을 사용할 때 원격 세션 URL과 텔레포트가 작동하지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed MCP tool names being exposed in analytics events by sanitizing user-specific server configurations","translated":"사용자별 서버 구성을 정리하여 분석 이벤트에 MCP 도구 이름이 노출되는 문제 수정"},{"category":"improved","scope":null,"original":"Improved Option-as-Meta hint on macOS to show terminal-specific instructions for native CSIu terminals like iTerm2, Kitty, and WezTerm","translated":"macOS에서 Option-as-Meta 힌트를 개선하여 iTerm2, Kitty, WezTerm과 같은 네이티브 CSIu 터미널에 대한 터미널별 지침 표시"},{"category":"improved","scope":null,"original":"Improved error message when pasting images over SSH to suggest using `scp` instead of the unhelpful clipboard shortcut hint","translated":"SSH를 통해 이미지를 붙여넣을 때 발생하는 오류 메시지를 개선하여 비효율적인 클립보드 단축키 힌트 대신 `scp` 사용을 제안"},{"category":"improved","scope":null,"original":"Improved permission explainer to not flag routine dev workflows (git fetch/rebase, npm install, tests, PRs) as medium risk","translated":"권한 설명을 개선하여 일반적인 개발 워크플로우(git fetch/rebase, npm install, 테스트, PR)를 중간 위험으로 표시하지 않도록 개선"},{"category":"changed","scope":null,"original":"Changed large bash command outputs to be saved to disk instead of truncated, allowing Claude to read the full content","translated":"큰 bash 명령 출력을 잘라내는 대신 디스크에 저장하여 Claude가 전체 내용을 읽을 수 있도록 변경"},{"category":"changed","scope":null,"original":"Changed large tool outputs to be persisted to disk instead of truncated, providing full output access via file references","translated":"큰 도구 출력을 잘라내는 대신 디스크에 저장하여 파일 참조를 통해 전체 출력에 접근할 수 있도록 변경"},{"category":"changed","scope":null,"original":"Changed `/plugins` installed tab to unify plugins and MCPs with scope-based grouping","translated":"`/plugins` 설치 탭을 플러그인과 MCP를 범위 기반 그룹화로 통합하도록 변경"},{"category":"removed","scope":null,"original":"Deprecated Windows managed settings path `C:\\ProgramData\\ClaudeCode\\managed-settings.json` - administrators should migrate to `C:\\Program Files\\ClaudeCode\\managed-settings.json`","translated":"Windows 관리 설정 경로 `C:\\ProgramData\\ClaudeCode\\managed-settings.json` 사용 중단 - 관리자는 `C:\\Program Files\\ClaudeCode\\managed-settings.json`으로 이전해야 함"},{"category":"changed","scope":"SDK","original":"Changed minimum zod peer dependency to ^4.0.0","translated":"최소 zod 피어 의존성을 ^4.0.0으로 변경했습니다."},{"category":"fixed","scope":"VSCode","original":"Fixed usage display not updating after manual compact","translated":"수동 압축 후 사용량 표시가 업데이트되지 않는 문제를 수정했습니다."}]},{"version":"2.1.1","date":"2026-01-07","entries":[]},{"version":"2.1.0","date":null,"entries":[{"category":"added","scope":null,"original":"Added automatic skill hot-reload - skills created or modified in `~/.claude/skills` or `.claude/skills` are now immediately available without restarting the session","translated":"자동 스킬 핫 리로드 추가 - `~/.claude/skills` 또는 `.claude/skills`에서 생성되거나 수정된 스킬이 세션을 재시작하지 않고도 즉시 사용 가능"},{"category":"added","scope":null,"original":"Added support for running skills and slash commands in a forked sub-agent context using `context: fork` in skill frontmatter","translated":"스킬 프론트매터에서 `context: fork`를 사용하여 포크된 하위 에이전트 컨텍스트에서 스킬 및 슬래시 명령 실행 지원 추가"},{"category":"added","scope":null,"original":"Added support for `agent` field in skills to specify agent type for execution","translated":"실행을 위한 에이전트 유형을 지정하기 위해 스킬에 `agent` 필드 지원 추가"},{"category":"added","scope":null,"original":"Added `language` setting to configure Claude's response language (e.g., language: \"japanese\")","translated":"Claude의 응답 언어를 설정할 수 있는 `language` 설정 추가 (예: language: \"japanese\")"},{"category":"changed","scope":null,"original":"Changed Shift+Enter to work out of the box in iTerm2, WezTerm, Ghostty, and Kitty without modifying terminal configs","translated":"터미널 설정을 수정하지 않고도 iTerm2, WezTerm, Ghostty, Kitty에서 Shift+Enter가 기본적으로 작동하도록 변경"},{"category":"added","scope":null,"original":"Added `respectGitignore` support in `settings.json` for per-project control over @-mention file picker behavior","translated":"`settings.json`에서 `respectGitignore` 지원 추가로 프로젝트별 @-멘션 파일 선택기 동작 제어 가능"},{"category":"added","scope":null,"original":"Added `IS_DEMO` environment variable to hide email and organization from the UI, useful for streaming or recording sessions","translated":"UI에서 이메일 및 조직을 숨기기 위한 `IS_DEMO` 환경 변수 추가, 스트리밍 또는 녹화 세션에 유용"},{"category":"fixed","scope":null,"original":"Fixed security issue where sensitive data (OAuth tokens, API keys, passwords) could be exposed in debug logs","translated":"디버그 로그에서 민감한 데이터(OAuth 토큰, API 키, 비밀번호)가 노출될 수 있는 보안 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed files and skills not being properly discovered when resuming sessions with `-c` or `--resume`","translated":"`-c` 또는 `--resume`으로 세션을 재개할 때 파일 및 스킬이 제대로 발견되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed pasted content being lost when replaying prompts from history using up arrow or Ctrl+R search","translated":"위 화살표 또는 Ctrl+R 검색을 사용하여 기록에서 프롬프트를 재생할 때 붙여넣은 내용이 손실되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Esc key with queued prompts to only move them to input without canceling the running task","translated":"대기 중인 프롬프트와 함께 Esc 키를 사용하여 실행 중인 작업을 취소하지 않고 입력으로만 이동하도록 수정"},{"category":"other","scope":null,"original":"Reduced permission prompts for complex bash commands","translated":"복잡한 bash 명령에 대한 권한 프롬프트 감소"},{"category":"fixed","scope":null,"original":"Fixed command search to prioritize exact and prefix matches on command names over fuzzy matches in descriptions","translated":"명령 검색이 설명의 퍼지 매치보다 명령 이름의 정확한 매치 및 접두사 매치를 우선하도록 수정"},{"category":"fixed","scope":null,"original":"Fixed PreToolUse hooks to allow `updatedInput` when returning `ask` permission decision, enabling hooks to act as middleware while still requesting user consent","translated":"`ask` 권한 결정을 반환할 때 `updatedInput`을 허용하도록 PreToolUse 훅 수정, 사용자의 동의를 요청하면서 미들웨어로 작동 가능"},{"category":"fixed","scope":null,"original":"Fixed plugin path resolution for file-based marketplace sources","translated":"파일 기반 마켓플레이스 소스에 대한 플러그인 경로 해상도 수정"},{"category":"fixed","scope":null,"original":"Fixed LSP tool being incorrectly enabled when no LSP servers were configured","translated":"LSP 서버가 구성되지 않았을 때 LSP 도구가 잘못 활성화되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed background tasks failing with \"git repository not found\" error for repositories with dots in their names","translated":"이름에 점이 있는 저장소에서 \"git repository not found\" 오류로 백그라운드 작업 실패 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Claude in Chrome support for WSL environments","translated":"WSL 환경에서 Chrome의 Claude 지원 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Windows native installer silently failing when executable creation fails","translated":"실행 파일 생성 실패 시 Windows 네이티브 설치 프로그램이 조용히 실패하는 문제 수정"},{"category":"improved","scope":null,"original":"Improved CLI help output to display options and subcommands in alphabetical order for easier navigation","translated":"CLI 도움말 출력 개선으로 옵션 및 하위 명령을 알파벳 순서로 표시하여 탐색 용이성 향상"},{"category":"added","scope":null,"original":"Added wildcard pattern matching for Bash tool permissions using `*` at any position in rules (e.g., `Bash(npm *)`, `Bash(* install)`, `Bash(git * main)`)","translated":"규칙 내에서 `*`를 사용하여 Bash 도구 권한에 대한 와일드카드 패턴 매칭 추가 (예: `Bash(npm *)`, `Bash(* install)`, `Bash(git * main)`)"},{"category":"added","scope":null,"original":"Added unified Ctrl+B backgrounding for both bash commands and agents - pressing Ctrl+B now backgrounds all running foreground tasks simultaneously","translated":"Bash 명령어와 에이전트 모두에 대해 통합된 Ctrl+B 백그라운드 기능 추가 - Ctrl+B를 누르면 모든 실행 중인 포그라운드 작업이 동시에 백그라운드로 전환됨"},{"category":"added","scope":null,"original":"Added support for MCP `list_changed` notifications, allowing MCP servers to dynamically update their available tools, prompts, and resources without requiring reconnection","translated":"MCP `list_changed` 알림 지원 추가, MCP 서버가 재연결 없이 사용 가능한 도구, 프롬프트 및 리소스를 동적으로 업데이트할 수 있도록 함"},{"category":"added","scope":null,"original":"Added `/teleport` and `/remote-env` slash commands for claude.ai subscribers, allowing them to resume and configure remote sessions","translated":"claude.ai 구독자를 위한 `/teleport` 및 `/remote-env` 슬래시 명령어 추가, 원격 세션을 재개하고 구성할 수 있도록 함"},{"category":"added","scope":null,"original":"Added support for disabling specific agents using `Task(AgentName)` syntax in settings.json permissions or the `--disallowedTools` CLI flag","translated":"settings.json 권한의 `Task(AgentName)` 구문 또는 `--disallowedTools` CLI 플래그를 사용하여 특정 에이전트를 비활성화하는 기능 추가"},{"category":"added","scope":null,"original":"Added hooks support to agent frontmatter, allowing agents to define PreToolUse, PostToolUse, and Stop hooks scoped to the agent's lifecycle","translated":"에이전트 프론트매터에 훅 지원 추가, 에이전트의 수명 주기에 따라 PreToolUse, PostToolUse, Stop 훅을 정의할 수 있도록 함"},{"category":"added","scope":null,"original":"Added hooks support for skill and slash command frontmatter","translated":"스킬 및 슬래시 명령어 프론트매터에 대한 훅 지원 추가"},{"category":"added","scope":null,"original":"Added new Vim motions: `;` and `,` to repeat f/F/t/T motions, `y` operator for yank with `yy`/`Y`, `p`/`P` for paste, text objects (`iw`, `aw`, `iW`, `aW`, `i\"`, `a\"`, `i'`, `a'`, `i(`, `a(`, `i[`, `a[`, `i{`, `a{`), `>>` and `<<` for indent/dedent, and `J` to join lines","translated":"새로운 Vim 모션 추가: f/F/t/T 모션 반복을 위한 `;` 및 `,`, `yy`/`Y`와 함께 yank를 위한 `y` 연산자, 붙여넣기를 위한 `p`/`P`, 텍스트 객체 (`iw`, `aw`, `iW`, `aW`, `i\"`, `a\"`, `i'`, `a'`, `i(`, `a(`, `i[`, `a[`, `i{`, `a{`), 들여쓰기/내어쓰기를 위한 `>>` 및 `<<`, 줄을 연결하기 위한 `J`"},{"category":"added","scope":null,"original":"Added `/plan` command shortcut to enable plan mode directly from the prompt","translated":"프롬프트에서 직접 계획 모드를 활성화하기 위한 `/plan` 명령어 단축키 추가"},{"category":"added","scope":null,"original":"Added slash command autocomplete support when `/` appears anywhere in input, not just at the beginning","translated":"입력 어디에서나 `/`가 나타날 때 슬래시 명령어 자동완성 지원 추가"},{"category":"added","scope":null,"original":"Added `--tools` flag support in interactive mode to restrict which built-in tools Claude can use during interactive sessions","translated":"대화형 모드에서 `--tools` 플래그 지원 추가, 대화형 세션 동안 Claude가 사용할 수 있는 내장 도구를 제한할 수 있도록 함"},{"category":"added","scope":null,"original":"Added `CLAUDE_CODE_FILE_READ_MAX_OUTPUT_TOKENS` environment variable to override the default file read token limit","translated":"기본 파일 읽기 토큰 제한을 재정의하기 위한 `CLAUDE_CODE_FILE_READ_MAX_OUTPUT_TOKENS` 환경 변수 추가"},{"category":"added","scope":null,"original":"Added support for `once: true` config for hooks","translated":"훅에 대한 `once: true` 구성 지원 추가"},{"category":"added","scope":null,"original":"Added support for YAML-style lists in frontmatter `allowed-tools` field for cleaner skill declarations","translated":"프론트매터 `allowed-tools` 필드에서 YAML 스타일 목록 지원 추가, 더 깔끔한 스킬 선언을 위해"},{"category":"added","scope":null,"original":"Added support for prompt and agent hook types from plugins (previously only command hooks were supported)","translated":"플러그인에서 프롬프트 및 에이전트 훅 유형 지원 추가 (이전에는 명령어 훅만 지원)"},{"category":"added","scope":null,"original":"Added Cmd+V support for image paste in iTerm2 (maps to Ctrl+V)","translated":"iTerm2에서 이미지 붙여넣기를 위한 Cmd+V 지원 추가 (Ctrl+V에 매핑)"},{"category":"added","scope":null,"original":"Added left/right arrow key navigation for cycling through tabs in dialogs","translated":"대화 상자에서 탭을 순환하기 위한 좌/우 화살표 키 탐색 추가"},{"category":"added","scope":null,"original":"Added real-time thinking block display in Ctrl+O transcript mode","translated":"Ctrl+O 전사 모드에서 실시간 사고 블록 표시 추가"},{"category":"added","scope":null,"original":"Added filepath to full output in background bash task details dialog","translated":"백그라운드 bash 작업 세부 정보 대화 상자에 전체 출력 파일 경로 추가"},{"category":"added","scope":null,"original":"Added Skills as a separate category in the context visualization","translated":"컨텍스트 시각화에서 별도의 카테고리로 스킬 추가"},{"category":"fixed","scope":null,"original":"Fixed OAuth token refresh not triggering when server reports token expired but local expiration check disagrees","translated":"서버가 토큰 만료를 보고하지만 로컬 만료 확인이 일치하지 않을 때 OAuth 토큰 갱신이 트리거되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed session persistence getting stuck after transient server errors by recovering from 409 conflicts when the entry was actually stored","translated":"항목이 실제로 저장되었을 때 409 충돌에서 복구하여 일시적인 서버 오류 후 세션 지속성이 멈추는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed session resume failures caused by orphaned tool results during concurrent tool execution","translated":"동시 도구 실행 중 고아가 된 도구 결과로 인해 세션 재개 실패 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed a race condition where stale OAuth tokens could be read from the keychain cache during concurrent token refresh attempts","translated":"동시 토큰 갱신 시도 중 키체인 캐시에서 오래된 OAuth 토큰이 읽힐 수 있는 경쟁 상태 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed AWS Bedrock subagents not inheriting EU/APAC cross-region inference model configuration, causing 403 errors when IAM permissions are scoped to specific regions","translated":"AWS Bedrock 하위 에이전트가 EU/APAC 크로스 리전 추론 모델 구성을 상속하지 않아 IAM 권한이 특정 지역에 제한될 때 403 오류가 발생하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed API context overflow when background tasks produce large output by truncating to 30K chars with file path reference","translated":"백그라운드 작업이 큰 출력을 생성할 때 파일 경로 참조로 30K 문자로 잘라내어 API 컨텍스트 오버플로 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed a hang when reading FIFO files by skipping symlink resolution for special file types","translated":"특수 파일 유형에 대한 심볼릭 링크 해석을 건너뛰어 FIFO 파일 읽기 시 발생하는 멈춤 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed terminal keyboard mode not being reset on exit in Ghostty, iTerm2, Kitty, and WezTerm","translated":"Ghostty, iTerm2, Kitty, WezTerm에서 종료 시 터미널 키보드 모드가 재설정되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Alt+B and Alt+F (word navigation) not working in iTerm2, Ghostty, Kitty, and WezTerm","translated":"iTerm2, Ghostty, Kitty, WezTerm에서 Alt+B 및 Alt+F(단어 탐색)가 작동하지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed `${CLAUDE_PLUGIN_ROOT}` not being substituted in plugin `allowed-tools` frontmatter, which caused tools to incorrectly require approval","translated":"플러그인 `allowed-tools` 프론트매터에서 `${CLAUDE_PLUGIN_ROOT}`가 대체되지 않아 도구가 잘못 승인 요구되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed files created by the Write tool using hardcoded 0o600 permissions instead of respecting the system umask","translated":"Write 도구로 생성된 파일이 시스템 umask를 존중하지 않고 하드코딩된 0o600 권한을 사용하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed commands with `$()` command substitution failing with parse errors","translated":"`$()` 명령어 치환이 구문 오류로 실패하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed multi-line bash commands with backslash continuations being incorrectly split and flagged for permissions","translated":"백슬래시 연속이 있는 다중 라인 bash 명령어가 잘못 분할되어 권한 플래그가 지정되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed bash command prefix extraction to correctly identify subcommands after global options (e.g., `git -C /path log` now correctly matches `Bash(git log:*)` rules)","translated":"bash 명령어 접두사 추출이 전역 옵션 후 하위 명령어를 올바르게 식별하도록 수정 (예: `git -C /path log`가 이제 `Bash(git log:*)` 규칙과 올바르게 일치)"},{"category":"fixed","scope":null,"original":"Fixed slash commands passed as CLI arguments (e.g., `claude /context`) not being executed properly","translated":"CLI 인수로 전달된 슬래시 명령어(예: `claude /context`)가 제대로 실행되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed pressing Enter after Tab-completing a slash command selecting a different command instead of submitting the completed one","translated":"슬래시 명령어를 탭으로 자동 완성한 후 Enter를 누르면 완성된 명령어 대신 다른 명령어가 선택되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed slash command argument hint flickering and inconsistent display when typing commands with arguments","translated":"인수와 함께 명령어를 입력할 때 슬래시 명령어 인수 힌트가 깜빡이거나 일관되지 않게 표시되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Claude sometimes redundantly invoking the Skill tool when running slash commands directly","translated":"슬래시 명령어를 직접 실행할 때 Claude가 Skill 도구를 불필요하게 호출하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed skill token estimates in `/context` to accurately reflect frontmatter-only loading","translated":"`/context`에서 스킬 토큰 추정이 프론트매터 전용 로딩을 정확하게 반영하도록 수정"},{"category":"fixed","scope":null,"original":"Fixed subagents sometimes not inheriting the parent's model by default","translated":"하위 에이전트가 기본적으로 부모의 모델을 상속하지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed model picker showing incorrect selection for Bedrock/Vertex users using `--model haiku`","translated":"Bedrock/Vertex 사용자가 `--model haiku`를 사용할 때 모델 선택기가 잘못된 선택을 표시하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed duplicate Bash commands appearing in permission request option labels","translated":"권한 요청 옵션 레이블에 중복된 Bash 명령어가 나타나는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed noisy output when background tasks complete - now shows clean completion message instead of raw output","translated":"백그라운드 작업 완료 시 소음이 나는 출력 문제 수정 - 이제 원시 출력 대신 깔끔한 완료 메시지를 표시"},{"category":"fixed","scope":null,"original":"Fixed background task completion notifications to appear proactively with bullet point","translated":"백그라운드 작업 완료 알림이 총알 포인트와 함께 적극적으로 나타나도록 수정"},{"category":"fixed","scope":null,"original":"Fixed forked slash commands showing \"AbortError\" instead of \"Interrupted\" message when cancelled","translated":"포크된 슬래시 명령어가 취소될 때 \"Interrupted\" 메시지 대신 \"AbortError\"를 표시하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed cursor disappearing after dismissing permission dialogs","translated":"권한 대화 상자를 닫은 후 커서가 사라지는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed `/hooks` menu selecting wrong hook type when scrolling to a different option","translated":"`/hooks` 메뉴에서 다른 옵션으로 스크롤할 때 잘못된 후크 유형을 선택하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed images in queued prompts showing as \"[object Object]\" when pressing Esc to cancel","translated":"대기 중인 프롬프트의 이미지가 Esc를 눌러 취소할 때 \"[object Object]\"로 표시되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed images being silently dropped when queueing messages while backgrounding a task","translated":"작업을 백그라운드로 전환하는 동안 메시지를 대기열에 추가할 때 이미지가 조용히 삭제되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed large pasted images failing with \"Image was too large\" error","translated":"큰 이미지를 붙여넣을 때 \"Image was too large\" 오류가 발생하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed extra blank lines in multiline prompts containing CJK characters (Japanese, Chinese, Korean)","translated":"CJK 문자(일본어, 중국어, 한국어)가 포함된 여러 줄 프롬프트에서 불필요한 빈 줄이 생기는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed ultrathink keyword highlighting being applied to wrong characters when user prompt text wraps to multiple lines","translated":"사용자 프롬프트 텍스트가 여러 줄로 줄 바꿈될 때 잘못된 문자에 울트라싱크 키워드 강조가 적용되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed collapsed \"Reading X files…\" indicator incorrectly switching to past tense when thinking blocks appear mid-stream","translated":"\"Reading X files…\" 지시자가 중간에 생각 블록이 나타날 때 과거 시제로 잘못 전환되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Bash read commands (like `ls` and `cat`) not being counted in collapsed read/search groups, causing groups to incorrectly show \"Read 0 files\"","translated":"Bash 읽기 명령어(`ls` 및 `cat` 등)가 축소된 읽기/검색 그룹에 포함되지 않아 그룹이 \"Read 0 files\"로 잘못 표시되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed spinner token counter to properly accumulate tokens from subagents during execution","translated":"스피너 토큰 카운터가 실행 중에 하위 에이전트로부터 토큰을 제대로 누적하도록 수정"},{"category":"fixed","scope":null,"original":"Fixed memory leak in git diff parsing where sliced strings retained large parent strings","translated":"잘린 문자열이 큰 부모 문자열을 유지하는 git diff 파싱의 메모리 누수 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed race condition where LSP tool could return \"no server available\" during startup","translated":"LSP 도구가 시작 시 \"no server available\"을 반환할 수 있는 경쟁 조건 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed feedback submission hanging indefinitely when network requests timeout","translated":"네트워크 요청이 시간 초과될 때 피드백 제출이 무한히 걸리는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed search mode in plugin discovery and log selector views exiting when pressing up arrow","translated":"플러그인 검색 및 로그 선택기 보기에서 검색 모드가 위쪽 화살표를 누를 때 종료되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed hook success message showing trailing colon when hook has no output","translated":"후크에 출력이 없을 때 후크 성공 메시지에 콜론이 남는 문제 수정"},{"category":"other","scope":null,"original":"Multiple optimizations to improve startup performance","translated":"시작 성능을 향상시키기 위한 여러 최적화"},{"category":"improved","scope":null,"original":"Improved terminal rendering performance when using native installer or Bun, especially for text with emoji, ANSI codes, and Unicode characters","translated":"네이티브 설치 프로그램 또는 Bun을 사용할 때 터미널 렌더링 성능 향상, 특히 이모지, ANSI 코드, 유니코드 문자가 포함된 텍스트에 대해"},{"category":"improved","scope":null,"original":"Improved performance when reading Jupyter notebooks with many cells","translated":"많은 셀이 있는 Jupyter 노트북을 읽을 때 성능 향상"},{"category":"improved","scope":null,"original":"Improved reliability for piped input like `cat refactor.md | claude`","translated":"`cat refactor.md | claude`와 같은 파이프 입력의 신뢰성 향상"},{"category":"improved","scope":null,"original":"Improved reliability for AskQuestion tool","translated":"AskQuestion 도구의 신뢰성 향상"},{"category":"improved","scope":null,"original":"Improved sed in-place edit commands to render as file edits with diff preview","translated":"파일 편집으로 렌더링되도록 sed 인플레이스 편집 명령을 개선하여 차이 미리보기 제공"},{"category":"improved","scope":null,"original":"Improved Claude to automatically continue when response is cut off due to output token limit, instead of showing an error message","translated":"출력 토큰 제한으로 인해 응답이 잘릴 때 오류 메시지를 표시하는 대신 자동으로 계속하도록 Claude 개선"},{"category":"improved","scope":null,"original":"Improved compaction reliability","translated":"압축 신뢰성 향상"},{"category":"improved","scope":null,"original":"Improved subagents (Task tool) to continue working after permission denial, allowing them to try alternative approaches","translated":"하위 에이전트(Task 도구)가 권한 거부 후에도 계속 작업할 수 있도록 개선하여 대체 접근 방식을 시도할 수 있도록 함"},{"category":"improved","scope":null,"original":"Improved skills to show progress while executing, displaying tool uses as they happen","translated":"실행 중 진행 상황을 보여주고 도구 사용을 실시간으로 표시하도록 기술 개선"},{"category":"improved","scope":null,"original":"Improved skills from `/skills/` directories to be visible in the slash command menu by default (opt-out with `user-invocable: false` in frontmatter)","translated":"`/skills/` 디렉토리의 기술이 기본적으로 슬래시 명령 메뉴에 표시되도록 개선 (프론트매터에 `user-invocable: false`로 선택 해제 가능)"},{"category":"improved","scope":null,"original":"Improved skill suggestions to prioritize recently and frequently used skills","translated":"최근 및 자주 사용된 기술을 우선시하도록 기술 제안 개선"},{"category":"improved","scope":null,"original":"Improved spinner feedback when waiting for the first response token","translated":"첫 번째 응답 토큰을 기다릴 때 스피너 피드백 개선"},{"category":"improved","scope":null,"original":"Improved token count display in spinner to include tokens from background agents","translated":"스피너의 토큰 수 표시를 백그라운드 에이전트의 토큰을 포함하도록 개선"},{"category":"improved","scope":null,"original":"Improved incremental output for async agents to give the main thread more control and visibility","translated":"비동기 에이전트의 점진적 출력을 개선하여 메인 스레드에 더 많은 제어 및 가시성 제공"},{"category":"improved","scope":null,"original":"Improved permission prompt UX with Tab hint moved to footer, cleaner Yes/No input labels with contextual placeholders","translated":"권한 요청 UX 개선, 탭 힌트를 푸터로 이동하고, 상황에 맞는 자리 표시자로 깔끔한 예/아니오 입력 레이블 제공"},{"category":"improved","scope":null,"original":"Improved the Claude in Chrome notification with shortened help text and persistent display until dismissed","translated":"Chrome에서 Claude 알림을 개선하여 짧은 도움말 텍스트와 해제될 때까지 지속되는 표시 제공"},{"category":"improved","scope":null,"original":"Improved macOS screenshot paste reliability with TIFF format support","translated":"TIFF 형식 지원으로 macOS 스크린샷 붙여넣기 신뢰성 향상"},{"category":"improved","scope":null,"original":"Improved `/stats` output","translated":"`/stats` 출력 개선"},{"category":"changed","scope":null,"original":"Updated Atlassian MCP integration to use a more reliable default configuration (streamable HTTP)","translated":"Atlassian MCP 통합을 더 신뢰할 수 있는 기본 구성(스트리밍 가능한 HTTP)으로 업데이트"},{"category":"changed","scope":null,"original":"Changed \"Interrupted\" message color from red to grey for a less alarming appearance","translated":"\"중단됨\" 메시지의 색상을 빨간색에서 회색으로 변경하여 덜 경고스럽게 보이도록 함"},{"category":"removed","scope":null,"original":"Removed permission prompt when entering plan mode - users can now enter plan mode without approval","translated":"계획 모드 진입 시 권한 요청 제거 - 이제 사용자가 승인 없이 계획 모드에 진입할 수 있음"},{"category":"removed","scope":null,"original":"Removed underline styling from image reference links","translated":"이미지 참조 링크에서 밑줄 스타일 제거"},{"category":"changed","scope":"SDK","original":"Changed minimum zod peer dependency to ^4.0.0","translated":"최소 zod 피어 종속성을 ^4.0.0으로 변경"},{"category":"added","scope":"VSCode","original":"Added currently selected model name to the context menu","translated":"현재 선택된 모델 이름을 컨텍스트 메뉴에 추가"},{"category":"added","scope":"VSCode","original":"Added descriptive labels on auto-accept permission button (e.g., \"Yes, allow npm for this project\" instead of \"Yes, and don't ask again\")","translated":"자동 승인 권한 버튼에 설명 레이블 추가 (예: \"예, 이 프로젝트에 npm을 허용합니다\" 대신 \"예, 다시 묻지 마세요\")"},{"category":"fixed","scope":"VSCode","original":"Fixed paragraph breaks not rendering in markdown content","translated":"마크다운 콘텐츠에서 단락 구분이 렌더링되지 않는 문제 수정"},{"category":"fixed","scope":"VSCode","original":"Fixed scrolling in the extension inadvertently scrolling the parent iframe","translated":"확장 프로그램에서 스크롤할 때 부모 iframe이 의도치 않게 스크롤되는 문제 수정"},{"category":"fixed","scope":"Windows","original":"Fixed issue with improper rendering","translated":"잘못된 렌더링 문제 수정"}]},{"version":"2.0.76","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed issue with macOS code-sign warning when using Claude in Chrome integration","translated":"Chrome 통합에서 Claude를 사용할 때 발생하는 macOS 코드 서명 경고 문제를 수정했습니다."}]},{"version":"2.0.75","date":null,"entries":[{"category":"other","scope":null,"original":"Minor bugfixes","translated":"사소한 버그 수정"}]},{"version":"2.0.74","date":null,"entries":[{"category":"added","scope":null,"original":"Added LSP (Language Server Protocol) tool for code intelligence features like go-to-definition, find references, and hover documentation","translated":"코드 인텔리전스 기능을 위한 LSP(Language Server Protocol) 도구 추가: 정의로 이동, 참조 찾기, 문서 표시"},{"category":"added","scope":null,"original":"Added `/terminal-setup` support for Kitty, Alacritty, Zed, and Warp terminals","translated":"Kitty, Alacritty, Zed, Warp 터미널에 대한 `/terminal-setup` 지원 추가"},{"category":"added","scope":null,"original":"Added ctrl+t shortcut in `/theme` to toggle syntax highlighting on/off","translated":"`/theme`에서 구문 강조 표시를 켜고 끄는 ctrl+t 단축키 추가"},{"category":"added","scope":null,"original":"Added syntax highlighting info to theme picker","translated":"테마 선택기에 구문 강조 표시 정보 추가"},{"category":"added","scope":null,"original":"Added guidance for macOS users when Alt shortcuts fail due to terminal configuration","translated":"터미널 설정으로 인해 Alt 단축키가 작동하지 않을 때 macOS 사용자 안내 추가"},{"category":"fixed","scope":null,"original":"Fixed skill `allowed-tools` not being applied to tools invoked by the skill","translated":"스킬 `allowed-tools`가 스킬에 의해 호출된 도구에 적용되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Opus 4.5 tip incorrectly showing when user was already using Opus","translated":"사용자가 이미 Opus를 사용 중일 때 Opus 4.5 팁이 잘못 표시되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed a potential crash when syntax highlighting isn't initialized correctly","translated":"구문 강조 표시가 올바르게 초기화되지 않았을 때 발생할 수 있는 충돌 수정"},{"category":"fixed","scope":null,"original":"Fixed visual bug in `/plugins discover` where list selection indicator showed while search box was focused","translated":"`/plugins discover`에서 검색 상자가 포커스될 때 목록 선택 표시기가 나타나는 시각적 버그 수정"},{"category":"fixed","scope":null,"original":"Fixed macOS keyboard shortcuts to display 'opt' instead of 'alt'","translated":"macOS 키보드 단축키가 'alt' 대신 'opt'로 표시되도록 수정"},{"category":"improved","scope":null,"original":"Improved `/context` command visualization with grouped skills and agents by source, slash commands, and sorted token count","translated":"`/context` 명령 시각화를 소스, 슬래시 명령, 정렬된 토큰 수에 따라 그룹화된 스킬 및 에이전트로 개선"},{"category":"fixed","scope":"Windows","original":"Fixed issue with improper rendering","translated":"잘못된 렌더링 문제 수정"},{"category":"added","scope":"VSCode","original":"Added gift tag pictogram for year-end promotion message","translated":"연말 프로모션 메시지를 위한 선물 태그 픽토그램 추가"}]},{"version":"2.0.73","date":null,"entries":[{"category":"added","scope":null,"original":"Added clickable `[Image #N]` links that open attached images in the default viewer","translated":"기본 뷰어에서 첨부된 이미지를 여는 클릭 가능한 `[Image #N]` 링크 추가"},{"category":"added","scope":null,"original":"Added alt-y yank-pop to cycle through kill ring history after ctrl-y yank","translated":"ctrl-y yank 후에 kill ring 기록을 순환할 수 있는 alt-y yank-pop 추가"},{"category":"added","scope":null,"original":"Added search filtering to the plugin discover screen (type to filter by name, description, or marketplace)","translated":"플러그인 검색 화면에 검색 필터링 추가 (이름, 설명 또는 마켓플레이스로 필터링)"},{"category":"added","scope":null,"original":"Added support for custom session IDs when forking sessions with `--session-id` combined with `--resume` or `--continue` and `--fork-session`","translated":"`--session-id`와 `--resume` 또는 `--continue` 및 `--fork-session`을 결합하여 세션을 포크할 때 사용자 정의 세션 ID 지원 추가"},{"category":"fixed","scope":null,"original":"Fixed slow input history cycling and race condition that could overwrite text after message submission","translated":"입력 기록 순환 속도 저하 및 메시지 제출 후 텍스트를 덮어쓸 수 있는 경쟁 조건 수정"},{"category":"improved","scope":null,"original":"Improved `/theme` command to open theme picker directly","translated":"`/theme` 명령어 개선하여 테마 선택기를 직접 열 수 있도록 개선"},{"category":"improved","scope":null,"original":"Improved theme picker UI","translated":"테마 선택기 UI 개선"},{"category":"improved","scope":null,"original":"Improved search UX across resume session, permissions, and plugins screens with a unified SearchBox component","translated":"통합된 SearchBox 컴포넌트로 재개 세션, 권한 및 플러그인 화면 전반에 걸친 검색 UX 개선"},{"category":"added","scope":"VSCode","original":"Added tab icon badges showing pending permissions (blue) and unread completions (orange)","translated":"보류 중인 권한(파란색) 및 읽지 않은 완료(주황색)를 표시하는 탭 아이콘 배지 추가"}]},{"version":"2.0.72","date":null,"entries":[{"category":"added","scope":null,"original":"Added Claude in Chrome (Beta) feature that works with the Chrome extension (https://claude.ai/chrome) to let you control your browser directly from Claude Code","translated":"Chrome 확장 프로그램(https://claude.ai/chrome)과 함께 작동하는 Chrome의 Claude (Beta) 기능 추가로 Claude Code에서 직접 브라우저를 제어할 수 있습니다."},{"category":"other","scope":null,"original":"Reduced terminal flickering","translated":"터미널 깜박임 현상 감소"},{"category":"added","scope":null,"original":"Added scannable QR code to mobile app tip for quick app downloads","translated":"빠른 앱 다운로드를 위한 모바일 앱 팁에 스캔 가능한 QR 코드 추가"},{"category":"added","scope":null,"original":"Added loading indicator when resuming conversations for better feedback","translated":"대화를 재개할 때 로딩 표시기를 추가하여 피드백 개선"},{"category":"fixed","scope":null,"original":"Fixed `/context` command not respecting custom system prompts in non-interactive mode","translated":"비대화형 모드에서 사용자 지정 시스템 프롬프트를 준수하지 않는 `/context` 명령 수정"},{"category":"fixed","scope":null,"original":"Fixed order of consecutive Ctrl+K lines when pasting with Ctrl+Y","translated":"Ctrl+Y로 붙여넣을 때 연속된 Ctrl+K 줄의 순서 수정"},{"category":"improved","scope":null,"original":"Improved @ mention file suggestion speed (~3× faster in git repositories)","translated":"@ 멘션 파일 제안 속도 개선 (git 저장소에서 약 3배 더 빠름)"},{"category":"improved","scope":null,"original":"Improved file suggestion performance in repos with `.ignore` or `.rgignore` files","translated":"`.ignore` 또는 `.rgignore` 파일이 있는 저장소에서 파일 제안 성능 개선"},{"category":"improved","scope":null,"original":"Improved settings validation errors to be more prominent","translated":"설정 유효성 검사 오류를 더 두드러지게 개선"},{"category":"changed","scope":null,"original":"Changed thinking toggle from Tab to Alt+T to avoid accidental triggers","translated":"실수로 트리거되는 것을 방지하기 위해 생각 전환을 Tab에서 Alt+T로 변경"}]},{"version":"2.0.71","date":null,"entries":[{"category":"added","scope":null,"original":"Added /config toggle to enable/disable prompt suggestions","translated":"프롬프트 제안 활성화/비활성화를 위한 /config 토글 추가"},{"category":"added","scope":null,"original":"Added `/settings` as an alias for the `/config` command","translated":"`/config` 명령어의 별칭으로 `/settings` 추가"},{"category":"fixed","scope":null,"original":"Fixed @ file reference suggestions incorrectly triggering when cursor is in the middle of a path","translated":"파일 경로 중간에 커서가 있을 때 잘못된 @ 파일 참조 제안이 발생하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed MCP servers from `.mcp.json` not loading when using `--dangerously-skip-permissions`","translated":"`--dangerously-skip-permissions` 사용 시 `.mcp.json`의 MCP 서버가 로드되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed permission rules incorrectly rejecting valid bash commands containing shell glob patterns (e.g., `ls *.txt`, `for f in *.png`)","translated":"셸 글로브 패턴이 포함된 유효한 bash 명령어가 잘못 거부되는 권한 규칙 수정 (예: `ls *.txt`, `for f in *.png`)"},{"category":"other","scope":null,"original":"Bedrock: Environment variable `ANTHROPIC_BEDROCK_BASE_URL` is now respected for token counting and inference profile listing","translated":"Bedrock: 환경 변수 `ANTHROPIC_BEDROCK_BASE_URL`이 토큰 계산 및 추론 프로필 목록에 반영되도록 수정"},{"category":"other","scope":null,"original":"New syntax highlighting engine for native build","translated":"네이티브 빌드를 위한 새로운 구문 강조 엔진 추가"}]},{"version":"2.0.70","date":null,"entries":[{"category":"added","scope":null,"original":"Added Enter key to accept and submit prompt suggestions immediately (tab still accepts for editing)","translated":"Enter 키를 추가하여 프롬프트 제안을 즉시 수락하고 제출할 수 있도록 했습니다 (탭은 여전히 편집을 위해 수락)."},{"category":"added","scope":null,"original":"Added wildcard syntax `mcp__server__*` for MCP tool permissions to allow or deny all tools from a server","translated":"MCP 도구 권한에 대해 모든 서버의 도구를 허용하거나 거부할 수 있는 와일드카드 구문 `mcp__server__*`을 추가했습니다."},{"category":"added","scope":null,"original":"Added auto-update toggle for plugin marketplaces, allowing per-marketplace control over automatic updates","translated":"플러그인 마켓플레이스에 대한 자동 업데이트 토글을 추가하여 마켓플레이스별로 자동 업데이트를 제어할 수 있게 했습니다."},{"category":"added","scope":null,"original":"Added `current_usage` field to status line input, enabling accurate context window percentage calculations","translated":"상태 줄 입력에 `current_usage` 필드를 추가하여 정확한 컨텍스트 창 비율 계산을 가능하게 했습니다."},{"category":"fixed","scope":null,"original":"Fixed input being cleared when processing queued commands while the user was typing","translated":"사용자가 입력 중일 때 대기 중인 명령을 처리하면 입력이 지워지는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed prompt suggestions replacing typed input when pressing Tab","translated":"탭을 누를 때 프롬프트 제안이 입력한 내용을 대체하는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed diff view not updating when terminal is resized","translated":"터미널 크기 조정 시 차이점 보기(diff view)가 업데이트되지 않는 문제를 수정했습니다."},{"category":"improved","scope":null,"original":"Improved memory usage by 3x for large conversations","translated":"대화가 많은 경우 메모리 사용량을 3배 개선했습니다."},{"category":"improved","scope":null,"original":"Improved resolution of stats screenshots copied to clipboard (Ctrl+S) for crisper images","translated":"클립보드에 복사된 통계 스크린샷의 해상도를 개선하여 더 선명한 이미지를 제공합니다 (Ctrl+S)."},{"category":"removed","scope":null,"original":"Removed # shortcut for quick memory entry (tell Claude to edit your CLAUDE.md instead)","translated":"빠른 메모리 입력을 위한 # 단축키를 제거했습니다 (대신 CLAUDE.md를 편집하도록 Claude에게 지시하세요)."},{"category":"fixed","scope":null,"original":"Fix thinking mode toggle in /config not persisting correctly","translated":"/config의 사고 모드 토글이 올바르게 유지되지 않는 문제를 수정했습니다."},{"category":"improved","scope":null,"original":"Improve UI for file creation permission dialog","translated":"파일 생성 권한 대화 상자의 UI를 개선했습니다."}]},{"version":"2.0.69","date":null,"entries":[{"category":"other","scope":null,"original":"Minor bugfixes","translated":"사소한 버그 수정"}]},{"version":"2.0.68","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed IME (Input Method Editor) support for languages like Chinese, Japanese, and Korean by correctly positioning the composition window at the cursor","translated":"중국어, 일본어, 한국어와 같은 언어에 대해 IME(입력기) 지원을 수정하여 조합 창이 커서에 올바르게 위치하도록 함"},{"category":"fixed","scope":null,"original":"Fixed a bug where disallowed MCP tools were visible to the model","translated":"허용되지 않은 MCP 도구가 모델에 보이는 버그 수정"},{"category":"fixed","scope":null,"original":"Fixed an issue where steering messages could be lost while a subagent is working","translated":"하위 에이전트가 작동 중일 때 조향 메시지가 손실될 수 있는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Option+Arrow word navigation treating entire CJK (Chinese, Japanese, Korean) text sequences as a single word instead of navigating by word boundaries","translated":"Option+Arrow 단어 탐색이 전체 CJK(중국어, 일본어, 한국어) 텍스트 시퀀스를 단일 단어로 취급하여 단어 경계별로 탐색하지 않는 문제 수정"},{"category":"improved","scope":null,"original":"Improved plan mode exit UX: show simplified yes/no dialog when exiting with empty or missing plan instead of throwing an error","translated":"계획 모드 종료 UX 개선: 오류를 발생시키는 대신 빈 계획이나 누락된 계획으로 종료할 때 단순화된 예/아니오 대화 상자 표시"},{"category":"added","scope":null,"original":"Add support for enterprise managed settings. Contact your Anthropic account team to enable this feature.","translated":"기업 관리 설정 지원 추가. 이 기능을 활성화하려면 Anthropic 계정 팀에 문의하세요."}]},{"version":"2.0.67","date":null,"entries":[{"category":"other","scope":null,"original":"Thinking mode is now enabled by default for Opus 4.5","translated":"Opus 4.5에서 사고 모드가 기본으로 활성화되었습니다."},{"category":"other","scope":null,"original":"Thinking mode configuration has moved to /config","translated":"사고 모드 설정이 /config로 이동했습니다."},{"category":"added","scope":null,"original":"Added search functionality to `/permissions` command with `/` keyboard shortcut for filtering rules by tool name","translated":"`/permissions` 명령어에 검색 기능이 추가되었으며, 도구 이름으로 규칙을 필터링하기 위한 `/` 키보드 단축키가 추가되었습니다."},{"category":"other","scope":null,"original":"Show reason why autoupdater is disabled in `/doctor`","translated":"`/doctor`에서 자동 업데이트가 비활성화된 이유를 표시합니다."},{"category":"fixed","scope":null,"original":"Fixed false \"Another process is currently updating Claude\" error when running `claude update` while another instance is already on the latest version","translated":"다른 인스턴스가 이미 최신 버전일 때 `claude update`를 실행하면 발생하는 \"다른 프로세스가 현재 Claude를 업데이트하고 있습니다\"라는 잘못된 오류를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed MCP servers from `.mcp.json` being stuck in pending state when running in non-interactive mode (`-p` flag or piped input)","translated":"비대화형 모드(`-p` 플래그 또는 파이프 입력)에서 실행할 때 `.mcp.json`의 MCP 서버가 대기 상태에 머무르는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed scroll position resetting after deleting a permission rule in `/permissions`","translated":"`/permissions`에서 권한 규칙을 삭제한 후 스크롤 위치가 초기화되는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed word deletion (opt+delete) and word navigation (opt+arrow) not working correctly with non-Latin text such as Cyrillic, Greek, Arabic, Hebrew, Thai, and Chinese","translated":"키릴 문자, 그리스 문자, 아랍어, 히브리어, 태국어, 중국어와 같은 비라틴 문자에서 단어 삭제(opt+delete) 및 단어 탐색(opt+arrow)이 제대로 작동하지 않는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed `claude install --force` not bypassing stale lock files","translated":"`claude install --force`가 오래된 잠금 파일을 무시하지 않는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed consecutive @~/ file references in CLAUDE.md being incorrectly parsed due to markdown strikethrough interference","translated":"CLAUDE.md에서 연속적인 @~/ 파일 참조가 마크다운 취소선 간섭으로 인해 잘못 해석되는 문제를 수정했습니다."},{"category":"other","scope":null,"original":"Windows: Fixed plugin MCP servers failing due to colons in log directory paths","translated":"Windows: 로그 디렉토리 경로에 콜론이 포함되어 MCP 서버 플러그인이 실패하는 문제를 수정했습니다."}]},{"version":"2.0.65","date":null,"entries":[{"category":"added","scope":null,"original":"Added ability to switch models while writing a prompt using alt+p (linux, windows), option+p (macos).","translated":"프롬프트 작성 중 모델을 전환할 수 있는 기능 추가 (linux, windows에서는 alt+p, macos에서는 option+p 사용)."},{"category":"added","scope":null,"original":"Added context window information to status line input","translated":"상태 줄 입력에 컨텍스트 창 정보 추가"},{"category":"added","scope":null,"original":"Added `fileSuggestion` setting for custom `@` file search commands","translated":"사용자 지정 `@` 파일 검색 명령을 위한 `fileSuggestion` 설정 추가"},{"category":"added","scope":null,"original":"Added `CLAUDE_CODE_SHELL` environment variable to override automatic shell detection (useful when login shell differs from actual working shell)","translated":"자동 셸 감지를 무시할 수 있는 `CLAUDE_CODE_SHELL` 환경 변수 추가 (로그인 셸과 실제 작업 셸이 다를 때 유용)"},{"category":"fixed","scope":null,"original":"Fixed prompt not being saved to history when aborting a query with Escape","translated":"Escape로 쿼리를 중단할 때 프롬프트가 기록에 저장되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed Read tool image handling to identify format from bytes instead of file extension","translated":"파일 확장자가 아닌 바이트에서 형식을 식별하도록 Read 도구의 이미지 처리 수정"}]},{"version":"2.0.64","date":null,"entries":[{"category":"other","scope":null,"original":"Made auto-compacting instant","translated":"자동 압축 기능을 즉시 수행하도록 개선"},{"category":"other","scope":null,"original":"Agents and bash commands can run asynchronously and send messages to wake up the main agent","translated":"에이전트와 bash 명령어가 비동기적으로 실행되며, 메인 에이전트를 깨우기 위해 메시지를 보낼 수 있음"},{"category":"other","scope":null,"original":"/stats now provides users with interesting CC stats, such as favorite model, usage graph, usage streak","translated":"/stats에서 사용자에게 즐겨찾는 모델, 사용 그래프, 사용 연속 기록 등 흥미로운 CC 통계를 제공"},{"category":"added","scope":null,"original":"Added named session support: use `/rename` to name sessions, `/resume <name>` in REPL or `claude --resume <name>` from the terminal to resume them","translated":"세션 이름 지정 기능 추가: REPL에서 `/rename`으로 세션 이름 지정, `/resume <name>` 또는 터미널에서 `claude --resume <name>`으로 세션 재개"},{"category":"added","scope":null,"original":"Added support for .claude/rules/`.  See https://code.claude.com/docs/en/memory for details.","translated":".claude/rules/ 지원 추가. 자세한 내용은 https://code.claude.com/docs/en/memory 참조."},{"category":"added","scope":null,"original":"Added image dimension metadata when images are resized, enabling accurate coordinate mappings for large images","translated":"이미지 크기 조정 시 이미지 차원 메타데이터 추가, 대형 이미지에 대한 정확한 좌표 매핑 가능"},{"category":"fixed","scope":null,"original":"Fixed auto-loading .env when using native installer","translated":"네이티브 설치 프로그램 사용 시 .env 자동 로딩 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed `--system-prompt` being ignored when using `--continue` or `--resume` flags","translated":"`--continue` 또는 `--resume` 플래그 사용 시 `--system-prompt`가 무시되는 문제 수정"},{"category":"improved","scope":null,"original":"Improved `/resume` screen with grouped forked sessions and keyboard shortcuts for preview (P) and rename (R)","translated":"`/resume` 화면 개선: 포크된 세션 그룹화 및 미리보기(P), 이름 변경(R)을 위한 키보드 단축키 추가"},{"category":"other","scope":null,"original":"VSCode: Added copy-to-clipboard button on code blocks and bash tool inputs","translated":"VSCode: 코드 블록 및 bash 도구 입력에 클립보드로 복사 버튼 추가"},{"category":"other","scope":null,"original":"VSCode: Fixed extension not working on Windows ARM64 by falling back to x64 binary via emulation","translated":"VSCode: Windows ARM64에서 확장이 작동하지 않는 문제를 x64 바이너리 에뮬레이션으로 해결"},{"category":"other","scope":null,"original":"Bedrock: Improve efficiency of token counting","translated":"Bedrock: 토큰 카운팅 효율성 개선"},{"category":"other","scope":null,"original":"Bedrock: Add support for `aws login` AWS Management Console credentials","translated":"Bedrock: `aws login` AWS 관리 콘솔 자격 증명 지원 추가"},{"category":"other","scope":null,"original":"Unshipped AgentOutputTool and BashOutputTool, in favor of a new unified TaskOutputTool","translated":"AgentOutputTool과 BashOutputTool을 새로운 통합 TaskOutputTool로 대체"}]},{"version":"2.0.62","date":null,"entries":[{"category":"added","scope":null,"original":"Added \"(Recommended)\" indicator for multiple-choice questions, with the recommended option moved to the top of the list","translated":"여러 선택 질문에 \"(추천)\" 표시를 추가하고, 추천 옵션을 목록 상단으로 이동했습니다."},{"category":"added","scope":null,"original":"Added `attribution` setting to customize commit and PR bylines (deprecates `includeCoAuthoredBy`)","translated":"커밋과 PR 서명을 사용자 정의할 수 있는 `attribution` 설정을 추가했습니다 (`includeCoAuthoredBy`는 더 이상 사용되지 않습니다)."},{"category":"fixed","scope":null,"original":"Fixed duplicate slash commands appearing when ~/.claude is symlinked to a project directory","translated":"~/.claude가 프로젝트 디렉토리에 심볼릭 링크로 연결될 때 중복된 슬래시 명령이 나타나는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed slash command selection not working when multiple commands share the same name","translated":"여러 명령이 동일한 이름을 공유할 때 슬래시 명령 선택이 작동하지 않는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed an issue where skill files inside symlinked skill directories could become circular symlinks","translated":"심볼릭 링크된 기술 디렉토리 내의 기술 파일이 순환 심볼릭 링크가 될 수 있는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed running versions getting removed because lock file incorrectly going stale","translated":"잠금 파일이 잘못되어 실행 중인 버전이 제거되는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed IDE diff tab not closing when rejecting file changes","translated":"파일 변경을 거부할 때 IDE 차이 탭이 닫히지 않는 문제를 수정했습니다."}]},{"version":"2.0.61","date":null,"entries":[{"category":"other","scope":null,"original":"Reverted VSCode support for multiple terminal clients due to responsiveness issues.","translated":"반응성 문제로 인해 VSCode의 다중 터미널 클라이언트 지원을 되돌렸습니다."}]},{"version":"2.0.60","date":null,"entries":[{"category":"added","scope":null,"original":"Added background agent support. Agents run in the background while you work","translated":"백그라운드 에이전트 지원 추가. 작업 중에도 에이전트가 백그라운드에서 실행됩니다"},{"category":"added","scope":null,"original":"Added --disable-slash-commands CLI flag to disable all slash commands","translated":"모든 슬래시 명령어를 비활성화하는 `--disable-slash-commands` CLI 플래그 추가"},{"category":"added","scope":null,"original":"Added model name to \"Co-Authored-By\" commit messages","translated":"\"Co-Authored-By\" 커밋 메시지에 모델 이름 추가"},{"category":"other","scope":null,"original":"Enabled \"/mcp enable [server-name]\" or \"/mcp disable [server-name]\" to quickly toggle all servers","translated":"\"/mcp enable [server-name]\" 또는 \"/mcp disable [server-name]\"을 사용하여 모든 서버를 빠르게 전환 가능"},{"category":"changed","scope":null,"original":"Updated Fetch to skip summarization for pre-approved websites","translated":"사전 승인된 웹사이트에 대해서는 요약을 건너뛰도록 Fetch 업데이트"},{"category":"other","scope":null,"original":"VSCode: Added support for multiple terminal clients connecting to the IDE server simultaneously","translated":"VSCode: 여러 터미널 클라이언트가 IDE 서버에 동시에 연결할 수 있도록 지원 추가"}]},{"version":"2.0.59","date":null,"entries":[{"category":"added","scope":null,"original":"Added --agent CLI flag to override the agent setting for the current session","translated":"현재 세션의 에이전트 설정을 재정의하기 위한 --agent CLI 플래그 추가"},{"category":"added","scope":null,"original":"Added `agent` setting to configure main thread with a specific agent's system prompt, tool restrictions, and model","translated":"특정 에이전트의 시스템 프롬프트, 도구 제한, 모델로 메인 스레드를 구성하기 위한 `agent` 설정 추가"},{"category":"other","scope":null,"original":"VS Code: Fixed .claude.json config file being read from incorrect location","translated":"VS Code: 잘못된 위치에서 .claude.json 구성 파일을 읽는 문제 수정"}]},{"version":"2.0.58","date":null,"entries":[{"category":"other","scope":null,"original":"Pro users now have access to Opus 4.5 as part of their subscription!","translated":"프로 사용자들은 이제 구독의 일환으로 Opus 4.5에 접근할 수 있습니다!"},{"category":"fixed","scope":null,"original":"Fixed timer duration showing \"11m 60s\" instead of \"12m 0s\"","translated":"타이머 지속 시간이 \"12m 0s\" 대신 \"11m 60s\"로 표시되는 문제를 수정했습니다."},{"category":"other","scope":null,"original":"Windows: Managed settings now prefer `C:\\Program Files\\ClaudeCode` if it exists. Support for `C:\\ProgramData\\ClaudeCode` will be removed in a future version.","translated":"Windows: 관리 설정이 이제 `C:\\Program Files\\ClaudeCode`가 존재할 경우 이를 우선합니다. `C:\\ProgramData\\ClaudeCode`에 대한 지원은 향후 버전에서 제거될 예정입니다."}]},{"version":"2.0.57","date":null,"entries":[{"category":"added","scope":null,"original":"Added feedback input when rejecting plans, allowing users to tell Claude what to change","translated":"계획을 거절할 때 피드백 입력 기능을 추가하여 사용자가 Claude에게 변경할 내용을 알릴 수 있도록 함"},{"category":"other","scope":null,"original":"VSCode: Added streaming message support for real-time response display","translated":"VSCode: 실시간 응답 표시를 위한 스트리밍 메시지 지원 추가"}]},{"version":"2.0.56","date":null,"entries":[{"category":"added","scope":null,"original":"Added setting to enable/disable terminal progress bar (OSC 9;4)","translated":"터미널 진행 표시줄(OSC 9;4)을 활성화/비활성화하는 설정 추가"},{"category":"other","scope":null,"original":"VSCode Extension: Added support for VS Code's secondary sidebar (VS Code 1.97+), allowing Claude Code to be displayed in the right sidebar while keeping the file explorer on the left. Requires setting sidebar as Preferred Location in the config.","translated":"VSCode 확장: VS Code의 보조 사이드바(VS Code 1.97+) 지원 추가, Claude Code를 오른쪽 사이드바에 표시하면서 파일 탐색기를 왼쪽에 유지할 수 있음. 설정에서 사이드바를 선호 위치로 설정해야 함."}]},{"version":"2.0.55","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed proxy DNS resolution being forced on by default. Now opt-in via `CLAUDE_CODE_PROXY_RESOLVES_HOSTS=true` environment variable","translated":"기본적으로 강제되었던 프록시 DNS 해상도 문제를 수정했습니다. 이제 `CLAUDE_CODE_PROXY_RESOLVES_HOSTS=true` 환경 변수를 통해 선택적으로 활성화할 수 있습니다."},{"category":"fixed","scope":null,"original":"Fixed keyboard navigation becoming unresponsive when holding down arrow keys in memory location selector","translated":"메모리 위치 선택기에서 화살표 키를 누르고 있을 때 키보드 탐색이 응답하지 않는 문제를 수정했습니다."},{"category":"improved","scope":null,"original":"Improved AskUserQuestion tool to auto-submit single-select questions on the last question, eliminating the extra review screen for simple question flows","translated":"AskUserQuestion 도구를 개선하여 단일 선택 질문의 경우 마지막 질문에서 자동 제출되도록 했습니다. 이를 통해 간단한 질문 흐름에서 추가 검토 화면이 제거되었습니다."},{"category":"improved","scope":null,"original":"Improved fuzzy matching for `@` file suggestions with faster, more accurate results","translated":"`@` 파일 제안에 대한 퍼지 매칭을 개선하여 더 빠르고 정확한 결과를 제공합니다."}]},{"version":"2.0.54","date":null,"entries":[{"category":"other","scope":null,"original":"Hooks: Enable PermissionRequest hooks to process 'always allow' suggestions and apply permission updates","translated":"훅: '항상 허용' 제안 처리 및 권한 업데이트 적용을 위한 PermissionRequest 훅 활성화"},{"category":"fixed","scope":null,"original":"Fix issue with excessive iTerm notifications","translated":"과도한 iTerm 알림 문제 수정"}]},{"version":"2.0.52","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed duplicate message display when starting Claude with a command line argument","translated":"명령줄 인수로 Claude를 시작할 때 중복 메시지 표시 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed `/usage` command progress bars to fill up as usage increases (instead of showing remaining percentage)","translated":"`/usage` 명령의 진행 막대가 사용량 증가에 따라 채워지도록 수정 (남은 백분율 표시 대신)"},{"category":"fixed","scope":null,"original":"Fixed image pasting not working on Linux systems running Wayland (now falls back to wl-paste when xclip is unavailable)","translated":"Wayland를 실행하는 Linux 시스템에서 이미지 붙여넣기가 작동하지 않는 문제 수정 (이제 xclip이 없을 경우 wl-paste로 대체)"},{"category":"other","scope":null,"original":"Permit some uses of `$!` in bash commands","translated":"bash 명령에서 `$!`의 일부 사용 허용"}]},{"version":"2.0.51","date":null,"entries":[{"category":"added","scope":null,"original":"Added Opus 4.5! https://www.anthropic.com/news/claude-opus-4-5","translated":"Opus 4.5가 추가되었습니다! https://www.anthropic.com/news/claude-opus-4-5"},{"category":"other","scope":null,"original":"Introducing Claude Code for Desktop: https://claude.com/download","translated":"Claude Code for Desktop을 소개합니다: https://claude.com/download"},{"category":"other","scope":null,"original":"To give you room to try out our new model, we've updated usage limits for Claude Code users. See the Claude Opus 4.5 blog for full details","translated":"새로운 모델을 시도해볼 수 있도록 Claude Code 사용자의 사용 한도를 업데이트했습니다. 자세한 내용은 Claude Opus 4.5 블로그를 참조하세요"},{"category":"other","scope":null,"original":"Pro users can now purchase extra usage for access to Opus 4.5 in Claude Code","translated":"Pro 사용자는 이제 Claude Code에서 Opus 4.5에 대한 추가 사용량을 구매할 수 있습니다"},{"category":"other","scope":null,"original":"Plan Mode now builds more precise plans and executes more thoroughly","translated":"Plan Mode가 이제 더 정밀한 계획을 세우고 더 철저하게 실행합니다"},{"category":"other","scope":null,"original":"Usage limit notifications now easier to understand","translated":"사용 한도 알림이 더 이해하기 쉽게 개선되었습니다"},{"category":"other","scope":null,"original":"Switched `/usage` back to \"% used\"","translated":"`/usage`를 \"% 사용됨\"으로 다시 전환했습니다"},{"category":"fixed","scope":null,"original":"Fixed handling of thinking errors","translated":"사고 오류 처리 문제를 수정했습니다"},{"category":"fixed","scope":null,"original":"Fixed performance regression","translated":"성능 저하 문제를 수정했습니다"}]},{"version":"2.0.50","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed bug preventing calling MCP tools that have nested references in their input schemas","translated":"입력 스키마에 중첩된 참조가 있는 MCP 도구 호출을 방해하는 버그 수정"},{"category":"other","scope":null,"original":"Silenced a noisy but harmless error during upgrades","translated":"업그레이드 중 발생하는 시끄럽지만 무해한 오류 무시"},{"category":"improved","scope":null,"original":"Improved ultrathink text display","translated":"울트라싱크 텍스트 디스플레이 개선"},{"category":"improved","scope":null,"original":"Improved clarity of 5-hour session limit warning message","translated":"5시간 세션 제한 경고 메시지의 명확성 개선"}]},{"version":"2.0.49","date":null,"entries":[{"category":"added","scope":null,"original":"Added readline-style ctrl-y for pasting deleted text","translated":"삭제된 텍스트를 붙여넣기 위한 readline 스타일의 ctrl-y 추가"},{"category":"improved","scope":null,"original":"Improved clarity of usage limit warning message","translated":"사용 제한 경고 메시지의 명확성 개선"},{"category":"fixed","scope":null,"original":"Fixed handling of subagent permissions","translated":"하위 에이전트 권한 처리 수정"}]},{"version":"2.0.47","date":null,"entries":[{"category":"improved","scope":null,"original":"Improved error messages and validation for `claude --teleport`","translated":"`claude --teleport`의 오류 메시지 및 유효성 검사가 개선되었습니다."},{"category":"improved","scope":null,"original":"Improved error handling in `/usage`","translated":"`/usage`에서 오류 처리 기능이 개선되었습니다."},{"category":"fixed","scope":null,"original":"Fixed race condition with history entry not getting logged at exit","translated":"종료 시 기록이 남지 않는 히스토리 항목의 경쟁 조건이 수정되었습니다."},{"category":"fixed","scope":null,"original":"Fixed Vertex AI configuration not being applied from `settings.json`","translated":"`settings.json`에서 Vertex AI 설정이 적용되지 않는 문제가 수정되었습니다."}]},{"version":"2.0.46","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed image files being reported with incorrect media type when format cannot be detected from metadata","translated":"메타데이터에서 형식을 감지할 수 없을 때 이미지 파일이 잘못된 미디어 유형으로 보고되는 문제를 수정했습니다."}]},{"version":"2.0.45","date":null,"entries":[{"category":"added","scope":null,"original":"Added support for Microsoft Foundry! See https://code.claude.com/docs/en/azure-ai-foundry","translated":"Microsoft Foundry 지원이 추가되었습니다! 자세한 내용은 https://code.claude.com/docs/en/azure-ai-foundry를 참조하세요."},{"category":"added","scope":null,"original":"Added `PermissionRequest` hook to automatically approve or deny tool permission requests with custom logic","translated":"사용자 정의 로직으로 도구 권한 요청을 자동으로 승인하거나 거부할 수 있는 `PermissionRequest` 훅이 추가되었습니다."},{"category":"other","scope":null,"original":"Send background tasks to Claude Code on the web by starting a message with `&`","translated":"웹에서 `&`로 메시지를 시작하여 Claude Code로 백그라운드 작업을 전송하세요."}]},{"version":"2.0.43","date":null,"entries":[{"category":"added","scope":null,"original":"Added `permissionMode` field for custom agents","translated":"사용자 정의 에이전트를 위한 `permissionMode` 필드 추가"},{"category":"added","scope":null,"original":"Added `tool_use_id` field to `PreToolUseHookInput` and `PostToolUseHookInput` types","translated":"`PreToolUseHookInput` 및 `PostToolUseHookInput` 타입에 `tool_use_id` 필드 추가"},{"category":"added","scope":null,"original":"Added skills frontmatter field to declare skills to auto-load for subagents","translated":"하위 에이전트에 자동 로드할 스킬을 선언하기 위한 skills 프론트매터 필드 추가"},{"category":"added","scope":null,"original":"Added the `SubagentStart` hook event","translated":"`SubagentStart` 훅 이벤트 추가"},{"category":"fixed","scope":null,"original":"Fixed nested `CLAUDE.md` files not loading when @-mentioning files","translated":"@-멘션 파일 시 중첩된 `CLAUDE.md` 파일이 로드되지 않는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed duplicate rendering of some messages in the UI","translated":"UI에서 일부 메시지가 중복 렌더링되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed some visual flickers","translated":"일부 시각적 깜박임 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed NotebookEdit tool inserting cells at incorrect positions when cell IDs matched the pattern `cell-N`","translated":"`cell-N` 패턴과 일치하는 셀 ID가 있을 때 NotebookEdit 도구가 셀을 잘못된 위치에 삽입하는 문제 수정"}]},{"version":"2.0.42","date":null,"entries":[{"category":"added","scope":null,"original":"Added `agent_id` and `agent_transcript_path` fields to `SubagentStop` hooks.","translated":"`SubagentStop` 훅에 `agent_id`와 `agent_transcript_path` 필드를 추가했습니다."}]},{"version":"2.0.41","date":null,"entries":[{"category":"added","scope":null,"original":"Added `model` parameter to prompt-based stop hooks, allowing users to specify a custom model for hook evaluation","translated":"프롬프트 기반 중지 훅에 `model` 매개변수를 추가하여 사용자가 훅 평가를 위한 사용자 지정 모델을 지정할 수 있도록 함"},{"category":"fixed","scope":null,"original":"Fixed slash commands from user settings being loaded twice, which could cause rendering issues","translated":"사용자 설정에서 슬래시 명령이 두 번 로드되는 문제를 수정하여 렌더링 문제를 방지"},{"category":"fixed","scope":null,"original":"Fixed incorrect labeling of user settings vs project settings in command descriptions","translated":"명령 설명에서 사용자 설정과 프로젝트 설정의 잘못된 레이블 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed crash when plugin command hooks timeout during execution","translated":"플러그인 명령 훅이 실행 중 타임아웃될 때 발생하는 충돌 수정"},{"category":"fixed","scope":null,"original":"Fixed: Bedrock users no longer see duplicate Opus entries in the /model picker when using `--model haiku`","translated":"수정: Bedrock 사용자가 `--model haiku`를 사용할 때 /model 선택기에서 중복된 Opus 항목을 더 이상 보지 않음"},{"category":"fixed","scope":null,"original":"Fixed broken security documentation links in trust dialogs and onboarding","translated":"신뢰 대화 상자와 온보딩에서 깨진 보안 문서 링크 수정"},{"category":"fixed","scope":null,"original":"Fixed issue where pressing ESC to close the diff modal would also interrupt the model","translated":"ESC를 눌러 차이 모달을 닫을 때 모델이 중단되는 문제 수정"},{"category":"other","scope":null,"original":"ctrl-r history search landing on a slash command no longer cancels the search","translated":"ctrl-r 히스토리 검색이 슬래시 명령에 도달해도 검색이 취소되지 않음"},{"category":"other","scope":null,"original":"SDK: Support custom timeouts for hooks","translated":"SDK: 훅에 대한 사용자 지정 타임아웃 지원"},{"category":"other","scope":null,"original":"Allow more safe git commands to run without approval","translated":"더 많은 안전한 git 명령을 승인 없이 실행할 수 있도록 허용"},{"category":"other","scope":null,"original":"Plugins: Added support for sharing and installing output styles","translated":"플러그인: 출력 스타일 공유 및 설치 지원 추가"},{"category":"other","scope":null,"original":"Teleporting a session from web will automatically set the upstream branch","translated":"웹에서 세션을 이동하면 자동으로 업스트림 브랜치가 설정됨"}]},{"version":"2.0.37","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed how idleness is computed for notifications","translated":"알림에 대한 유휴 상태 계산 방식 수정"},{"category":"other","scope":null,"original":"Hooks: Added matcher values for Notification hook events","translated":"훅: 알림 훅 이벤트에 대한 매처 값 추가"},{"category":"other","scope":null,"original":"Output Styles: Added `keep-coding-instructions` option to frontmatter","translated":"출력 스타일: frontmatter에 `keep-coding-instructions` 옵션 추가"}]},{"version":"2.0.36","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed: DISABLE_AUTOUPDATER environment variable now properly disables package manager update notifications","translated":"수정됨: `DISABLE_AUTOUPDATER` 환경 변수가 이제 패키지 관리자 업데이트 알림을 제대로 비활성화합니다"},{"category":"fixed","scope":null,"original":"Fixed queued messages being incorrectly executed as bash commands","translated":"대기 중인 메시지가 잘못된 bash 명령어로 실행되는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed input being lost when typing while a queued message is processed","translated":"대기 중인 메시지가 처리되는 동안 입력이 손실되는 문제 수정"}]},{"version":"2.0.35","date":null,"entries":[{"category":"improved","scope":null,"original":"Improve fuzzy search results when searching commands","translated":"명령어 검색 시 퍼지 검색 결과 개선"},{"category":"improved","scope":null,"original":"Improved VS Code extension to respect `chat.fontSize` and `chat.fontFamily` settings throughout the entire UI, and apply font changes immediately without requiring reload","translated":"VS Code 확장이 `chat.fontSize` 및 `chat.fontFamily` 설정을 UI 전반에 걸쳐 반영하고, 폰트 변경 시 재로드 없이 즉시 적용되도록 개선"},{"category":"added","scope":null,"original":"Added `CLAUDE_CODE_EXIT_AFTER_STOP_DELAY` environment variable to automatically exit SDK mode after a specified idle duration, useful for automated workflows and scripts","translated":"지정된 유휴 시간이 지나면 SDK 모드를 자동으로 종료하는 `CLAUDE_CODE_EXIT_AFTER_STOP_DELAY` 환경 변수를 추가하여 자동화된 워크플로우 및 스크립트에 유용"},{"category":"other","scope":null,"original":"Migrated `ignorePatterns` from project config to deny permissions in the localSettings.","translated":"프로젝트 설정에서 `ignorePatterns`를 로컬 설정의 권한 거부로 마이그레이션"},{"category":"fixed","scope":null,"original":"Fixed menu navigation getting stuck on items with empty string or other falsy values (e.g., in the `/hooks` menu)","translated":"메뉴 탐색이 빈 문자열이나 기타 거짓 값이 있는 항목에서 멈추는 문제 수정 (예: `/hooks` 메뉴에서)"}]},{"version":"2.0.34","date":null,"entries":[{"category":"other","scope":null,"original":"VSCode Extension: Added setting to configure the initial permission mode for new conversations","translated":"VSCode 확장: 새로운 대화에 대한 초기 권한 모드를 설정하는 기능 추가"},{"category":"improved","scope":null,"original":"Improved file path suggestion performance with native Rust-based fuzzy finder","translated":"네이티브 Rust 기반 퍼지 파인더로 파일 경로 제안 성능 개선"},{"category":"fixed","scope":null,"original":"Fixed infinite token refresh loop that caused MCP servers with OAuth (e.g., Slack) to hang during connection","translated":"OAuth를 사용하는 MCP 서버(예: Slack) 연결 시 무한 토큰 갱신 루프로 인해 서버가 멈추는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed memory crash when reading or writing large files (especially base64-encoded images)","translated":"큰 파일(특히 base64로 인코딩된 이미지)을 읽거나 쓸 때 발생하는 메모리 충돌 수정"}]},{"version":"2.0.33","date":null,"entries":[{"category":"other","scope":null,"original":"Native binary installs now launch quicker.","translated":"네이티브 바이너리 설치가 이제 더 빠르게 실행됩니다."},{"category":"fixed","scope":null,"original":"Fixed `claude doctor` incorrectly detecting Homebrew vs npm-global installations by properly resolving symlinks","translated":"`claude doctor`가 심볼릭 링크를 올바르게 해석하여 Homebrew와 npm-global 설치를 잘못 감지하던 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed `claude mcp serve` exposing tools with incompatible outputSchemas","translated":"`claude mcp serve`가 호환되지 않는 outputSchemas를 가진 도구를 노출하던 문제를 수정했습니다."}]},{"version":"2.0.32","date":null,"entries":[{"category":"other","scope":null,"original":"Un-deprecate output styles based on community feedback","translated":"커뮤니티 피드백을 바탕으로 출력 스타일의 사용 중단을 해제"},{"category":"added","scope":null,"original":"Added `companyAnnouncements` setting for displaying announcements on startup","translated":"시작 시 공지를 표시하기 위한 `companyAnnouncements` 설정 추가"},{"category":"fixed","scope":null,"original":"Fixed hook progress messages not updating correctly during PostToolUse hook execution","translated":"PostToolUse 훅 실행 중 훅 진행 메시지가 올바르게 업데이트되지 않는 문제 수정"}]},{"version":"2.0.31","date":null,"entries":[{"category":"other","scope":null,"original":"Windows: native installation uses shift+tab as shortcut for mode switching, instead of alt+m","translated":"Windows: 기본 설치 시 모드 전환 단축키로 alt+m 대신 shift+tab 사용"},{"category":"other","scope":null,"original":"Vertex: add support for Web Search on supported models","translated":"Vertex: 지원되는 모델에서 웹 검색 지원 추가"},{"category":"other","scope":null,"original":"VSCode: Adding the respectGitIgnore configuration to include .gitignored files in file searches (defaults to true)","translated":"VSCode: 파일 검색 시 .gitignored 파일을 포함하도록 하는 respectGitIgnore 설정 추가 (기본값은 true)"},{"category":"fixed","scope":null,"original":"Fixed a bug with subagents and MCP servers related to \"Tool names must be unique\" error","translated":"\"도구 이름은 고유해야 합니다\" 오류와 관련된 하위 에이전트 및 MCP 서버의 버그 수정"},{"category":"fixed","scope":null,"original":"Fixed issue causing `/compact` to fail with `prompt_too_long` by making it respect existing compact boundaries","translated":"기존 압축 경계를 준수하여 `/compact`가 `prompt_too_long` 오류로 실패하는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed plugin uninstall not removing plugins","translated":"플러그인 제거 시 플러그인이 제거되지 않는 문제 수정"}]},{"version":"2.0.30","date":null,"entries":[{"category":"added","scope":null,"original":"Added helpful hint to run `security unlock-keychain` when encountering API key errors on macOS with locked keychain","translated":"macOS에서 키체인이 잠긴 상태로 API 키 오류가 발생할 때 `security unlock-keychain`을 실행하라는 유용한 힌트를 추가했습니다."},{"category":"added","scope":null,"original":"Added `allowUnsandboxedCommands` sandbox setting to disable the dangerouslyDisableSandbox escape hatch at policy level","translated":"정책 수준에서 dangerouslyDisableSandbox 탈출구를 비활성화할 수 있는 `allowUnsandboxedCommands` 샌드박스 설정을 추가했습니다."},{"category":"added","scope":null,"original":"Added `disallowedTools` field to custom agent definitions for explicit tool blocking","translated":"명시적인 도구 차단을 위한 사용자 정의 에이전트 정의에 `disallowedTools` 필드를 추가했습니다."},{"category":"added","scope":null,"original":"Added prompt-based stop hooks","translated":"프롬프트 기반의 중지 훅을 추가했습니다."},{"category":"other","scope":null,"original":"VSCode: Added respectGitIgnore configuration to include .gitignored files in file searches (defaults to true)","translated":"VSCode: 파일 검색에 .gitignored 파일을 포함하도록 하는 respectGitIgnore 설정을 추가했습니다 (기본값은 true)."},{"category":"other","scope":null,"original":"Enabled SSE MCP servers on native build","translated":"네이티브 빌드에서 SSE MCP 서버를 활성화했습니다."},{"category":"removed","scope":null,"original":"Deprecated output styles. Review options in `/output-style` and use --system-prompt-file, --system-prompt, --append-system-prompt, CLAUDE.md, or plugins instead","translated":"출력 스타일이 더 이상 지원되지 않습니다. `/output-style`의 옵션을 검토하고 --system-prompt-file, --system-prompt, --append-system-prompt, CLAUDE.md 또는 플러그인을 대신 사용하세요."},{"category":"removed","scope":null,"original":"Removed support for custom ripgrep configuration, resolving an issue where Search returns no results and config discovery fails","translated":"검색 결과가 없고 구성 검색이 실패하는 문제를 해결하기 위해 사용자 정의 ripgrep 구성을 지원하지 않습니다."},{"category":"fixed","scope":null,"original":"Fixed Explore agent creating unwanted .md investigation files during codebase exploration","translated":"코드베이스 탐색 중 원치 않는 .md 조사 파일이 생성되는 Explore 에이전트 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed a bug where `/context` would sometimes fail with \"max_tokens must be greater than thinking.budget_tokens\" error message","translated":"`/context`가 때때로 \"max_tokens는 thinking.budget_tokens보다 커야 합니다\"라는 오류 메시지와 함께 실패하는 버그를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed `--mcp-config` flag to correctly override file-based MCP configurations","translated":"`--mcp-config` 플래그가 파일 기반 MCP 구성을 올바르게 재정의하도록 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed bug that saved session permissions to local settings","translated":"세션 권한이 로컬 설정에 저장되는 버그를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed MCP tools not being available to sub-agents","translated":"MCP 도구가 하위 에이전트에서 사용할 수 없는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed hooks and plugins not executing when using --dangerously-skip-permissions flag","translated":"--dangerously-skip-permissions 플래그를 사용할 때 훅과 플러그인이 실행되지 않는 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed delay when navigating through typeahead suggestions with arrow keys","translated":"화살표 키로 타입어헤드 제안을 탐색할 때 지연되는 문제를 수정했습니다."},{"category":"other","scope":null,"original":"VSCode: Restored selection indicator in input footer showing current file or code selection status","translated":"VSCode: 현재 파일 또는 코드 선택 상태를 표시하는 입력 하단의 선택 표시기를 복원했습니다."}]},{"version":"2.0.28","date":null,"entries":[{"category":"other","scope":null,"original":"Plan mode: introduced new Plan subagent","translated":"계획 모드: 새로운 Plan 하위 에이전트 도입"},{"category":"other","scope":null,"original":"Subagents: claude can now choose to resume subagents","translated":"하위 에이전트: claude가 하위 에이전트를 재개할 수 있게 됨"},{"category":"other","scope":null,"original":"Subagents: claude can dynamically choose the model used by its subagents","translated":"하위 에이전트: claude가 하위 에이전트에서 사용할 모델을 동적으로 선택할 수 있게 됨"},{"category":"other","scope":null,"original":"SDK: added --max-budget-usd flag","translated":"SDK: --max-budget-usd 플래그 추가"},{"category":"other","scope":null,"original":"Discovery of custom slash commands, subagents, and output styles no longer respects .gitignore","translated":"사용자 정의 슬래시 명령어, 하위 에이전트, 출력 스타일의 발견이 더 이상 .gitignore를 따르지 않음"},{"category":"other","scope":null,"original":"Stop `/terminal-setup` from adding backslash to `Shift + Enter` in VS Code","translated":"VS Code에서 `/terminal-setup`이 `Shift + Enter`에 백슬래시를 추가하지 않도록 수정"},{"category":"added","scope":null,"original":"Add branch and tag support for git-based plugins and marketplaces using fragment syntax (e.g., `owner/repo#branch`)","translated":"조각 구문을 사용하여 git 기반 플러그인 및 마켓플레이스에 대한 브랜치 및 태그 지원 추가 (예: `owner/repo#branch`)"},{"category":"fixed","scope":null,"original":"Fixed a bug where macOS permission prompts would show up upon initial launch when launching from home directory","translated":"홈 디렉토리에서 실행할 때 초기 실행 시 macOS 권한 요청이 나타나는 버그 수정"},{"category":"other","scope":null,"original":"Various other bug fixes","translated":"기타 여러 버그 수정"}]},{"version":"2.0.27","date":null,"entries":[{"category":"other","scope":null,"original":"New UI for permission prompts","translated":"권한 요청을 위한 새로운 UI"},{"category":"added","scope":null,"original":"Added current branch filtering and search to session resume screen for easier navigation","translated":"세션 재개 화면에 현재 브랜치 필터링 및 검색 기능 추가로 탐색 용이"},{"category":"fixed","scope":null,"original":"Fixed directory @-mention causing \"No assistant message found\" error","translated":"디렉토리 @-멘션으로 인한 \"도우미 메시지를 찾을 수 없음\" 오류 수정"},{"category":"other","scope":null,"original":"VSCode Extension: Add config setting to include .gitignored files in file searches","translated":"VSCode 확장: 파일 검색에 `.gitignored` 파일을 포함할 수 있는 설정 추가"},{"category":"other","scope":null,"original":"VSCode Extension: Bug fixes for unrelated 'Warmup' conversations, and configuration/settings occasionally being reset to defaults","translated":"VSCode 확장: 관련 없는 'Warmup' 대화 및 설정/구성이 가끔 기본값으로 재설정되는 버그 수정"}]},{"version":"2.0.25","date":null,"entries":[{"category":"removed","scope":null,"original":"Removed legacy SDK entrypoint. Please migrate to @anthropic-ai/claude-agent-sdk for future SDK updates: https://platform.claude.com/docs/en/agent-sdk/migration-guide","translated":"레거시 SDK 진입점을 제거했습니다. 향후 SDK 업데이트를 위해 @anthropic-ai/claude-agent-sdk로 마이그레이션해 주세요: https://platform.claude.com/docs/en/agent-sdk/migration-guide"}]},{"version":"2.0.24","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed a bug where project-level skills were not loading when --setting-sources 'project' was specified","translated":"--setting-sources 'project'가 지정되었을 때 프로젝트 수준의 기술이 로드되지 않는 버그를 수정했습니다."},{"category":"other","scope":null,"original":"Claude Code Web: Support for Web -> CLI teleport","translated":"Claude Code Web: 웹에서 CLI로의 텔레포트 지원"},{"category":"other","scope":null,"original":"Sandbox: Releasing a sandbox mode for the BashTool on Linux & Mac","translated":"Sandbox: Linux 및 Mac에서 BashTool을 위한 샌드박스 모드 출시"},{"category":"other","scope":null,"original":"Bedrock: Display awsAuthRefresh output when auth is required","translated":"Bedrock: 인증이 필요할 때 awsAuthRefresh 출력을 표시합니다."}]},{"version":"2.0.22","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed content layout shift when scrolling through slash commands","translated":"슬래시 명령어를 스크롤할 때 콘텐츠 레이아웃 이동 문제 수정"},{"category":"other","scope":null,"original":"IDE: Add toggle to enable/disable thinking.","translated":"IDE: 사고 모드를 활성화/비활성화할 수 있는 토글 추가"},{"category":"fixed","scope":null,"original":"Fix bug causing duplicate permission prompts with parallel tool calls","translated":"병렬 도구 호출 시 중복 권한 요청을 유발하는 버그 수정"},{"category":"added","scope":null,"original":"Add support for enterprise managed MCP allowlist and denylist","translated":"기업 관리 MCP 허용 목록 및 차단 목록 지원 추가"}]},{"version":"2.0.21","date":null,"entries":[{"category":"other","scope":null,"original":"Support MCP `structuredContent` field in tool responses","translated":"도구 응답에서 MCP `structuredContent` 필드 지원"},{"category":"added","scope":null,"original":"Added an interactive question tool","translated":"대화형 질문 도구 추가"},{"category":"other","scope":null,"original":"Claude will now ask you questions more often in plan mode","translated":"계획 모드에서 Claude가 더 자주 질문을 합니다"},{"category":"added","scope":null,"original":"Added Haiku 4.5 as a model option for Pro users","translated":"Pro 사용자에게 Haiku 4.5 모델 옵션 추가"},{"category":"fixed","scope":null,"original":"Fixed an issue where queued commands don't have access to previous messages' output","translated":"대기 중인 명령이 이전 메시지의 출력에 접근할 수 없는 문제 수정"}]},{"version":"2.0.20","date":null,"entries":[{"category":"added","scope":null,"original":"Added support for Claude Skills","translated":"Claude Skills 지원 추가"}]},{"version":"2.0.19","date":null,"entries":[{"category":"other","scope":null,"original":"Auto-background long-running bash commands instead of killing them. Customize with BASH_DEFAULT_TIMEOUT_MS","translated":"종료하지 않고 자동으로 백그라운드에서 실행되는 장시간의 bash 명령어. BASH_DEFAULT_TIMEOUT_MS로 사용자 지정 가능"},{"category":"fixed","scope":null,"original":"Fixed a bug where Haiku was unnecessarily called in print mode","translated":"인쇄 모드에서 불필요하게 Haiku가 호출되는 버그 수정"}]},{"version":"2.0.17","date":null,"entries":[{"category":"added","scope":null,"original":"Added Haiku 4.5 to model selector!","translated":"모델 선택기에 Haiku 4.5가 추가되었습니다!"},{"category":"other","scope":null,"original":"Haiku 4.5 automatically uses Sonnet in plan mode, and Haiku for execution (i.e. SonnetPlan by default)","translated":"Haiku 4.5는 계획 모드에서 자동으로 Sonnet을 사용하고, 실행 시 Haiku를 사용합니다 (기본적으로 SonnetPlan)."},{"category":"other","scope":null,"original":"3P (Bedrock and Vertex) are not automatically upgraded yet. Manual upgrading can be done through setting `ANTHROPIC_DEFAULT_HAIKU_MODEL`","translated":"3P (Bedrock 및 Vertex)는 아직 자동으로 업그레이드되지 않습니다. 수동 업그레이드는 `ANTHROPIC_DEFAULT_HAIKU_MODEL` 설정을 통해 가능합니다."},{"category":"other","scope":null,"original":"Introducing the Explore subagent. Powered by Haiku it'll search through your codebase efficiently to save context!","translated":"Explore 하위 에이전트를 소개합니다. Haiku로 구동되어 코드베이스를 효율적으로 검색하여 컨텍스트를 절약합니다!"},{"category":"other","scope":null,"original":"OTEL: support HTTP_PROXY and HTTPS_PROXY","translated":"OTEL: HTTP_PROXY 및 HTTPS_PROXY 지원"},{"category":"other","scope":null,"original":"`CLAUDE_CODE_DISABLE_NONESSENTIAL_TRAFFIC` now disables release notes fetching","translated":"`CLAUDE_CODE_DISABLE_NONESSENTIAL_TRAFFIC`가 이제 릴리스 노트 가져오기를 비활성화합니다."}]},{"version":"2.0.15","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed bug with resuming where previously created files needed to be read again before writing","translated":"이전에 생성된 파일을 다시 읽어야만 쓰기가 가능한 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed bug with `-p` mode where @-mentioned files needed to be read again before writing","translated":"`-p` 모드에서 @로 언급된 파일을 다시 읽어야만 쓰기가 가능한 문제를 수정했습니다."}]},{"version":"2.0.14","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fix @-mentioning MCP servers to toggle them on/off","translated":"MCP 서버의 @-멘션 기능을 수정하여 켜기/끄기 가능하도록 함"},{"category":"improved","scope":null,"original":"Improve permission checks for bash with inline env vars","translated":"인라인 환경 변수를 사용하는 bash의 권한 확인 개선"},{"category":"fixed","scope":null,"original":"Fix ultrathink + thinking toggle","translated":"ultrathink + thinking 토글 수정"},{"category":"other","scope":null,"original":"Reduce unnecessary logins","translated":"불필요한 로그인 감소"},{"category":"other","scope":null,"original":"Document --system-prompt","translated":"--system-prompt 문서화"},{"category":"other","scope":null,"original":"Several improvements to rendering","translated":"렌더링 관련 여러 개선 사항"},{"category":"other","scope":null,"original":"Plugins UI polish","translated":"플러그인 UI 개선"}]},{"version":"2.0.13","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed `/plugin` not working on native build","translated":"네이티브 빌드에서 `/plugin`이 작동하지 않는 문제 수정"}]},{"version":"2.0.12","date":null,"entries":[{"category":"other","scope":null,"original":"**Plugin System Released**: Extend Claude Code with custom commands, agents, hooks, and MCP servers from marketplaces","translated":"**플러그인 시스템 출시**: 마켓플레이스에서 사용자 정의 명령어, 에이전트, 훅, MCP 서버로 Claude Code 확장"},{"category":"other","scope":null,"original":"`/plugin install`, `/plugin enable/disable`, `/plugin marketplace` commands for plugin management","translated":"플러그인 관리를 위한 `/plugin install`, `/plugin enable/disable`, `/plugin marketplace` 명령어"},{"category":"other","scope":null,"original":"Repository-level plugin configuration via `extraKnownMarketplaces` for team collaboration","translated":"팀 협업을 위한 `extraKnownMarketplaces`를 통한 저장소 수준의 플러그인 구성"},{"category":"other","scope":null,"original":"`/plugin validate` command for validating plugin structure and configuration","translated":"플러그인 구조 및 구성을 검증하기 위한 `/plugin validate` 명령어"},{"category":"other","scope":null,"original":"Plugin announcement blog post at https://www.anthropic.com/news/claude-code-plugins","translated":"플러그인 발표 블로그 게시물: https://www.anthropic.com/news/claude-code-plugins"},{"category":"other","scope":null,"original":"Plugin documentation available at https://code.claude.com/docs/en/plugins","translated":"플러그인 문서: https://code.claude.com/docs/en/plugins"},{"category":"other","scope":null,"original":"Comprehensive error messages and diagnostics via `/doctor` command","translated":"`/doctor` 명령어를 통한 포괄적인 오류 메시지 및 진단"},{"category":"other","scope":null,"original":"Avoid flickering in `/model` selector","translated":"`/model` 선택기에서 깜박임 방지"},{"category":"other","scope":null,"original":"Improvements to `/help`","translated":"`/help` 개선"},{"category":"other","scope":null,"original":"Avoid mentioning hooks in `/resume` summaries","translated":"`/resume` 요약에서 훅 언급 방지"},{"category":"other","scope":null,"original":"Changes to the \"verbose\" setting in `/config` now persist across sessions","translated":"`/config`의 \"verbose\" 설정 변경이 세션 간에 지속됨"}]},{"version":"2.0.11","date":null,"entries":[{"category":"other","scope":null,"original":"Reduced system prompt size by 1.4k tokens","translated":"시스템 프롬프트 크기를 1.4k 토큰 줄였습니다."},{"category":"other","scope":null,"original":"IDE: Fixed keyboard shortcuts and focus issues for smoother interaction","translated":"IDE: 키보드 단축키 및 포커스 문제를 수정하여 더 원활한 상호작용 제공"},{"category":"fixed","scope":null,"original":"Fixed Opus fallback rate limit errors appearing incorrectly","translated":"Opus 대체 속도 제한 오류가 잘못 나타나는 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed /add-dir command selecting wrong default tab","translated":"/add-dir 명령어가 잘못된 기본 탭을 선택하는 문제 수정"}]},{"version":"2.0.10","date":null,"entries":[{"category":"other","scope":null,"original":"Rewrote terminal renderer for buttery smooth UI","translated":"부드러운 UI를 위해 터미널 렌더러를 새로 작성했습니다"},{"category":"other","scope":null,"original":"Enable/disable MCP servers by @mentioning, or in /mcp","translated":"@언급하거나 /mcp에서 MCP 서버를 활성화/비활성화할 수 있습니다"},{"category":"added","scope":null,"original":"Added tab completion for shell commands in bash mode","translated":"bash 모드에서 셸 명령어에 대한 탭 완성 기능을 추가했습니다"},{"category":"other","scope":null,"original":"PreToolUse hooks can now modify tool inputs","translated":"PreToolUse 훅이 이제 도구 입력을 수정할 수 있습니다"},{"category":"other","scope":null,"original":"Press Ctrl-G to edit your prompt in your system's configured text editor","translated":"Ctrl-G를 눌러 시스템에 설정된 텍스트 편집기에서 프롬프트를 편집하세요"},{"category":"other","scope":null,"original":"Fixes for bash permission checks with environment variables in the command","translated":"명령어의 환경 변수와 관련된 bash 권한 검사 문제를 수정했습니다"}]},{"version":"2.0.9","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fix regression where bash backgrounding stopped working","translated":"bash 백그라운드 실행이 작동하지 않던 회귀 문제 수정"}]},{"version":"2.0.8","date":null,"entries":[{"category":"changed","scope":null,"original":"Update Bedrock default Sonnet model to `global.anthropic.claude-sonnet-4-5-20250929-v1:0`","translated":"Bedrock 기본 Sonnet 모델을 `global.anthropic.claude-sonnet-4-5-20250929-v1:0`으로 업데이트"},{"category":"other","scope":null,"original":"IDE: Add drag-and-drop support for files and folders in chat","translated":"IDE: 채팅에서 파일 및 폴더에 대한 드래그 앤 드롭 지원 추가"},{"category":"other","scope":null,"original":"/context: Fix counting for thinking blocks","translated":"/context: 생각 블록의 개수 계산 수정"},{"category":"improved","scope":null,"original":"Improve message rendering for users with light themes on dark terminals","translated":"어두운 터미널에서 밝은 테마를 사용하는 사용자에 대한 메시지 렌더링 개선"},{"category":"removed","scope":null,"original":"Remove deprecated .claude.json allowedTools, ignorePatterns, env, and todoFeatureEnabled config options (instead, configure these in your settings.json)","translated":"더 이상 사용되지 않는 .claude.json의 allowedTools, ignorePatterns, env, todoFeatureEnabled 구성 옵션 제거 (대신 settings.json에서 구성하세요)"}]},{"version":"2.0.5","date":null,"entries":[{"category":"other","scope":null,"original":"IDE: Fix IME unintended message submission with Enter and Tab","translated":"IDE: IME에서 Enter 및 Tab 키로 인한 의도치 않은 메시지 전송 문제 수정"},{"category":"other","scope":null,"original":"IDE: Add \"Open in Terminal\" link in login screen","translated":"IDE: 로그인 화면에 \"터미널에서 열기\" 링크 추가"},{"category":"fixed","scope":null,"original":"Fix unhandled OAuth expiration 401 API errors","translated":"처리되지 않은 OAuth 만료 401 API 오류 수정"},{"category":"other","scope":null,"original":"SDK: Added SDKUserMessageReplay.isReplay to prevent duplicate messages","translated":"SDK: 중복 메시지를 방지하기 위해 `SDKUserMessageReplay.isReplay` 추가"}]},{"version":"2.0.1","date":null,"entries":[{"category":"other","scope":null,"original":"Skip Sonnet 4.5 default model setting change for Bedrock and Vertex","translated":"Bedrock 및 Vertex에 대한 Sonnet 4.5 기본 모델 설정 변경 건너뛰기"},{"category":"other","scope":null,"original":"Various bug fixes and presentation improvements","translated":"다양한 버그 수정 및 프레젠테이션 개선"}]},{"version":"2.0.0","date":null,"entries":[{"category":"other","scope":null,"original":"New native VS Code extension","translated":"새로운 네이티브 VS Code 확장 프로그램"},{"category":"other","scope":null,"original":"Fresh coat of paint throughout the whole app","translated":"전체 앱에 새로운 디자인 적용"},{"category":"other","scope":null,"original":"/rewind a conversation to undo code changes","translated":"/rewind 명령어로 대화 되감기하여 코드 변경 취소"},{"category":"other","scope":null,"original":"/usage command to see plan limits","translated":"/usage 명령어로 플랜 제한 확인"},{"category":"other","scope":null,"original":"Tab to toggle thinking (sticky across sessions)","translated":"탭으로 생각 전환 (세션 간 고정)"},{"category":"other","scope":null,"original":"Ctrl-R to search history","translated":"Ctrl-R로 기록 검색"},{"category":"other","scope":null,"original":"Unshipped claude config command","translated":"미출시된 claude 설정 명령어"},{"category":"other","scope":null,"original":"Hooks: Reduced PostToolUse 'tool_use' ids were found without 'tool_result' blocks errors","translated":"훅: 'tool_result' 블록 오류 없이 'tool_use' ID가 발견된 PostToolUse 감소"},{"category":"other","scope":null,"original":"SDK: The Claude Code SDK is now the Claude Agent SDK","translated":"SDK: Claude Code SDK가 이제 Claude Agent SDK로 변경"},{"category":"added","scope":null,"original":"Add subagents dynamically with `--agents` flag","translated":"`--agents` 플래그로 하위 에이전트를 동적으로 추가"}]},{"version":"1.0.126","date":null,"entries":[{"category":"other","scope":null,"original":"Enable /context command for Bedrock and Vertex","translated":"Bedrock 및 Vertex에 대해 /context 명령어 활성화"},{"category":"added","scope":null,"original":"Add mTLS support for HTTP-based OpenTelemetry exporters","translated":"HTTP 기반 OpenTelemetry 내보내기에 mTLS 지원 추가"}]},{"version":"1.0.124","date":null,"entries":[{"category":"other","scope":null,"original":"Set `CLAUDE_BASH_NO_LOGIN` environment variable to 1 or true to to skip login shell for BashTool","translated":"BashTool의 로그인 셸을 건너뛰기 위해 `CLAUDE_BASH_NO_LOGIN` 환경 변수를 1 또는 true로 설정"},{"category":"fixed","scope":null,"original":"Fix Bedrock and Vertex environment variables evaluating all strings as truthy","translated":"Bedrock 및 Vertex 환경 변수에서 모든 문자열을 참으로 평가하는 문제 수정"},{"category":"other","scope":null,"original":"No longer inform Claude of the list of allowed tools when permission is denied","translated":"권한이 거부될 때 허용된 도구 목록을 Claude에게 더 이상 알리지 않음"},{"category":"fixed","scope":null,"original":"Fixed security vulnerability in Bash tool permission checks","translated":"Bash 도구 권한 검사에서 보안 취약점 수정"},{"category":"improved","scope":null,"original":"Improved VSCode extension performance for large files","translated":"대용량 파일에 대한 VSCode 확장 성능 개선"}]},{"version":"1.0.123","date":null,"entries":[{"category":"other","scope":null,"original":"Bash permission rules now support output redirections when matching (e.g., `Bash(python:*)` matches `python script.py > output.txt`)","translated":"Bash 권한 규칙이 이제 매칭 시 출력 리디렉션을 지원합니다 (예: `Bash(python:*)`는 `python script.py > output.txt`와 매칭됩니다)"},{"category":"fixed","scope":null,"original":"Fixed thinking mode triggering on negation phrases like \"don't think\"","translated":"\"생각하지 마\"와 같은 부정 구문에서 발생하던 사고 모드 트리거 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed rendering performance degradation during token streaming","translated":"토큰 스트리밍 중 렌더링 성능 저하 문제 수정"},{"category":"added","scope":null,"original":"Added SlashCommand tool, which enables Claude to invoke your slash commands. https://code.claude.com/docs/en/slash-commands#SlashCommand-tool","translated":"SlashCommand 도구 추가, 이를 통해 Claude가 슬래시 명령어를 호출할 수 있습니다. https://code.claude.com/docs/en/slash-commands#SlashCommand-tool"},{"category":"improved","scope":null,"original":"Enhanced BashTool environment snapshot logging","translated":"BashTool 환경 스냅샷 로깅 강화"},{"category":"fixed","scope":null,"original":"Fixed a bug where resuming a conversation in headless mode would sometimes enable thinking unnecessarily","translated":"헤드리스 모드에서 대화를 재개할 때 불필요하게 사고 모드가 활성화되는 버그 수정"},{"category":"other","scope":null,"original":"Migrated --debug logging to a file, to enable easy tailing & filtering","translated":"--debug 로깅을 파일로 마이그레이션하여 쉬운 tailing 및 필터링 가능"}]},{"version":"1.0.120","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fix input lag during typing, especially noticeable with large prompts","translated":"입력 지연 현상 수정, 특히 큰 프롬프트에서 두드러짐"},{"category":"improved","scope":null,"original":"Improved VSCode extension command registry and sessions dialog user experience","translated":"VSCode 확장 명령 레지스트리와 세션 대화 상자의 사용자 경험 개선"},{"category":"improved","scope":null,"original":"Enhanced sessions dialog responsiveness and visual feedback","translated":"세션 대화 상자의 반응성과 시각적 피드백 강화"},{"category":"fixed","scope":null,"original":"Fixed IDE compatibility issue by removing worktree support check","translated":"작업 트리 지원 확인을 제거하여 IDE 호환성 문제 수정"},{"category":"fixed","scope":null,"original":"Fixed security vulnerability where Bash tool permission checks could be bypassed using prefix matching","translated":"접두사 매칭을 사용하여 Bash 도구 권한 확인을 우회할 수 있는 보안 취약점 수정"}]},{"version":"1.0.119","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fix Windows issue where process visually freezes on entering interactive mode","translated":"Windows에서 대화형 모드로 진입 시 프로세스가 시각적으로 멈추는 문제 수정"},{"category":"other","scope":null,"original":"Support dynamic headers for MCP servers via headersHelper configuration","translated":"`headersHelper` 설정을 통해 MCP 서버의 동적 헤더 지원"},{"category":"fixed","scope":null,"original":"Fix thinking mode not working in headless sessions","translated":"헤드리스 세션에서 작동하지 않던 사고 모드 수정"},{"category":"fixed","scope":null,"original":"Fix slash commands now properly update allowed tools instead of replacing them","translated":"슬래시 명령어가 이제 도구를 대체하는 대신 허용된 도구를 올바르게 업데이트하도록 수정"}]},{"version":"1.0.117","date":null,"entries":[{"category":"added","scope":null,"original":"Add Ctrl-R history search to recall previous commands like bash/zsh","translated":"bash/zsh처럼 이전 명령어를 불러올 수 있는 Ctrl-R 히스토리 검색 추가"},{"category":"fixed","scope":null,"original":"Fix input lag while typing, especially on Windows","translated":"특히 Windows에서 입력 지연 문제 수정"},{"category":"added","scope":null,"original":"Add sed command to auto-allowed commands in acceptEdits mode","translated":"acceptEdits 모드에서 자동 허용 명령어에 sed 명령어 추가"},{"category":"fixed","scope":null,"original":"Fix Windows PATH comparison to be case-insensitive for drive letters","translated":"드라이브 문자의 대소문자를 구분하지 않도록 Windows PATH 비교 수정"},{"category":"added","scope":null,"original":"Add permissions management hint to /add-dir output","translated":"/add-dir 출력에 권한 관리 힌트 추가"}]},{"version":"1.0.115","date":null,"entries":[{"category":"improved","scope":null,"original":"Improve thinking mode display with enhanced visual effects","translated":"향상된 시각 효과로 사고 모드 표시 개선"},{"category":"other","scope":null,"original":"Type /t to temporarily disable thinking mode in your prompt","translated":"프롬프트에서 사고 모드를 일시적으로 비활성화하려면 /t 입력"},{"category":"improved","scope":null,"original":"Improve path validation for glob and grep tools","translated":"glob 및 grep 도구에 대한 경로 유효성 검사 개선"},{"category":"other","scope":null,"original":"Show condensed output for post-tool hooks to reduce visual clutter","translated":"시각적 혼란을 줄이기 위해 포스트 도구 훅에 대한 간결한 출력 표시"},{"category":"fixed","scope":null,"original":"Fix visual feedback when loading state completes","translated":"로딩 상태 완료 시 시각적 피드백 수정"},{"category":"improved","scope":null,"original":"Improve UI consistency for permission request dialogs","translated":"권한 요청 대화 상자의 UI 일관성 개선"}]},{"version":"1.0.113","date":null,"entries":[{"category":"removed","scope":null,"original":"Deprecated piped input in interactive mode","translated":"대화형 모드에서 파이프 입력 사용 중단"},{"category":"other","scope":null,"original":"Move Ctrl+R keybinding for toggling transcript to Ctrl+O","translated":"대본 전환을 위한 Ctrl+R 키 바인딩을 Ctrl+O로 이동"}]},{"version":"1.0.112","date":null,"entries":[{"category":"other","scope":null,"original":"Transcript mode (Ctrl+R): Added the model used to generate each assistant message","translated":"대화 모드(Ctrl+R): 각 어시스턴트 메시지를 생성하는 모델 추가"},{"category":"other","scope":null,"original":"Addressed issue where some Claude Max users were incorrectly recognized as Claude Pro users","translated":"일부 Claude Max 사용자가 Claude Pro 사용자로 잘못 인식되는 문제 해결"},{"category":"other","scope":null,"original":"Hooks: Added systemMessage support for SessionEnd hooks","translated":"훅: SessionEnd 훅에 systemMessage 지원 추가"},{"category":"added","scope":null,"original":"Added `spinnerTipsEnabled` setting to disable spinner tips","translated":"`spinnerTipsEnabled` 설정 추가하여 스피너 팁 비활성화"},{"category":"other","scope":null,"original":"IDE: Various improvements and bug fixes","translated":"IDE: 다양한 개선 및 버그 수정"}]},{"version":"1.0.111","date":null,"entries":[{"category":"other","scope":null,"original":"/model now validates provided model names","translated":"/model이 이제 제공된 모델 이름을 검증합니다"},{"category":"fixed","scope":null,"original":"Fixed Bash tool crashes caused by malformed shell syntax parsing","translated":"잘못된 셸 구문 분석으로 인한 Bash 도구 충돌 수정"}]},{"version":"1.0.110","date":null,"entries":[{"category":"other","scope":null,"original":"/terminal-setup command now supports WezTerm","translated":"/terminal-setup 명령어가 이제 WezTerm을 지원합니다"},{"category":"other","scope":null,"original":"MCP: OAuth tokens now proactively refresh before expiration","translated":"MCP: OAuth 토큰이 만료 전에 사전 갱신됩니다"},{"category":"fixed","scope":null,"original":"Fixed reliability issues with background Bash processes","translated":"백그라운드 Bash 프로세스의 신뢰성 문제를 수정했습니다"}]},{"version":"1.0.109","date":null,"entries":[{"category":"other","scope":null,"original":"SDK: Added partial message streaming support via `--include-partial-messages` CLI flag","translated":"SDK: `--include-partial-messages` CLI 플래그를 통해 부분 메시지 스트리밍 지원 추가"}]},{"version":"1.0.106","date":null,"entries":[{"category":"other","scope":null,"original":"Windows: Fixed path permission matching to consistently use POSIX format (e.g., `Read(//c/Users/...)`)","translated":"Windows: 경로 권한 매칭을 POSIX 형식(예: `Read(//c/Users/...)`)을 일관되게 사용하도록 수정했습니다."}]},{"version":"1.0.97","date":null,"entries":[{"category":"other","scope":null,"original":"Settings: /doctor now validates permission rule syntax and suggests corrections","translated":"설정: /doctor가 이제 권한 규칙 구문을 검증하고 수정 사항을 제안합니다."}]},{"version":"1.0.94","date":null,"entries":[{"category":"other","scope":null,"original":"Vertex: add support for global endpoints for supported models","translated":"Vertex: 지원되는 모델에 대한 글로벌 엔드포인트 지원 추가"},{"category":"other","scope":null,"original":"/memory command now allows direct editing of all imported memory files","translated":"이제 /memory 명령어로 가져온 모든 메모리 파일을 직접 편집할 수 있습니다"},{"category":"other","scope":null,"original":"SDK: Add custom tools as callbacks","translated":"SDK: 콜백으로 사용자 정의 도구 추가"},{"category":"added","scope":null,"original":"Added /todos command to list current todo items","translated":"현재 할 일 항목을 나열하는 /todos 명령어 추가"}]},{"version":"1.0.93","date":null,"entries":[{"category":"other","scope":null,"original":"Windows: Add alt + v shortcut for pasting images from clipboard","translated":"Windows: 클립보드에서 이미지를 붙여넣기 위한 alt + v 단축키 추가"},{"category":"other","scope":null,"original":"Support NO_PROXY environment variable to bypass proxy for specified hostnames and IPs","translated":"특정 호스트명 및 IP에 대해 프록시를 우회하기 위한 NO_PROXY 환경 변수 지원"}]},{"version":"1.0.90","date":null,"entries":[{"category":"other","scope":null,"original":"Settings file changes take effect immediately - no restart required","translated":"설정 파일 변경 사항이 즉시 적용됩니다 - 재시작이 필요 없습니다."}]},{"version":"1.0.88","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed issue causing \"OAuth authentication is currently not supported\"","translated":"\"OAuth 인증은 현재 지원되지 않습니다\"라는 문제를 수정했습니다."},{"category":"other","scope":null,"original":"Status line input now includes `exceeds_200k_tokens`","translated":"상태 줄 입력에 `exceeds_200k_tokens`가 포함되었습니다."},{"category":"fixed","scope":null,"original":"Fixed incorrect usage tracking in /cost.","translated":"/cost에서 잘못된 사용 추적을 수정했습니다."},{"category":"other","scope":null,"original":"Introduced `ANTHROPIC_DEFAULT_SONNET_MODEL` and `ANTHROPIC_DEFAULT_OPUS_MODEL` for controlling model aliases opusplan, opus, and sonnet.","translated":"모델 별칭 opusplan, opus, sonnet을 제어하기 위해 `ANTHROPIC_DEFAULT_SONNET_MODEL` 및 `ANTHROPIC_DEFAULT_OPUS_MODEL`을 도입했습니다."},{"category":"other","scope":null,"original":"Bedrock: Updated default Sonnet model to Sonnet 4","translated":"Bedrock: 기본 Sonnet 모델을 Sonnet 4로 업데이트했습니다."}]},{"version":"1.0.86","date":null,"entries":[{"category":"added","scope":null,"original":"Added /context to help users self-serve debug context issues","translated":"사용자들이 디버그 컨텍스트 문제를 스스로 해결할 수 있도록 /context를 추가했습니다."},{"category":"other","scope":null,"original":"SDK: Added UUID support for all SDK messages","translated":"SDK: 모든 SDK 메시지에 UUID 지원을 추가했습니다."},{"category":"other","scope":null,"original":"SDK: Added `--replay-user-messages` to replay user messages back to stdout","translated":"SDK: 사용자 메시지를 stdout으로 다시 재생할 수 있는 `--replay-user-messages`를 추가했습니다."}]},{"version":"1.0.85","date":null,"entries":[{"category":"other","scope":null,"original":"Status line input now includes session cost info","translated":"상태 줄 입력에 이제 세션 비용 정보가 포함됩니다"},{"category":"other","scope":null,"original":"Hooks: Introduced SessionEnd hook","translated":"훅: SessionEnd 훅이 도입되었습니다"}]},{"version":"1.0.84","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fix tool_use/tool_result id mismatch error when network is unstable","translated":"네트워크가 불안정할 때 발생하는 tool_use/tool_result ID 불일치 오류 수정"},{"category":"fixed","scope":null,"original":"Fix Claude sometimes ignoring real-time steering when wrapping up a task","translated":"Claude가 작업을 마무리할 때 실시간 조정을 무시하는 문제 수정"},{"category":"other","scope":null,"original":"@-mention: Add ~/.claude/\\* files to suggestions for easier agent, output style, and slash command editing","translated":"@-멘션: 에이전트, 출력 스타일 및 슬래시 명령 편집을 쉽게 하기 위해 제안에 ~/.claude/\\* 파일 추가"},{"category":"other","scope":null,"original":"Use built-in ripgrep by default; to opt out of this behavior, set USE_BUILTIN_RIPGREP=0","translated":"기본적으로 내장된 ripgrep 사용; 이 동작을 원하지 않으면 USE_BUILTIN_RIPGREP=0으로 설정"}]},{"version":"1.0.83","date":null,"entries":[{"category":"other","scope":null,"original":"@-mention: Support files with spaces in path","translated":"@-mention: 경로에 공백이 있는 파일 지원"},{"category":"other","scope":null,"original":"New shimmering spinner","translated":"새로운 반짝이는 스피너"}]},{"version":"1.0.82","date":null,"entries":[{"category":"other","scope":null,"original":"SDK: Add request cancellation support","translated":"SDK: 요청 취소 지원 추가"},{"category":"other","scope":null,"original":"SDK: New additionalDirectories option to search custom paths, improved slash command processing","translated":"SDK: 사용자 지정 경로 검색을 위한 새로운 `additionalDirectories` 옵션 추가, 슬래시 명령어 처리 개선"},{"category":"other","scope":null,"original":"Settings: Validation prevents invalid fields in .claude/settings.json files","translated":"설정: .claude/settings.json 파일에서 잘못된 필드를 방지하는 유효성 검사"},{"category":"other","scope":null,"original":"MCP: Improve tool name consistency","translated":"MCP: 도구 이름 일관성 개선"},{"category":"other","scope":null,"original":"Bash: Fix crash when Claude tries to automatically read large files","translated":"Bash: Claude가 자동으로 큰 파일을 읽으려 할 때 발생하는 충돌 수정"}]},{"version":"1.0.81","date":null,"entries":[{"category":"other","scope":null,"original":"Released output styles, including new built-in educational output styles \"Explanatory\" and \"Learning\". Docs: https://code.claude.com/docs/en/output-styles","translated":"새로운 내장 교육 출력 스타일 \"설명\" 및 \"학습\"을 포함한 출력 스타일을 출시했습니다. 문서: https://code.claude.com/docs/en/output-styles"},{"category":"other","scope":null,"original":"Agents: Fix custom agent loading when agent files are unparsable","translated":"에이전트: 에이전트 파일을 구문 분석할 수 없을 때 사용자 정의 에이전트 로딩 문제를 수정했습니다."}]},{"version":"1.0.80","date":null,"entries":[{"category":"other","scope":null,"original":"UI improvements: Fix text contrast for custom subagent colors and spinner rendering issues","translated":"UI 개선: 사용자 지정 하위 에이전트 색상의 텍스트 대비 및 스피너 렌더링 문제 수정"}]},{"version":"1.0.77","date":null,"entries":[{"category":"other","scope":null,"original":"Bash tool: Fix heredoc and multiline string escaping, improve stderr redirection handling","translated":"Bash 도구: heredoc 및 다중 행 문자열 이스케이프 수정, stderr 리다이렉션 처리 개선"},{"category":"other","scope":null,"original":"SDK: Add session support and permission denial tracking","translated":"SDK: 세션 지원 및 권한 거부 추적 추가"},{"category":"fixed","scope":null,"original":"Fix token limit errors in conversation summarization","translated":"대화 요약에서 토큰 제한 오류 수정"},{"category":"other","scope":null,"original":"Opus Plan Mode: New setting in `/model` to run Opus only in plan mode, Sonnet otherwise","translated":"Opus 계획 모드: `/model`에 새로운 설정 추가로 Opus를 계획 모드에서만 실행하고, 그렇지 않으면 Sonnet 실행"}]},{"version":"1.0.73","date":null,"entries":[{"category":"other","scope":null,"original":"MCP: Support multiple config files with `--mcp-config file1.json file2.json`","translated":"MCP: `--mcp-config file1.json file2.json` 옵션으로 여러 구성 파일 지원"},{"category":"other","scope":null,"original":"MCP: Press Esc to cancel OAuth authentication flows","translated":"MCP: Esc 키를 눌러 OAuth 인증 흐름 취소"},{"category":"other","scope":null,"original":"Bash: Improved command validation and reduced false security warnings","translated":"Bash: 명령어 검증 개선 및 잘못된 보안 경고 감소"},{"category":"other","scope":null,"original":"UI: Enhanced spinner animations and status line visual hierarchy","translated":"UI: 스피너 애니메이션과 상태 라인의 시각적 계층 구조 개선"},{"category":"other","scope":null,"original":"Linux: Added support for Alpine and musl-based distributions (requires separate ripgrep installation)","translated":"Linux: Alpine 및 musl 기반 배포판 지원 추가 (별도의 ripgrep 설치 필요)"}]},{"version":"1.0.72","date":null,"entries":[{"category":"other","scope":null,"original":"Ask permissions: have Claude Code always ask for confirmation to use specific tools with /permissions","translated":"권한 요청: Claude Code가 특정 도구를 사용할 때 항상 /permissions로 확인 요청하도록 설정"}]},{"version":"1.0.71","date":null,"entries":[{"category":"other","scope":null,"original":"Background commands: (Ctrl-b) to run any Bash command in the background so Claude can keep working (great for dev servers, tailing logs, etc.)","translated":"백그라운드 명령: (Ctrl-b)를 사용하여 Bash 명령을 백그라운드에서 실행하여 Claude가 계속 작업할 수 있도록 합니다 (개발 서버, 로그 추적 등에 유용)."},{"category":"other","scope":null,"original":"Customizable status line: add your terminal prompt to Claude Code with /statusline","translated":"사용자 정의 가능한 상태 줄: /statusline을 사용하여 터미널 프롬프트를 Claude Code에 추가하세요."}]},{"version":"1.0.70","date":null,"entries":[{"category":"other","scope":null,"original":"Performance: Optimized message rendering for better performance with large contexts","translated":"성능: 대용량 컨텍스트에서 성능 향상을 위한 메시지 렌더링 최적화"},{"category":"other","scope":null,"original":"Windows: Fixed native file search, ripgrep, and subagent functionality","translated":"Windows: 기본 파일 검색, ripgrep 및 subagent 기능 수정"},{"category":"added","scope":null,"original":"Added support for @-mentions in slash command arguments","translated":"슬래시 명령어 인수에서 @-멘션 지원 추가"}]},{"version":"1.0.69","date":null,"entries":[{"category":"other","scope":null,"original":"Upgraded Opus to version 4.1","translated":"Opus를 버전 4.1로 업그레이드했습니다."}]},{"version":"1.0.68","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fix incorrect model names being used for certain commands like `/pr-comments`","translated":"`/pr-comments`와 같은 특정 명령어에 잘못된 모델 이름이 사용되는 문제 수정"},{"category":"other","scope":null,"original":"Windows: improve permissions checks for allow / deny tools and project trust. This may create a new project entry in `.claude.json` - manually merge the history field if desired.","translated":"Windows: 도구 허용/거부 및 프로젝트 신뢰에 대한 권한 검사를 개선했습니다. 이로 인해 `.claude.json`에 새로운 프로젝트 항목이 생성될 수 있습니다 - 원할 경우 기록 필드를 수동으로 병합하세요."},{"category":"other","scope":null,"original":"Windows: improve sub-process spawning to eliminate \"No such file or directory\" when running commands like pnpm","translated":"Windows: `pnpm`과 같은 명령어 실행 시 \"No such file or directory\" 오류를 제거하기 위해 하위 프로세스 생성 방식을 개선했습니다."},{"category":"improved","scope":null,"original":"Enhanced /doctor command with CLAUDE.md and MCP tool context for self-serve debugging","translated":"/doctor 명령어가 CLAUDE.md 및 MCP 도구 컨텍스트로 강화되어 셀프 서비스 디버깅을 지원합니다."},{"category":"other","scope":null,"original":"SDK: Added canUseTool callback support for tool confirmation","translated":"SDK: 도구 확인을 위한 `canUseTool` 콜백 지원 추가"},{"category":"added","scope":null,"original":"Added `disableAllHooks` setting","translated":"`disableAllHooks` 설정 추가"},{"category":"improved","scope":null,"original":"Improved file suggestions performance in large repos","translated":"대형 저장소에서 파일 제안 성능 개선"}]},{"version":"1.0.65","date":null,"entries":[{"category":"other","scope":null,"original":"IDE: Fixed connection stability issues and error handling for diagnostics","translated":"IDE: 진단을 위한 연결 안정성 문제와 오류 처리를 수정했습니다."},{"category":"other","scope":null,"original":"Windows: Fixed shell environment setup for users without .bashrc files","translated":"Windows: .bashrc 파일이 없는 사용자에 대한 셸 환경 설정을 수정했습니다."}]},{"version":"1.0.64","date":null,"entries":[{"category":"other","scope":null,"original":"Agents: Added model customization support - you can now specify which model an agent should use","translated":"에이전트: 모델 사용자 정의 지원 추가 - 이제 에이전트가 사용할 모델을 지정할 수 있습니다"},{"category":"other","scope":null,"original":"Agents: Fixed unintended access to the recursive agent tool","translated":"에이전트: 재귀 에이전트 도구에 대한 의도치 않은 접근 수정"},{"category":"other","scope":null,"original":"Hooks: Added systemMessage field to hook JSON output for displaying warnings and context","translated":"훅: 경고 및 컨텍스트 표시를 위한 훅 JSON 출력에 systemMessage 필드 추가"},{"category":"other","scope":null,"original":"SDK: Fixed user input tracking across multi-turn conversations","translated":"SDK: 다중 턴 대화에서 사용자 입력 추적 수정"},{"category":"added","scope":null,"original":"Added hidden files to file search and @-mention suggestions","translated":"파일 검색 및 @-멘션 제안에 숨김 파일 추가"}]},{"version":"1.0.63","date":null,"entries":[{"category":"other","scope":null,"original":"Windows: Fixed file search, @agent mentions, and custom slash commands functionality","translated":"Windows: 파일 검색, @agent 멘션, 사용자 지정 슬래시 명령 기능 수정"}]},{"version":"1.0.62","date":null,"entries":[{"category":"added","scope":null,"original":"Added @-mention support with typeahead for custom agents. @<your-custom-agent> to invoke it","translated":"사용자 정의 에이전트를 위한 @-멘션 지원과 자동 완성 기능이 추가되었습니다. @<your-custom-agent>을 사용하여 호출하세요"},{"category":"other","scope":null,"original":"Hooks: Added SessionStart hook for new session initialization","translated":"훅: 새로운 세션 초기화를 위한 SessionStart 훅이 추가되었습니다"},{"category":"other","scope":null,"original":"/add-dir command now supports typeahead for directory paths","translated":"/add-dir 명령어가 이제 디렉토리 경로에 대한 자동 완성을 지원합니다"},{"category":"improved","scope":null,"original":"Improved network connectivity check reliability","translated":"네트워크 연결 상태 점검의 신뢰성이 향상되었습니다"}]},{"version":"1.0.61","date":null,"entries":[{"category":"other","scope":null,"original":"Transcript mode (Ctrl+R): Changed Esc to exit transcript mode rather than interrupt","translated":"대화 모드 (Ctrl+R): Esc 키를 눌러 대화 모드를 종료하도록 변경"},{"category":"other","scope":null,"original":"Settings: Added `--settings` flag to load settings from a JSON file","translated":"설정: JSON 파일에서 설정을 불러오는 `--settings` 플래그 추가"},{"category":"other","scope":null,"original":"Settings: Fixed resolution of settings files paths that are symlinks","translated":"설정: 심볼릭 링크인 설정 파일 경로의 해상도 수정"},{"category":"other","scope":null,"original":"OTEL: Fixed reporting of wrong organization after authentication changes","translated":"OTEL: 인증 변경 후 잘못된 조직 보고 문제 수정"},{"category":"other","scope":null,"original":"Slash commands: Fixed permissions checking for allowed-tools with Bash","translated":"슬래시 명령어: Bash에서 허용된 도구에 대한 권한 확인 문제 수정"},{"category":"other","scope":null,"original":"IDE: Added support for pasting images in VSCode MacOS using ⌘+V","translated":"IDE: VSCode MacOS에서 ⌘+V를 사용하여 이미지 붙여넣기 지원 추가"},{"category":"other","scope":null,"original":"IDE: Added `CLAUDE_CODE_AUTO_CONNECT_IDE=false` for disabling IDE auto-connection","translated":"IDE: IDE 자동 연결을 비활성화하기 위한 `CLAUDE_CODE_AUTO_CONNECT_IDE=false` 추가"},{"category":"added","scope":null,"original":"Added `CLAUDE_CODE_SHELL_PREFIX` for wrapping Claude and user-provided shell commands run by Claude Code","translated":"Claude Code가 실행하는 Claude 및 사용자 제공 셸 명령어를 래핑하기 위한 `CLAUDE_CODE_SHELL_PREFIX` 추가"}]},{"version":"1.0.60","date":null,"entries":[{"category":"other","scope":null,"original":"You can now create custom subagents for specialized tasks! Run /agents to get started","translated":"이제 특수 작업을 위한 맞춤형 하위 에이전트를 생성할 수 있습니다! 시작하려면 /agents를 실행하세요."}]},{"version":"1.0.59","date":null,"entries":[{"category":"other","scope":null,"original":"SDK: Added tool confirmation support with canUseTool callback","translated":"SDK: `canUseTool` 콜백을 통한 도구 확인 지원 추가"},{"category":"other","scope":null,"original":"SDK: Allow specifying env for spawned process","translated":"SDK: 생성된 프로세스에 대한 환경 변수 지정 허용"},{"category":"other","scope":null,"original":"Hooks: Exposed PermissionDecision to hooks (including \"ask\")","translated":"Hooks: `PermissionDecision`을 훅에 노출 (포함 \"ask\")"},{"category":"other","scope":null,"original":"Hooks: UserPromptSubmit now supports additionalContext in advanced JSON output","translated":"Hooks: `UserPromptSubmit`이 고급 JSON 출력에서 `additionalContext`를 지원"},{"category":"fixed","scope":null,"original":"Fixed issue where some Max users that specified Opus would still see fallback to Sonnet","translated":"일부 Max 사용자가 Opus를 지정했음에도 Sonnet으로 대체되는 문제 수정"}]},{"version":"1.0.58","date":null,"entries":[{"category":"added","scope":null,"original":"Added support for reading PDFs","translated":"PDF 읽기 지원 추가"},{"category":"other","scope":null,"original":"MCP: Improved server health status display in 'claude mcp list'","translated":"MCP: 'claude mcp list'에서 서버 상태 표시 개선"},{"category":"other","scope":null,"original":"Hooks: Added CLAUDE_PROJECT_DIR env var for hook commands","translated":"Hooks: 후크 명령어에 CLAUDE_PROJECT_DIR 환경 변수 추가"}]},{"version":"1.0.57","date":null,"entries":[{"category":"added","scope":null,"original":"Added support for specifying a model in slash commands","translated":"슬래시 명령어에서 모델을 지정할 수 있는 기능 추가"},{"category":"improved","scope":null,"original":"Improved permission messages to help Claude understand allowed tools","translated":"권한 메시지를 개선하여 Claude가 허용된 도구를 이해할 수 있도록 지원"},{"category":"fixed","scope":null,"original":"Fix: Remove trailing newlines from bash output in terminal wrapping","translated":"수정: 터미널 래핑에서 bash 출력의 끝에 있는 줄바꿈 제거"}]},{"version":"1.0.56","date":null,"entries":[{"category":"other","scope":null,"original":"Windows: Enabled shift+tab for mode switching on versions of Node.js that support terminal VT mode","translated":"Windows: 터미널 VT 모드를 지원하는 Node.js 버전에서 모드 전환을 위해 shift+tab 활성화"},{"category":"other","scope":null,"original":"Fixes for WSL IDE detection","translated":"WSL IDE 감지 수정"},{"category":"fixed","scope":null,"original":"Fix an issue causing awsRefreshHelper changes to .aws directory not to be picked up","translated":"awsRefreshHelper 변경 사항이 .aws 디렉토리에 반영되지 않는 문제 수정"}]},{"version":"1.0.55","date":null,"entries":[{"category":"other","scope":null,"original":"Clarified knowledge cutoff for Opus 4 and Sonnet 4 models","translated":"Opus 4 및 Sonnet 4 모델의 지식 제한을 명확히 설명"},{"category":"other","scope":null,"original":"Windows: fixed Ctrl+Z crash","translated":"Windows: Ctrl+Z 충돌 수정"},{"category":"other","scope":null,"original":"SDK: Added ability to capture error logging","translated":"SDK: 오류 로그 캡처 기능 추가"},{"category":"added","scope":null,"original":"Add --system-prompt-file option to override system prompt in print mode","translated":"인쇄 모드에서 시스템 프롬프트를 재정의하기 위한 --system-prompt-file 옵션 추가"}]},{"version":"1.0.54","date":null,"entries":[{"category":"other","scope":null,"original":"Hooks: Added UserPromptSubmit hook and the current working directory to hook inputs","translated":"훅: UserPromptSubmit 훅과 현재 작업 디렉토리를 훅 입력에 추가했습니다"},{"category":"other","scope":null,"original":"Custom slash commands: Added argument-hint to frontmatter","translated":"사용자 정의 슬래시 명령어: frontmatter에 인수 힌트를 추가했습니다"},{"category":"other","scope":null,"original":"Windows: OAuth uses port 45454 and properly constructs browser URL","translated":"Windows: OAuth가 포트 45454를 사용하고 브라우저 URL을 올바르게 구성합니다"},{"category":"other","scope":null,"original":"Windows: mode switching now uses alt + m, and plan mode renders properly","translated":"Windows: 모드 전환이 이제 alt + m을 사용하며, 계획 모드가 올바르게 렌더링됩니다"},{"category":"other","scope":null,"original":"Shell: Switch to in-memory shell snapshot to fix file-related errors","translated":"셸: 파일 관련 오류를 수정하기 위해 메모리 내 셸 스냅샷으로 전환했습니다"}]},{"version":"1.0.53","date":null,"entries":[{"category":"changed","scope":null,"original":"Updated @-mention file truncation from 100 lines to 2000 lines","translated":"@-멘션 파일 잘림을 100줄에서 2000줄로 업데이트했습니다."},{"category":"added","scope":null,"original":"Add helper script settings for AWS token refresh: awsAuthRefresh (for foreground operations like aws sso login) and awsCredentialExport (for background operation with STS-like response).","translated":"AWS 토큰 갱신을 위한 헬퍼 스크립트 설정 추가: awsAuthRefresh(aws sso login과 같은 포그라운드 작업용) 및 awsCredentialExport(STS와 유사한 응답을 사용하는 백그라운드 작업용)."}]},{"version":"1.0.52","date":null,"entries":[{"category":"added","scope":null,"original":"Added support for MCP server instructions","translated":"MCP 서버 지침에 대한 지원 추가"}]},{"version":"1.0.51","date":null,"entries":[{"category":"added","scope":null,"original":"Added support for native Windows (requires Git for Windows)","translated":"Windows 네이티브 지원 추가 (Git for Windows 필요)"},{"category":"added","scope":null,"original":"Added support for Bedrock API keys through environment variable AWS_BEARER_TOKEN_BEDROCK","translated":"환경 변수 AWS_BEARER_TOKEN_BEDROCK를 통한 Bedrock API 키 지원 추가"},{"category":"other","scope":null,"original":"Settings: /doctor can now help you identify and fix invalid setting files","translated":"설정: /doctor가 이제 잘못된 설정 파일을 식별하고 수정하는 데 도움을 줄 수 있습니다"},{"category":"other","scope":null,"original":"`--append-system-prompt` can now be used in interactive mode, not just --print/-p.","translated":"`--append-system-prompt`가 이제 --print/-p뿐만 아니라 대화형 모드에서도 사용 가능합니다."},{"category":"other","scope":null,"original":"Increased auto-compact warning threshold from 60% to 80%","translated":"자동 압축 경고 임계값을 60%에서 80%로 증가"},{"category":"fixed","scope":null,"original":"Fixed an issue with handling user directories with spaces for shell snapshots","translated":"쉘 스냅샷에서 공백이 포함된 사용자 디렉터리 처리 문제 수정"},{"category":"other","scope":null,"original":"OTEL resource now includes os.type, os.version, host.arch, and wsl.version (if running on Windows Subsystem for Linux)","translated":"OTEL 리소스에 os.type, os.version, host.arch, wsl.version(Windows Subsystem for Linux에서 실행 중인 경우) 추가"},{"category":"other","scope":null,"original":"Custom slash commands: Fixed user-level commands in subdirectories","translated":"사용자 정의 슬래시 명령: 하위 디렉터리의 사용자 수준 명령 수정"},{"category":"other","scope":null,"original":"Plan mode: Fixed issue where rejected plan from sub-task would get discarded","translated":"계획 모드: 하위 작업에서 거부된 계획이 폐기되는 문제 수정"}]},{"version":"1.0.48","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed a bug in v1.0.45 where the app would sometimes freeze on launch","translated":"v1.0.45에서 앱이 가끔 실행 시 멈추는 버그를 수정했습니다."},{"category":"added","scope":null,"original":"Added progress messages to Bash tool based on the last 5 lines of command output","translated":"명령어 출력의 마지막 5줄을 기반으로 Bash 도구에 진행 메시지를 추가했습니다."},{"category":"added","scope":null,"original":"Added expanding variables support for MCP server configuration","translated":"MCP 서버 구성에 변수 확장 지원을 추가했습니다."},{"category":"other","scope":null,"original":"Moved shell snapshots from /tmp to ~/.claude for more reliable Bash tool calls","translated":"Bash 도구 호출의 신뢰성을 높이기 위해 셸 스냅샷을 /tmp에서 ~/.claude로 이동했습니다."},{"category":"improved","scope":null,"original":"Improved IDE extension path handling when Claude Code runs in WSL","translated":"Claude Code가 WSL에서 실행될 때 IDE 확장 경로 처리를 개선했습니다."},{"category":"other","scope":null,"original":"Hooks: Added a PreCompact hook","translated":"훅: PreCompact 훅을 추가했습니다."},{"category":"other","scope":null,"original":"Vim mode: Added c, f/F, t/T","translated":"Vim 모드: c, f/F, t/T를 추가했습니다."}]},{"version":"1.0.45","date":null,"entries":[{"category":"other","scope":null,"original":"Redesigned Search (Grep) tool with new tool input parameters and features","translated":"새로운 도구 입력 매개변수와 기능을 갖춘 검색(Grep) 도구 재설계"},{"category":"other","scope":null,"original":"Disabled IDE diffs for notebook files, fixing \"Timeout waiting after 1000ms\" error","translated":"노트북 파일에 대한 IDE 차이 비교 비활성화, \"1000ms 후 대기 시간 초과\" 오류 수정"},{"category":"fixed","scope":null,"original":"Fixed config file corruption issue by enforcing atomic writes","translated":"원자적 쓰기를 강제하여 구성 파일 손상 문제 수정"},{"category":"changed","scope":null,"original":"Updated prompt input undo to Ctrl+\\_ to avoid breaking existing Ctrl+U behavior, matching zsh's undo shortcut","translated":"기존 Ctrl+U 동작을 방해하지 않도록 프롬프트 입력 실행 취소를 Ctrl+\\_로 업데이트, zsh의 실행 취소 단축키와 일치"},{"category":"other","scope":null,"original":"Stop Hooks: Fixed transcript path after /clear and fixed triggering when loop ends with tool call","translated":"후크 중지: /clear 이후의 전사 경로 수정 및 도구 호출로 루프가 끝날 때 트리거 수정"},{"category":"other","scope":null,"original":"Custom slash commands: Restored namespacing in command names based on subdirectories. For example, .claude/commands/frontend/component.md is now /frontend:component, not /component.","translated":"사용자 정의 슬래시 명령: 하위 디렉토리를 기반으로 명령 이름에 네임스페이싱 복원. 예를 들어, .claude/commands/frontend/component.md는 이제 /component가 아니라 /frontend:component입니다."}]},{"version":"1.0.44","date":null,"entries":[{"category":"other","scope":null,"original":"New /export command lets you quickly export a conversation for sharing","translated":"새로운 /export 명령어로 대화를 빠르게 내보내어 공유할 수 있습니다."},{"category":"other","scope":null,"original":"MCP: resource_link tool results are now supported","translated":"MCP: resource_link 도구 결과가 이제 지원됩니다."},{"category":"other","scope":null,"original":"MCP: tool annotations and tool titles now display in /mcp view","translated":"MCP: 도구 주석과 도구 제목이 이제 /mcp 보기에서 표시됩니다."},{"category":"changed","scope":null,"original":"Changed Ctrl+Z to suspend Claude Code. Resume by running `fg`. Prompt input undo is now Ctrl+U.","translated":"Ctrl+Z를 Claude Code 일시 중지로 변경했습니다. `fg`를 실행하여 다시 시작하세요. 입력 취소는 이제 Ctrl+U입니다."}]},{"version":"1.0.43","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed a bug where the theme selector was saving excessively","translated":"테마 선택기가 과도하게 저장되던 버그를 수정했습니다"},{"category":"other","scope":null,"original":"Hooks: Added EPIPE system error handling","translated":"Hooks: EPIPE 시스템 오류 처리를 추가했습니다"}]},{"version":"1.0.42","date":null,"entries":[{"category":"added","scope":null,"original":"Added tilde (`~`) expansion support to `/add-dir` command","translated":"`/add-dir` 명령어에 틸드(`~`) 확장 지원 추가"}]},{"version":"1.0.41","date":null,"entries":[{"category":"other","scope":null,"original":"Hooks: Split Stop hook triggering into Stop and SubagentStop","translated":"훅: Stop 훅 트리거를 Stop과 SubagentStop으로 분리"},{"category":"other","scope":null,"original":"Hooks: Enabled optional timeout configuration for each command","translated":"훅: 각 명령어에 대해 선택적 타임아웃 설정 가능"},{"category":"other","scope":null,"original":"Hooks: Added \"hook_event_name\" to hook input","translated":"훅: 훅 입력에 \"hook_event_name\" 추가"},{"category":"fixed","scope":null,"original":"Fixed a bug where MCP tools would display twice in tool list","translated":"MCP 도구가 도구 목록에 두 번 표시되는 버그 수정"},{"category":"other","scope":null,"original":"New tool parameters JSON for Bash tool in `tool_decision` event","translated":"`tool_decision` 이벤트의 Bash 도구에 대한 새로운 도구 매개변수 JSON"}]},{"version":"1.0.40","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed a bug causing API connection errors with UNABLE_TO_GET_ISSUER_CERT_LOCALLY if `NODE_EXTRA_CA_CERTS` was set","translated":"`NODE_EXTRA_CA_CERTS`가 설정된 경우 UNABLE_TO_GET_ISSUER_CERT_LOCALLY로 인해 API 연결 오류가 발생하는 버그를 수정했습니다."}]},{"version":"1.0.39","date":null,"entries":[{"category":"other","scope":null,"original":"New Active Time metric in OpenTelemetry logging","translated":"OpenTelemetry 로깅에 새로운 활성 시간 메트릭 추가"}]},{"version":"1.0.38","date":null,"entries":[{"category":"other","scope":null,"original":"Released hooks. Special thanks to community input in https://github.com/anthropics/claude-code/issues/712. Docs: https://code.claude.com/docs/en/hooks","translated":"훅을 릴리스했습니다. https://github.com/anthropics/claude-code/issues/712에서 커뮤니티의 의견에 특별히 감사드립니다. 문서: https://code.claude.com/docs/en/hooks"}]},{"version":"1.0.37","date":null,"entries":[{"category":"removed","scope":null,"original":"Remove ability to set `Proxy-Authorization` header via ANTHROPIC_AUTH_TOKEN or apiKeyHelper","translated":"ANTHROPIC_AUTH_TOKEN 또는 apiKeyHelper를 통해 `Proxy-Authorization` 헤더를 설정하는 기능 제거"}]},{"version":"1.0.36","date":null,"entries":[{"category":"other","scope":null,"original":"Web search now takes today's date into context","translated":"웹 검색이 이제 오늘 날짜를 고려하여 작동합니다."},{"category":"fixed","scope":null,"original":"Fixed a bug where stdio MCP servers were not terminating properly on exit","translated":"`stdio MCP` 서버가 종료 시 제대로 종료되지 않는 버그를 수정했습니다."}]},{"version":"1.0.35","date":null,"entries":[{"category":"added","scope":null,"original":"Added support for MCP OAuth Authorization Server discovery","translated":"MCP OAuth Authorization Server 검색 지원 추가"}]},{"version":"1.0.34","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed a memory leak causing a MaxListenersExceededWarning message to appear","translated":"메모리 누수로 인해 MaxListenersExceededWarning 메시지가 나타나는 문제를 수정했습니다."}]},{"version":"1.0.33","date":null,"entries":[{"category":"improved","scope":null,"original":"Improved logging functionality with session ID support","translated":"세션 ID 지원을 통한 로깅 기능 개선"},{"category":"added","scope":null,"original":"Added prompt input undo functionality (Ctrl+Z and vim 'u' command)","translated":"입력 취소 기능 추가 (Ctrl+Z 및 vim 'u' 명령어)"},{"category":"other","scope":null,"original":"Improvements to plan mode","translated":"계획 모드 개선"}]},{"version":"1.0.32","date":null,"entries":[{"category":"changed","scope":null,"original":"Updated loopback config for litellm","translated":"litellm의 루프백 설정 업데이트"},{"category":"added","scope":null,"original":"Added forceLoginMethod setting to bypass login selection screen","translated":"로그인 선택 화면을 우회하기 위한 forceLoginMethod 설정 추가"}]},{"version":"1.0.31","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed a bug where ~/.claude.json would get reset when file contained invalid JSON","translated":"파일에 잘못된 JSON이 포함된 경우 ~/.claude.json이 초기화되는 버그를 수정했습니다."}]},{"version":"1.0.30","date":null,"entries":[{"category":"other","scope":null,"original":"Custom slash commands: Run bash output, @-mention files, enable thinking with thinking keywords","translated":"사용자 지정 슬래시 명령: bash 출력 실행, 파일 @멘션, 생각 키워드로 사고 활성화"},{"category":"improved","scope":null,"original":"Improved file path autocomplete with filename matching","translated":"파일 이름 일치로 파일 경로 자동 완성 기능 개선"},{"category":"added","scope":null,"original":"Added timestamps in Ctrl-r mode and fixed Ctrl-c handling","translated":"Ctrl-r 모드에 타임스탬프 추가 및 Ctrl-c 처리 수정"},{"category":"improved","scope":null,"original":"Enhanced jq regex support for complex filters with pipes and select","translated":"파이프 및 선택을 사용한 복잡한 필터에 대한 jq 정규식 지원 강화"}]},{"version":"1.0.29","date":null,"entries":[{"category":"improved","scope":null,"original":"Improved CJK character support in cursor navigation and rendering","translated":"커서 탐색 및 렌더링에서 CJK 문자 지원이 개선되었습니다."}]},{"version":"1.0.28","date":null,"entries":[{"category":"other","scope":null,"original":"Slash commands: Fix selector display during history navigation","translated":"슬래시 명령어: 기록 탐색 중 선택기 표시 수정"},{"category":"other","scope":null,"original":"Resizes images before upload to prevent API size limit errors","translated":"API 크기 제한 오류를 방지하기 위해 업로드 전에 이미지 크기 조정"},{"category":"added","scope":null,"original":"Added XDG_CONFIG_HOME support to configuration directory","translated":"구성 디렉토리에 XDG_CONFIG_HOME 지원 추가"},{"category":"other","scope":null,"original":"Performance optimizations for memory usage","translated":"메모리 사용량에 대한 성능 최적화"},{"category":"other","scope":null,"original":"New attributes (terminal.type, language) in OpenTelemetry logging","translated":"OpenTelemetry 로깅에 새로운 속성(terminal.type, language) 추가"}]},{"version":"1.0.27","date":null,"entries":[{"category":"other","scope":null,"original":"Streamable HTTP MCP servers are now supported","translated":"스트리밍 가능한 HTTP MCP 서버가 이제 지원됩니다."},{"category":"other","scope":null,"original":"Remote MCP servers (SSE and HTTP) now support OAuth","translated":"원격 MCP 서버(SSE 및 HTTP)가 이제 OAuth를 지원합니다."},{"category":"other","scope":null,"original":"MCP resources can now be @-mentioned","translated":"MCP 리소스를 이제 @-멘션할 수 있습니다."},{"category":"other","scope":null,"original":"/resume slash command to switch conversations within Claude Code","translated":"Claude Code 내에서 대화를 전환하기 위한 /resume 슬래시 명령어"}]},{"version":"1.0.25","date":null,"entries":[{"category":"other","scope":null,"original":"Slash commands: moved \"project\" and \"user\" prefixes to descriptions","translated":"슬래시 명령어: \"project\"와 \"user\" 접두사를 설명으로 이동"},{"category":"other","scope":null,"original":"Slash commands: improved reliability for command discovery","translated":"슬래시 명령어: 명령어 검색의 신뢰성 향상"},{"category":"improved","scope":null,"original":"Improved support for Ghostty","translated":"Ghostty 지원 개선"},{"category":"improved","scope":null,"original":"Improved web search reliability","translated":"웹 검색 신뢰성 개선"}]},{"version":"1.0.24","date":null,"entries":[{"category":"improved","scope":null,"original":"Improved /mcp output","translated":"/mcp 출력 개선"},{"category":"fixed","scope":null,"original":"Fixed a bug where settings arrays got overwritten instead of merged","translated":"설정 배열이 병합되지 않고 덮어쓰여지는 버그 수정"}]},{"version":"1.0.23","date":null,"entries":[{"category":"other","scope":null,"original":"Released TypeScript SDK: import @anthropic-ai/claude-code to get started","translated":"TypeScript SDK 출시: 시작하려면 `import @anthropic-ai/claude-code`를 사용하세요"},{"category":"other","scope":null,"original":"Released Python SDK: pip install claude-code-sdk to get started","translated":"Python SDK 출시: 시작하려면 `pip install claude-code-sdk`를 사용하세요"}]},{"version":"1.0.22","date":null,"entries":[{"category":"other","scope":null,"original":"SDK: Renamed `total_cost` to `total_cost_usd`","translated":"SDK: `total_cost`를 `total_cost_usd`로 이름 변경"}]},{"version":"1.0.21","date":null,"entries":[{"category":"improved","scope":null,"original":"Improved editing of files with tab-based indentation","translated":"탭 기반 들여쓰기를 사용하는 파일 편집 개선"},{"category":"fixed","scope":null,"original":"Fix for tool_use without matching tool_result errors","translated":"일치하지 않는 `tool_result` 오류가 있는 `tool_use` 수정"},{"category":"fixed","scope":null,"original":"Fixed a bug where stdio MCP server processes would linger after quitting Claude Code","translated":"`Claude Code` 종료 후에도 `stdio MCP` 서버 프로세스가 남아있는 버그 수정"}]},{"version":"1.0.18","date":null,"entries":[{"category":"added","scope":null,"original":"Added --add-dir CLI argument for specifying additional working directories","translated":"추가 작업 디렉토리를 지정하기 위한 --add-dir CLI 인수가 추가되었습니다."},{"category":"added","scope":null,"original":"Added streaming input support without require -p flag","translated":"-p 플래그 없이 스트리밍 입력 지원이 추가되었습니다."},{"category":"improved","scope":null,"original":"Improved startup performance and session storage performance","translated":"시작 성능 및 세션 저장 성능이 개선되었습니다."},{"category":"added","scope":null,"original":"Added CLAUDE_BASH_MAINTAIN_PROJECT_WORKING_DIR environment variable to freeze working directory for bash commands","translated":"bash 명령어의 작업 디렉토리를 고정하기 위한 CLAUDE_BASH_MAINTAIN_PROJECT_WORKING_DIR 환경 변수가 추가되었습니다."},{"category":"added","scope":null,"original":"Added detailed MCP server tools display (/mcp)","translated":"자세한 MCP 서버 도구 표시(/mcp)가 추가되었습니다."},{"category":"other","scope":null,"original":"MCP authentication and permission improvements","translated":"MCP 인증 및 권한이 개선되었습니다."},{"category":"added","scope":null,"original":"Added auto-reconnection for MCP SSE connections on disconnect","translated":"연결이 끊어졌을 때 MCP SSE 연결의 자동 재연결 기능이 추가되었습니다."},{"category":"fixed","scope":null,"original":"Fixed issue where pasted content was lost when dialogs appeared","translated":"대화 상자가 나타날 때 붙여넣은 내용이 사라지는 문제가 수정되었습니다."}]},{"version":"1.0.17","date":null,"entries":[{"category":"other","scope":null,"original":"We now emit messages from sub-tasks in -p mode (look for the parent_tool_use_id property)","translated":"이제 -p 모드에서 하위 작업의 메시지를 출력합니다 (parent_tool_use_id 속성을 확인하세요)"},{"category":"fixed","scope":null,"original":"Fixed crashes when the VS Code diff tool is invoked multiple times quickly","translated":"VS Code 차이 도구가 빠르게 여러 번 호출될 때 발생하는 충돌 수정"},{"category":"other","scope":null,"original":"MCP server list UI improvements","translated":"MCP 서버 목록 UI 개선"},{"category":"changed","scope":null,"original":"Update Claude Code process title to display \"claude\" instead of \"node\"","translated":"Claude Code 프로세스 제목을 \"node\" 대신 \"claude\"로 표시하도록 업데이트"}]},{"version":"1.0.11","date":null,"entries":[{"category":"other","scope":null,"original":"Claude Code can now also be used with a Claude Pro subscription","translated":"이제 Claude Pro 구독으로도 Claude Code를 사용할 수 있습니다."},{"category":"added","scope":null,"original":"Added /upgrade for smoother switching to Claude Max plans","translated":"Claude Max 요금제로 원활한 전환을 위한 /upgrade 추가"},{"category":"improved","scope":null,"original":"Improved UI for authentication from API keys and Bedrock/Vertex/external auth tokens","translated":"API 키 및 Bedrock/Vertex/외부 인증 토큰을 통한 인증 UI 개선"},{"category":"improved","scope":null,"original":"Improved shell configuration error handling","translated":"셸 구성 오류 처리 개선"},{"category":"improved","scope":null,"original":"Improved todo list handling during compaction","translated":"압축 중 할 일 목록 처리 개선"}]},{"version":"1.0.10","date":null,"entries":[{"category":"added","scope":null,"original":"Added markdown table support","translated":"마크다운 표 지원 추가"},{"category":"improved","scope":null,"original":"Improved streaming performance","translated":"스트리밍 성능 개선"}]},{"version":"1.0.8","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed Vertex AI region fallback when using CLOUD_ML_REGION","translated":"`CLOUD_ML_REGION` 사용 시 Vertex AI 지역 대체 문제 수정"},{"category":"other","scope":null,"original":"Increased default otel interval from 1s -> 5s","translated":"기본 otel 간격을 1초에서 5초로 증가"},{"category":"fixed","scope":null,"original":"Fixed edge cases where MCP_TIMEOUT and MCP_TOOL_TIMEOUT weren't being respected","translated":"`MCP_TIMEOUT` 및 `MCP_TOOL_TIMEOUT`이 제대로 적용되지 않는 경계 사례 수정"},{"category":"fixed","scope":null,"original":"Fixed a regression where search tools unnecessarily asked for permissions","translated":"검색 도구가 불필요하게 권한을 요청하는 회귀 문제 수정"},{"category":"added","scope":null,"original":"Added support for triggering thinking non-English languages","translated":"비영어권 언어에서 사고를 유발하는 기능 추가"},{"category":"improved","scope":null,"original":"Improved compacting UI","translated":"UI 압축 개선"}]},{"version":"1.0.7","date":null,"entries":[{"category":"changed","scope":null,"original":"Renamed /allowed-tools -> /permissions","translated":"/allowed-tools를 /permissions로 이름 변경"},{"category":"other","scope":null,"original":"Migrated allowedTools and ignorePatterns from .claude.json -> settings.json","translated":".claude.json에서 allowedTools와 ignorePatterns를 settings.json으로 이전"},{"category":"removed","scope":null,"original":"Deprecated claude config commands in favor of editing settings.json","translated":"settings.json 편집을 권장하며 claude 설정 명령어 사용 중단"},{"category":"fixed","scope":null,"original":"Fixed a bug where --dangerously-skip-permissions sometimes didn't work in --print mode","translated":"--print 모드에서 --dangerously-skip-permissions가 가끔 작동하지 않던 버그 수정"},{"category":"improved","scope":null,"original":"Improved error handling for /install-github-app","translated":"/install-github-app의 오류 처리 개선"},{"category":"other","scope":null,"original":"Bugfixes, UI polish, and tool reliability improvements","translated":"버그 수정, UI 개선 및 도구 신뢰성 향상"}]},{"version":"1.0.6","date":null,"entries":[{"category":"improved","scope":null,"original":"Improved edit reliability for tab-indented files","translated":"탭으로 들여쓰기된 파일의 편집 안정성을 개선했습니다"},{"category":"other","scope":null,"original":"Respect CLAUDE_CONFIG_DIR everywhere","translated":"모든 곳에서 `CLAUDE_CONFIG_DIR`을 준수합니다"},{"category":"other","scope":null,"original":"Reduced unnecessary tool permission prompts","translated":"불필요한 도구 권한 요청을 줄였습니다"},{"category":"added","scope":null,"original":"Added support for symlinks in @file typeahead","translated":"`@file` 자동 완성에서 심볼릭 링크 지원을 추가했습니다"},{"category":"other","scope":null,"original":"Bugfixes, UI polish, and tool reliability improvements","translated":"버그 수정, UI 개선, 도구 안정성 향상을 진행했습니다"}]},{"version":"1.0.4","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed a bug where MCP tool errors weren't being parsed correctly","translated":"MCP 도구 오류가 올바르게 구문 분석되지 않는 버그를 수정했습니다."}]},{"version":"1.0.1","date":null,"entries":[{"category":"added","scope":null,"original":"Added `DISABLE_INTERLEAVED_THINKING` to give users the option to opt out of interleaved thinking.","translated":"사용자가 교차 사고를 선택 해제할 수 있도록 `DISABLE_INTERLEAVED_THINKING`을 추가했습니다."},{"category":"improved","scope":null,"original":"Improved model references to show provider-specific names (Sonnet 3.7 for Bedrock, Sonnet 4 for Console)","translated":"모델 참조를 개선하여 제공자별 이름을 표시합니다 (Bedrock의 Sonnet 3.7, Console의 Sonnet 4)."},{"category":"changed","scope":null,"original":"Updated documentation links and OAuth process descriptions","translated":"문서 링크 및 OAuth 프로세스 설명을 업데이트했습니다."}]},{"version":"1.0.0","date":null,"entries":[{"category":"other","scope":null,"original":"Claude Code is now generally available","translated":"Claude Code가 이제 일반적으로 사용 가능합니다"},{"category":"other","scope":null,"original":"Introducing Sonnet 4 and Opus 4 models","translated":"Sonnet 4 및 Opus 4 모델 소개"}]},{"version":"0.2.125","date":null,"entries":[{"category":"other","scope":null,"original":"Breaking change: Bedrock ARN passed to `ANTHROPIC_MODEL` or `ANTHROPIC_SMALL_FAST_MODEL` should no longer contain an escaped slash (specify `/` instead of `%2F`)","translated":"중대한 변경 사항: `ANTHROPIC_MODEL` 또는 `ANTHROPIC_SMALL_FAST_MODEL`에 전달되는 Bedrock ARN은 더 이상 이스케이프된 슬래시를 포함해서는 안 됩니다 (`%2F` 대신 `/`를 지정하세요)."},{"category":"removed","scope":null,"original":"Removed `DEBUG=true` in favor of `ANTHROPIC_LOG=debug`, to log all requests","translated":"모든 요청을 기록하기 위해 `DEBUG=true` 대신 `ANTHROPIC_LOG=debug`를 사용하도록 변경했습니다."}]},{"version":"0.2.117","date":null,"entries":[{"category":"other","scope":null,"original":"Breaking change: --print JSON output now returns nested message objects, for forwards-compatibility as we introduce new metadata fields","translated":"주요 변경 사항: --print JSON 출력이 이제 중첩된 메시지 객체를 반환하여, 앞으로 새로운 메타데이터 필드가 도입될 때의 호환성을 보장합니다."},{"category":"other","scope":null,"original":"Introduced settings.cleanupPeriodDays","translated":"settings.cleanupPeriodDays가 도입되었습니다."},{"category":"other","scope":null,"original":"Introduced CLAUDE_CODE_API_KEY_HELPER_TTL_MS env var","translated":"CLAUDE_CODE_API_KEY_HELPER_TTL_MS 환경 변수가 도입되었습니다."},{"category":"other","scope":null,"original":"Introduced --debug mode","translated":"--debug 모드가 도입되었습니다."}]},{"version":"0.2.108","date":null,"entries":[{"category":"other","scope":null,"original":"You can now send messages to Claude while it works to steer Claude in real-time","translated":"이제 Claude가 작업 중일 때 실시간으로 Claude에게 메시지를 보낼 수 있습니다."},{"category":"other","scope":null,"original":"Introduced BASH_DEFAULT_TIMEOUT_MS and BASH_MAX_TIMEOUT_MS env vars","translated":"`BASH_DEFAULT_TIMEOUT_MS` 및 `BASH_MAX_TIMEOUT_MS` 환경 변수가 도입되었습니다."},{"category":"fixed","scope":null,"original":"Fixed a bug where thinking was not working in -p mode","translated":"-p 모드에서 작동하지 않던 문제를 수정했습니다."},{"category":"fixed","scope":null,"original":"Fixed a regression in /cost reporting","translated":"/cost 보고의 회귀 문제를 수정했습니다."},{"category":"removed","scope":null,"original":"Deprecated MCP wizard interface in favor of other MCP commands","translated":"다른 MCP 명령을 위해 MCP 마법사 인터페이스가 사용 중단되었습니다."},{"category":"other","scope":null,"original":"Lots of other bugfixes and improvements","translated":"많은 버그 수정 및 개선이 이루어졌습니다."}]},{"version":"0.2.107","date":null,"entries":[{"category":"other","scope":null,"original":"CLAUDE.md files can now import other files. Add @path/to/file.md to ./CLAUDE.md to load additional files on launch","translated":"CLAUDE.md 파일이 이제 다른 파일을 가져올 수 있습니다. 시작 시 추가 파일을 로드하려면 @path/to/file.md를 ./CLAUDE.md에 추가하세요."}]},{"version":"0.2.106","date":null,"entries":[{"category":"other","scope":null,"original":"MCP SSE server configs can now specify custom headers","translated":"MCP SSE 서버 설정에서 이제 사용자 정의 헤더를 지정할 수 있습니다"},{"category":"fixed","scope":null,"original":"Fixed a bug where MCP permission prompt didn't always show correctly","translated":"MCP 권한 요청이 항상 올바르게 표시되지 않는 버그를 수정했습니다"}]},{"version":"0.2.105","date":null,"entries":[{"category":"other","scope":null,"original":"Claude can now search the web","translated":"Claude가 이제 웹 검색을 할 수 있습니다"},{"category":"other","scope":null,"original":"Moved system & account status to /status","translated":"시스템 및 계정 상태를 /status로 이동했습니다"},{"category":"added","scope":null,"original":"Added word movement keybindings for Vim","translated":"Vim의 단어 이동 키바인딩을 추가했습니다"},{"category":"improved","scope":null,"original":"Improved latency for startup, todo tool, and file edits","translated":"시작, 할 일 도구 및 파일 편집의 지연 시간을 개선했습니다"}]},{"version":"0.2.102","date":null,"entries":[{"category":"improved","scope":null,"original":"Improved thinking triggering reliability","translated":"사고 트리거의 신뢰성 개선"},{"category":"improved","scope":null,"original":"Improved @mention reliability for images and folders","translated":"이미지 및 폴더에 대한 @언급 신뢰성 개선"},{"category":"other","scope":null,"original":"You can now paste multiple large chunks into one prompt","translated":"이제 하나의 프롬프트에 여러 개의 큰 덩어리를 붙여넣을 수 있습니다"}]},{"version":"0.2.100","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed a crash caused by a stack overflow error","translated":"스택 오버플로 오류로 인한 충돌 수정"},{"category":"other","scope":null,"original":"Made db storage optional; missing db support disables --continue and --resume","translated":"데이터베이스 저장소를 선택 사항으로 변경; 데이터베이스 지원이 없으면 --continue 및 --resume이 비활성화됨"}]},{"version":"0.2.98","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed an issue where auto-compact was running twice","translated":"자동 압축이 두 번 실행되는 문제를 수정했습니다."}]},{"version":"0.2.96","date":null,"entries":[{"category":"other","scope":null,"original":"Claude Code can now also be used with a Claude Max subscription (https://claude.ai/upgrade)","translated":"Claude Code는 이제 Claude Max 구독과 함께 사용할 수 있습니다 (https://claude.ai/upgrade)"}]},{"version":"0.2.93","date":null,"entries":[{"category":"other","scope":null,"original":"Resume conversations from where you left off from with \"claude --continue\" and \"claude --resume\"","translated":"\"claude --continue\" 및 \"claude --resume\" 명령어를 사용하여 이전에 중단한 대화부터 다시 시작할 수 있습니다."},{"category":"other","scope":null,"original":"Claude now has access to a Todo list that helps it stay on track and be more organized","translated":"Claude는 이제 할 일 목록에 접근할 수 있어, 더 체계적으로 작업을 진행할 수 있습니다."}]},{"version":"0.2.82","date":null,"entries":[{"category":"added","scope":null,"original":"Added support for --disallowedTools","translated":"`--disallowedTools` 지원 추가"},{"category":"changed","scope":null,"original":"Renamed tools for consistency: LSTool -> LS, View -> Read, etc.","translated":"일관성을 위해 도구 이름 변경: LSTool -> LS, View -> Read 등."}]},{"version":"0.2.75","date":null,"entries":[{"category":"other","scope":null,"original":"Hit Enter to queue up additional messages while Claude is working","translated":"Claude가 작업 중일 때 Enter 키를 눌러 추가 메시지를 대기열에 추가하세요"},{"category":"other","scope":null,"original":"Drag in or copy/paste image files directly into the prompt","translated":"이미지 파일을 드래그하거나 복사하여 프롬프트에 직접 붙여넣으세요"},{"category":"other","scope":null,"original":"@-mention files to directly add them to context","translated":"파일을 @-멘션하여 직접 컨텍스트에 추가하세요"},{"category":"other","scope":null,"original":"Run one-off MCP servers with `claude --mcp-config <path-to-file>`","translated":"`claude --mcp-config <path-to-file>` 명령어로 일회성 MCP 서버를 실행하세요"},{"category":"improved","scope":null,"original":"Improved performance for filename auto-complete","translated":"파일 이름 자동 완성 성능 개선"}]},{"version":"0.2.74","date":null,"entries":[{"category":"added","scope":null,"original":"Added support for refreshing dynamically generated API keys (via apiKeyHelper), with a 5 minute TTL","translated":"`apiKeyHelper`를 통해 동적으로 생성된 API 키의 갱신을 지원하며, TTL은 5분입니다."},{"category":"other","scope":null,"original":"Task tool can now perform writes and run bash commands","translated":"Task 도구가 이제 쓰기 작업을 수행하고 bash 명령어를 실행할 수 있습니다."}]},{"version":"0.2.72","date":null,"entries":[{"category":"changed","scope":null,"original":"Updated spinner to indicate tokens loaded and tool usage","translated":"토큰 로드 및 도구 사용을 나타내도록 스피너 업데이트"}]},{"version":"0.2.70","date":null,"entries":[{"category":"other","scope":null,"original":"Network commands like curl are now available for Claude to use","translated":"이제 Claude가 `curl`과 같은 네트워크 명령어를 사용할 수 있습니다."},{"category":"other","scope":null,"original":"Claude can now run multiple web queries in parallel","translated":"Claude는 이제 여러 웹 쿼리를 병렬로 실행할 수 있습니다."},{"category":"other","scope":null,"original":"Pressing ESC once immediately interrupts Claude in Auto-accept mode","translated":"ESC 키를 한 번 누르면 Auto-accept 모드에서 Claude가 즉시 중단됩니다."}]},{"version":"0.2.69","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed UI glitches with improved Select component behavior","translated":"Select 컴포넌트 동작 개선으로 UI 글리치 수정"},{"category":"improved","scope":null,"original":"Enhanced terminal output display with better text truncation logic","translated":"텍스트 잘림 로직 개선으로 터미널 출력 디스플레이 향상"}]},{"version":"0.2.67","date":null,"entries":[{"category":"other","scope":null,"original":"Shared project permission rules can be saved in .claude/settings.json","translated":"공유 프로젝트 권한 규칙을 `.claude/settings.json`에 저장할 수 있습니다."}]},{"version":"0.2.66","date":null,"entries":[{"category":"other","scope":null,"original":"Print mode (-p) now supports streaming output via --output-format=stream-json","translated":"인쇄 모드(-p)가 이제 --output-format=stream-json을 통해 스트리밍 출력을 지원합니다."},{"category":"fixed","scope":null,"original":"Fixed issue where pasting could trigger memory or bash mode unexpectedly","translated":"붙여넣기 시 메모리 또는 bash 모드가 예상치 않게 활성화되는 문제를 수정했습니다."}]},{"version":"0.2.63","date":null,"entries":[{"category":"fixed","scope":null,"original":"Fixed an issue where MCP tools were loaded twice, which caused tool call errors","translated":"MCP 도구가 두 번 로드되어 도구 호출 오류가 발생하는 문제를 수정했습니다."}]},{"version":"0.2.61","date":null,"entries":[{"category":"other","scope":null,"original":"Navigate menus with vim-style keys (j/k) or bash/emacs shortcuts (Ctrl+n/p) for faster interaction","translated":"더 빠른 상호작용을 위해 vim 스타일 키(j/k) 또는 bash/emacs 단축키(Ctrl+n/p)로 메뉴 탐색"},{"category":"improved","scope":null,"original":"Enhanced image detection for more reliable clipboard paste functionality","translated":"더 신뢰할 수 있는 클립보드 붙여넣기 기능을 위한 이미지 감지 향상"},{"category":"fixed","scope":null,"original":"Fixed an issue where ESC key could crash the conversation history selector","translated":"ESC 키가 대화 기록 선택기를 충돌시킬 수 있는 문제 수정"}]},{"version":"0.2.59","date":null,"entries":[{"category":"other","scope":null,"original":"Copy+paste images directly into your prompt","translated":"이미지를 직접 복사하여 프롬프트에 붙여넣기"},{"category":"improved","scope":null,"original":"Improved progress indicators for bash and fetch tools","translated":"bash 및 fetch 도구의 진행 표시기 개선"},{"category":"other","scope":null,"original":"Bugfixes for non-interactive mode (-p)","translated":"비대화형 모드(-p) 버그 수정"}]},{"version":"0.2.54","date":null,"entries":[{"category":"other","scope":null,"original":"Quickly add to Memory by starting your message with '#'","translated":"메시지를 '#'로 시작하여 메모리에 빠르게 추가하세요"},{"category":"other","scope":null,"original":"Press ctrl+r to see full output for long tool results","translated":"긴 도구 결과의 전체 출력을 보려면 ctrl+r을 누르세요"},{"category":"added","scope":null,"original":"Added support for MCP SSE transport","translated":"MCP SSE 전송 지원 추가"}]},{"version":"0.2.53","date":null,"entries":[{"category":"other","scope":null,"original":"New web fetch tool lets Claude view URLs that you paste in","translated":"새로운 웹 가져오기 도구가 클로드가 붙여넣은 URL을 볼 수 있게 합니다"},{"category":"fixed","scope":null,"original":"Fixed a bug with JPEG detection","translated":"JPEG 감지와 관련된 버그를 수정했습니다"}]},{"version":"0.2.50","date":null,"entries":[{"category":"other","scope":null,"original":"New MCP \"project\" scope now allows you to add MCP servers to .mcp.json files and commit them to your repository","translated":"새로운 MCP \"프로젝트\" 범위를 통해 MCP 서버를 .mcp.json 파일에 추가하고 이를 저장소에 커밋할 수 있습니다."}]},{"version":"0.2.49","date":null,"entries":[{"category":"other","scope":null,"original":"Previous MCP server scopes have been renamed: previous \"project\" scope is now \"local\" and \"global\" scope is now \"user\"","translated":"이전 MCP 서버 범위가 이름이 변경되었습니다: 이전 \"project\" 범위는 이제 \"local\"이고 \"global\" 범위는 이제 \"user\"입니다."}]},{"version":"0.2.47","date":null,"entries":[{"category":"other","scope":null,"original":"Press Tab to auto-complete file and folder names","translated":"파일 및 폴더 이름 자동 완성을 위해 Tab 키를 누르세요"},{"category":"other","scope":null,"original":"Press Shift + Tab to toggle auto-accept for file edits","translated":"파일 편집 자동 수락을 전환하려면 Shift + Tab을 누르세요"},{"category":"other","scope":null,"original":"Automatic conversation compaction for infinite conversation length (toggle with /config)","translated":"무한 대화 길이를 위한 자동 대화 압축 기능 (/config로 전환)"}]},{"version":"0.2.44","date":null,"entries":[{"category":"other","scope":null,"original":"Ask Claude to make a plan with thinking mode: just say 'think' or 'think harder' or even 'ultrathink'","translated":"Claude에게 계획을 세우도록 요청하세요: 'think', 'think harder', 또는 'ultrathink'이라고 말하세요."}]},{"version":"0.2.41","date":null,"entries":[{"category":"other","scope":null,"original":"MCP server startup timeout can now be configured via MCP_TIMEOUT environment variable","translated":"이제 MCP 서버 시작 시간 초과를 `MCP_TIMEOUT` 환경 변수로 설정할 수 있습니다."},{"category":"other","scope":null,"original":"MCP server startup no longer blocks the app from starting up","translated":"MCP 서버 시작이 더 이상 앱 시작을 차단하지 않습니다."}]},{"version":"0.2.37","date":null,"entries":[{"category":"other","scope":null,"original":"New /release-notes command lets you view release notes at any time","translated":"새로운 /release-notes 명령어로 언제든지 릴리스 노트를 볼 수 있습니다"},{"category":"other","scope":null,"original":"`claude config add/remove` commands now accept multiple values separated by commas or spaces","translated":"`claude config add/remove` 명령어가 이제 쉼표나 공백으로 구분된 여러 값을 허용합니다"}]},{"version":"0.2.36","date":null,"entries":[{"category":"other","scope":null,"original":"Import MCP servers from Claude Desktop with `claude mcp add-from-claude-desktop`","translated":"`claude mcp add-from-claude-desktop` 명령어를 사용하여 Claude Desktop에서 MCP 서버를 가져옵니다."},{"category":"added","scope":null,"original":"Add MCP servers as JSON strings with `claude mcp add-json <n> <json>`","translated":"`claude mcp add-json <n> <json>` 명령어를 사용하여 MCP 서버를 JSON 문자열로 추가합니다."}]},{"version":"0.2.34","date":null,"entries":[{"category":"other","scope":null,"original":"Vim bindings for text input - enable with /vim or /config","translated":"텍스트 입력을 위한 Vim 바인딩 - /vim 또는 /config로 활성화"}]},{"version":"0.2.32","date":null,"entries":[{"category":"other","scope":null,"original":"Interactive MCP setup wizard: Run \"claude mcp add\" to add MCP servers with a step-by-step interface","translated":"인터랙티브 MCP 설정 마법사: 단계별 인터페이스로 MCP 서버를 추가하려면 \"claude mcp add\"를 실행하세요"},{"category":"fixed","scope":null,"original":"Fix for some PersistentShell issues","translated":"일부 PersistentShell 문제 수정"}]},{"version":"0.2.31","date":null,"entries":[{"category":"other","scope":null,"original":"Custom slash commands: Markdown files in .claude/commands/ directories now appear as custom slash commands to insert prompts into your conversation","translated":"사용자 지정 슬래시 명령어: .claude/commands/ 디렉토리의 Markdown 파일이 이제 대화에 프롬프트를 삽입하는 사용자 지정 슬래시 명령어로 표시됩니다."},{"category":"other","scope":null,"original":"MCP debug mode: Run with --mcp-debug flag to get more information about MCP server errors","translated":"MCP 디버그 모드: --mcp-debug 플래그를 사용하여 MCP 서버 오류에 대한 더 많은 정보를 얻을 수 있습니다."}]},{"version":"0.2.30","date":null,"entries":[{"category":"added","scope":null,"original":"Added ANSI color theme for better terminal compatibility","translated":"터미널 호환성을 개선하기 위해 ANSI 색상 테마를 추가했습니다."},{"category":"fixed","scope":null,"original":"Fixed issue where slash command arguments weren't being sent properly","translated":"슬래시 명령어 인수가 제대로 전송되지 않던 문제를 수정했습니다."},{"category":"other","scope":null,"original":"(Mac-only) API keys are now stored in macOS Keychain","translated":"(Mac 전용) API 키가 이제 macOS 키체인에 저장됩니다."}]},{"version":"0.2.26","date":null,"entries":[{"category":"other","scope":null,"original":"New /approved-tools command for managing tool permissions","translated":"도구 권한 관리를 위한 새로운 /approved-tools 명령어 추가"},{"category":"other","scope":null,"original":"Word-level diff display for improved code readability","translated":"코드 가독성을 향상시키기 위한 단어 수준 차이 표시"},{"category":"other","scope":null,"original":"Fuzzy matching for slash commands","translated":"슬래시 명령어에 대한 퍼지 매칭 추가"}]},{"version":"0.2.21","date":null,"entries":[{"category":"other","scope":null,"original":"Fuzzy matching for /commands","translated":"/commands에 대한 퍼지 매칭 추가"}]}]}